<script setup>
import Header from "@/components/Header.vue";
import Footer from "@/components/Footer.vue";
import { onMounted, ref, onBeforeUnmount } from "vue";
import store from "@/store";
import CallPhoneButton from "./CallPhoneButton.vue";
let windowWidth = window.innerWidth

const onResize = () => {
  windowWidth = window.innerWidth
}
onMounted(() => {
  nextTick(() => {
    window.addEventListener('resize', onResize)

  })
})
onBeforeUnmount(() => {
  window.removeEventListener('resize', onResize)
})
const entrogenData = store.state.entrogenData;
const { title, description } = entrogenData;

const colorectalCancerType = [
  {
    title: "KRAS/BRAF მუტაციის ანალიზის ნაკრები",
    linkTitle: "k-ras-and-b-raf-mutation-analysis-kits",
    description: `KRAS გენი აკოდირებს მცირე ზომის GTP-აზას, რომელიც მთავარ როლს ასრულებს ეპიდერმული ზრდის ფაქტორის რეცეპტორიდან (EGFR) სიგნალის გადაცემაში უჯრედშიდა ეფექტორ ცილებამდე. KRAS მუტაციები ჩვეულებრივ გვხვდება ადამიანის ავთვისებიანი სიმსივნეების რამდენიმე ტიპში, როგორიცაა მეტასტაზური მსხვილი ნაწლავის კიბო (mCRC), ფილტვის ადენოკარცინომა და ფარისებრი ჯირკვლის კიბო. ყველაზე გავრცელებული მუტაციები გვხვდება 12, 13 და 61 კოდონებში. რამდენიმე კვლევამ აჩვენა, რომ სიმსივნეები, რომლებიც ატარებენ KRAS გენის რომელიმე მუტანტის ფორმას, ნაკლებად რეაგირებენ ანტი-EGFR ანტისხეულების თერაპიაზე. 
კლინიკური ონკოლოგიის ამერიკულმა საზოგადოებამ (ASCO) ახლახან გამოაქვეყნა თავისი პირველი დროებითი კლინიკური მოსაზრება (PCO), რომელიც ვარაუდობს, რომ ყველა პაციენტი, რომელსაც ჩაუტარდება ანტი-EGFR მონოკლონური ანტისხეულების თერაპია (მაგ. ცეტუქსიმაბი, პანიტუმუმაბი და ერლოტნიბი) უნდა შემოწმდეს KRAS მუტაციებზე. ბოლო კვლევებმა ასევე აჩვენა, რომ ყველა mCRC პაციენტი ველური ტიპის KRAS სიმსივნეებით არ პასუხობს ანტი-EGFR თერაპიას. ეს მიუთითებს იმაზე, რომ დამატებითი გენები და/ან გზები შეიძლება იყოს ჩართული ამ წამლების მიმართ რეზისტენტობის მექანიზმში. 
ამასთანავე, მუტაციები BRAF-ში (EGF-კასკადის ერთ-ერთი მონაწილე), გამოვლენილია mCRC სიმსივნეების 8%-მდე შემთხვევებში. აქედან გამომდინარე,  KRAS და BRAF მუტაციების სკრინინგი აუცილებელია სიმსივნური უჯრედების უფრო ზუსტად იდენტიფიცირებისთვის, რომლებიც არ რეაგირებენ ანტი-EGFR პრეპარატებზე.
`,
    code: "KRBR-RT50",
    active: false,
  },
  {
    title: "RAS მუტაციის ანალიზის ნაკრები",
    linkTitle: "ras-mutation-screening-panel",
    description: `KRAS და NRAS არიან GTPase-ების RAS ოჯახის წევრები, რომლებიც ცენტრალურ როლს თამაშობენ MAPK კასკადში. გააქტიურებული მუტაციები ეგზონ 2-ში (კოდონი 12/13), ეგზონ 3-სა (კოდონი 59/61) და ეგზონ 4 (კოდონი 117/146) აღმოჩენილია სხვადასხვა კიბოს დროს, მათ შორის მსხვილი ნაწლავის კიბოს მეტასტაზურ ფორმებში.  ამ დაავადებით დიაგნოზირებულ პაციენტებში ანტი-EGFR მიზნობრივი თერაპიის გამოყენების დროს ჩატარებულმა კლინიკურმა კვლევებმა აჩვენა, რომ სიმსივნეები, რომლებსაც აქვთ KRAS და NRAS მუტაციები, ნაკლებად რეაგირებენ ასეთ თერაპიაზე (Clin Cancer Res 2013; 19:1902-1912).
ნაკრების მახასიათებლები
RAS მუტაციის სკრინინგის პანელი აღმოაჩენს სომატურ მუტაციებს KRAS და NRAS გენების 2, 3 და 4 ეგზონებში.`,
    code: "RAS-RT50",
    active: false,
  },
  {
    title: "PIK3CA მუტაციის ანალიზის ნაკრები",
    linkTitle: "pik3ca-mutation-analysis-kit",
    description: `PIK3CA გენი აკოდირებს ფოსფატიდილ 3-კინაზას p110a ქვეერთეულს, რომელიც მონაწილეობს უჯრედების ზრდაში, პროლიფერაციაში, მოძრაობასა და გადარჩენაში. იგი PI3K-AKT-mTOR სიგნალის გადაცემის გზის ერთ-ერთი მთავარი მონაწილეა. PIK3CA გენის სომატური მუტაციები ჩართულია რამდენიმე კიბოს პათოგენეზში, როგორიცაა: მსხვილი ნაწლავის კიბო, გლიომები, კუჭის კიბო, ძუძუს კიბო, ენდომეტრიუმის კიბო და ფილტვის კიბო.
PIK3CA მუტაციები ჩვეულებრივ თავს იჩენს ეგზონ 9-ში, რომელიც აკოდირებს ხვეულ დომენსა და ეგზონ 20-ს. ეს უკანასკნელი, თავის მხრივ, თავის მხრივ აკოდირებს კინაზას დომენს.
`,
    code: "PI3K-RT48",
    active: false,
  },
  {
    title: "NRAS მუტაციის ანალიზის ნაკრები",
    linkTitle: "nras-mutation-detection-kit",
    description: `NRAS არის GTPase-ების RAS ოჯახის წევრი და ცენტრალურ როლს ასრულებს MAPK სასიგნალო გზაზე. გააქტიურებული მუტაციები ეგზონ 2-ში (კოდონი 12/13), ეგზონ 3 (კოდონი 61) და ეგზონი 4 (კოდონი 146) აღმოჩენილია სხვადასხვა კიბოს დროს, მათ შორის მელანომა (13-25%), მსხვილი ნაწლავის კიბო (1-6%). ფილტვის კიბო (1%), ჰეპატოცელულარული კარცინომა (10%), მიელოიდური ლეიკემიები (14%) და ფარისებრი ჯირკვლის კარცინომა (7%). ქვემოთ მოყვანილი ცხრილი ჩამოთვლის მუტაციებს, რომლებიც აღმოჩენილია NRAS Mutation Detection ნაკრების მიერ.

ეგზონის მუტაციის სახელი ნუკლეოტიდის ცვლილება ამინომჟავის ცვლილება
2 G12C c.34G>T გლიცინი (G) ცისტეინი (C)
G12D c.35G>A გლიცინი (G) ასპარტატი (D)
G12S c.34G>A გლიცინი (G) სერინი (S)
G13V c.38G>T გლიცინი (G) ვალინი (V)
G13R c.37G>C გლიცინი (G) არგინინი (R)
3 Q61K c.181C>A გლუტამინი (Q) ლიზინი (K)
Q61R c.182A>G გლუტამინი (Q) არგინინი (R)
Q61L c.182A>T გლუტამინი (Q) ლეიცინი (L)
Q61H c.183A>C & c.183A>T გლუტამინი (Q) ჰისტიდინი (H)
4 A146T c.436G>A ალანინი (A) თრეონინი (T)
გაფართოებული დაფარვისთვის, RAS c.59/117 მუტაციის გამოვლენის ნაკრები აღმოაჩენს KRAS c.59, NRAS c.59/117 სომატურ მუტაციებს. EntroGen-ის NRAS მუტაციის გამოვლენის ნაკრები არის პოლიმერაზულ ჯაჭვურ რეაქციაზე (PCR) დაფუძნებული ანალიზი, რომელიც იყენებს ალელისთვის სპეციფიკურ პრაიმერებს ზემოთ ჩამოთვლილი მუტაციების არსებობის დასადგენად. ტესტირების პროცედურა მოიცავს სამ (3) მარტივ ნაბიჯს:
•	დნმ-ის იზოლაცია სიმსივნის ბიოფსიიდან, პარაფინში ჩაშენებული სექციებიდან (FFPE) ან ახლად გაყინული სიმსივნეებიდან
•	NRAS გენის რეგიონების ამპლიფიკაცია ალელური სპეციფიური პრაიმერების გამოყენებით.
•	ამპლიფიცირებული პროდუქტის გამოვლენა რეალურ დროში PCR დანადგარზე.
ეს ტესტი შეიძლება დასრულდეს დაახლოებით 2 საათში დნმ-ის იზოლირებიდან ტესტის შედეგამდე.
`,
    code: "NRAS-RT50",
    active: false,
  },
  {
    title: "კოლორექტალური კიბოს მუტაციის გამოვლენის პანელი",
    linkTitle: "colorectal-cancer-mutation-detection-pane",
    description: `მსხვილი ნაწლავის კიბო (CRC) ვითარდება გენეტიკური ცვლილებების პროგრესული დაგროვების გზით, რომლებიც კოდირებენ პროტეინებს, რომლებიც ჩართულია ეპიდერმული ზრდის ფაქტორის რეცეპტორის (EGFR) ქვემოთ ბილიკებში. KRAS, NRAS, BRAF, PIK3CA და AKT1 სომატური მუტაციები ჩვეულებრივ გვხვდება CRC-ში პრევალენტობით 36-40%, 1-6%, 8-10%, 10-30% და 1-6%, შესაბამისად.
KRAS გენი აკოდირებს პატარა GTP-აზას, რომელიც მთავარ როლს ასრულებს ეპიდერმული ზრდის ფაქტორის რეცეპტორიდან (EGFR) სიგნალების გადაცემაში ქვედა ეფექტურებამდე. KRAS მუტაციები ჩვეულებრივ გვხვდება ადამიანის ავთვისებიანი სიმსივნეების რამდენიმე ტიპში, როგორიცაა მეტასტაზური მსხვილი ნაწლავის კიბო (mCRC), ფილტვის ადენოკარცინომა და ფარისებრი ჯირკვლის კიბო. ყველაზე გავრცელებული მუტაციები გვხვდება KRAS-ის 12 და 13 კოდონებში. რამდენიმე კვლევამ აჩვენა, რომ სიმსივნეები, რომლებიც ატარებენ KRAS გენის რომელიმე მუტანტის ფორმას, ნაკლებად რეაგირებენ ანტი-EGFR ანტისხეულების თერაპიაზე (Van Cutsem et al. 2011). 
`,
    code: "CRC-RT48",
    active: false,
  },
  {
    title: "ctDNA RAS მუტაციის გამოვლენის ნაკრები",
    description:
      "ctDNA RAS მუტაციის გამოვლენის ნაკრები არის არაინვაზიური, ულტრამგრძნობიარე ტესტი, რომელიც შერჩევით აძლიერებს და აღმოაჩენს 25 კლინიკურად მნიშვნელოვან KRAS ეგზონ 2 და NRAS ეგზონ 2 და 3 მუტაციას მოცირკულირე უჯრედისგან თავისუფალი დნმ-დან, რომელიც მიღებულია ადამიანის პლაზმიდან.",
    linkTitle: "ctras-mutation-detection-kit",
    code: "CTRAS-RT40",
    active: false,
  },
  {
    title: "MLH1 მეთილაციის გამოვლენის ნაკრები",
    linkTitle: "mlh1-methylation-detection-kit",
    description:
      "ლინჩის სინდრომი (LS) არის აუტოსომური დომინანტური გენეტიკური დაავადება, რომელიც ასოცირდება ადრეული მსხვილი ნაწლავის კიბოსთან (CRC) და სხვა სიმსივნეებთან. ეს გამოწვეულია ე.წ. ჩანასახოვანი მუტაციებით და შეუსაბამობის აღდგენის გენების (Mis-Match Repair) ინჰიბირებით. ყველაზე გავრცელებული მუტაციებია MLH1 და MSH2. ამ სიმსივნეების უმეტესობას ახასიათებს მიკროსატელიტური არასტაბილურობა (MSI; LS სიმსივნეების >90%) და არ გააჩნია BRAF მუტაციები. თუმცა, შეუსაბამობის აღდგენის გენების ,,გაჩუმება“ ასევე შეიძლება გამოწვეული იყოს სომატური პრომოტორის მეთილაციის შედეგად არა-LS სიმსივნეებში.",
    code: "MLH1-RT24",
    active: false,
  },
];
const lungCancerType = [
  {
    title: "EGFR მუტაციის ანალიზის ნაკრები",
    linkTitle: "egfr-mutation-analysis-kit",
    description:
      "ეპიდერმული ზრდის ფაქტორის რეცეპტორი (EGFR) არის მემბრანის ცილა, რომელიც ცენტრალურ როლს ასრულებს სიგნალების გადაცემაში, რომლებიც ხელს უწყობენ უჯრედების ზრდას და პროლიფერაციას. მისი თიროზინკინაზას (TK) დომენი ააქტიურებს რამდენიმე ქვედა კასკადის ეფექტორს, რაც იწვევს Ras-Raf-MAPK გზის გააქტიურებას. გადაჭარბებული ექსპრესია და ონკოგენური მუტაციები, რომლებიც ააქტიურებენ EGFR-ის TK დომენს, აღმოჩენილია სხვადასხვა სოლიდურ სიმსივნეებში. გარდა ამისა, ნაჩვენებია, რომ EGFR-ის გადაჭარბებული გააქტიურება დაკავშირებულია კიბოს მოწინავე სტადიებთან და ცუდი პროგნოზით.",
    code: "EGFR-RT52",
    active: false,
  },
  {
    title: "PIK3CA მუტაციის ანალიზის ნაკრები",
    linkTitle: "pik3ca-mutation-analysis-kit",
    description: `PIK3CA გენი აკოდირებს ფოსფატიდილ 3-კინაზას p110a ქვეერთეულს, რომელიც მონაწილეობს უჯრედების ზრდაში, პროლიფერაციაში, მოძრაობასა და გადარჩენაში. იგი PI3K-AKT-mTOR სიგნალის გადაცემის გზის ერთ-ერთი მთავარი მონაწილეა. PIK3CA გენის სომატური მუტაციები ჩართულია რამდენიმე კიბოს პათოგენეზში, როგორიცაა: მსხვილი ნაწლავის კიბო, გლიომები, კუჭის კიბო, ძუძუს კიბო, ენდომეტრიუმის კიბო და ფილტვის კიბო.
PIK3CA მუტაციები ჩვეულებრივ თავს იჩენს ეგზონ 9-ში, რომელიც აკოდირებს ხვეულ დომენსა და ეგზონ 20-ს. ეს უკანასკნელი, თავის მხრივ, თავის მხრივ აკოდირებს კინაზას დომენს.
`,
    code: "PI3K-RT48",
    active: false,
  },
  {
    title: "ctDNA EGFR მუტაციის გამოვლენის ნაკრები",
    description:
      "ფილტვის არაწვრილუჯრედოვანი კიბოს მქონე პაციენტების სიმსივნური ქსოვილი რეგულარულად შემოწმდება სომატური მუტაციების არსებობაზე ეპიდერმული ზრდის ფაქტორის რეცეპტორში (EGFR) EGFR ტიროზინკინაზას ინჰიბიტორის (TKI) თერაპიაზე პასუხის პროგნოზირების მიზნით. თუმცა, შემთხვევების მნიშვნელოვან რაოდენობაში, სიმსივნური ქსოვილი არ არის საკმარისი რაოდენობით ზუსტი მოლეკულური ტესტირებისთვის. უახლესმა კვლევებმა აჩვენა, რომ სარგებლობა უჯრედისგან თავისუფალი სიმსივნის დნმ-ის (ctDNA) პლაზმიდან, როგორც გენომის მასალის ალტერნატიული წყარო ფილტვის კიბოს დროს სენსიბილიზაციისა და რეზისტენტობის მუტაციების გამოსავლენად.",
    code: "CTEGFR-48",
    linkTitle: "ctegfr-mutation-detection-kit",
    active: false,
  },
  {
    title: "ფილტვის კიბოს რნმ პანელი",
    description: `შერწყმული გენები ფილტვის კიბოში
ფილტვის არაწვრილუჯრედოვანი კიბო (NSCLC) ხშირად ასოცირდება თიროზინკინაზას აბერანტულ აქტივობასთან, რომელიც არანორმალურად ააქტიურებს ქვედა კასკადის სასიგნალო გზებს. თიროზინკინაზას აბერანტული აქტივობა დაკავშირებულია ქრომოსომულ ტრანსლოკაციებთან, რომლებიც მოიცავს ALK, ROS1 და RET. ისინი გვხვდება NSCLC-ით დაავადებული პაციენტების 3-7%, ~2% და ~1%-ში, შესაბამისად. ALK და ROS1 შერწყმული გენების არსებობა პროგნოზირებს პასუხს თიროზინკინაზას ინჰიბიტორებზე (TKIs) (კრიზოტინიბი, ცერიტინიბი და ალექტინიბი). RET შერწყმული გენებიდ მქონე ფილტვის კიბოთი დაავადებული პაციენტები შეიძლება დაექვემდებარონ RET ინჰიბიტორებით (ვანდეტანიბი და კაბოზანტინიბი) მკურნალობას, რომლებიც დამტკიცებულია ფარისებრი ჯირკვლის კიბოს სამკურნალოდ.
MET ეგზონ 14 გამოტოვებული მუტაციები ასევე ხშირად ვლინდება ფილტვის ადენოკარცინომაში და გვხვდება პაციენტების 3-4%-ში. პაციენტები, რომლებიც დადებითია MET ეგზონ 14-ის გამოტოვების მუტაციებზე, აჩვენებენ გაზრდილ მგრძნობელობას MET ინჰიბიტორების მიმართ (კრიზოტინიბი და კაბოზანტინიბი).
`,
    code: "LUNG-RT48",
    linkTitle: "lung-cancer-gene-panel-alk-ret-ros1",
    active: false,
  },
  {
    title: "ctDNA RAS მუტაციის გამოვლენის ნაკრები",
    description: `უჯრედებისგან თავისუფალი მუტაციის გამოვლენა KRAS-სა და NRAS-ში მუტაციები აღმოჩენილია რიგ ავთვისებიან სიმსივნეებში, განსაკუთრებით მეტასტაზური მსხვილი ნაწლავის კიბო, ფილტვის ადენოკარცინომა და ფარისებრი ჯირკვლის კიბო. რამდენიმე კვლევამ აჩვენა, რომ KRAS-სა და NRAS-ის სპეციფიკური მუტაციები ნაკლებად რეაგირებენ ანტი-EGFR თერაპიაზე. [1, 2, 3] შემუშავებულია რამდენიმე დიაგნოსტიკა ასეთი მუტაციების დასადგენად. თუმცა, კიბოს პაციენტთა დიდ რაოდენობაში, სიმსივნის ბიოფსია წარმოადგენს ჯანმრთელობის მნიშვნელოვან რისკს, რითაც ზღუდავს ქსოვილს, რომელიც ხელმისაწვდომია მიმდინარე მოლეკულური დიაგნოსტიკისთვის. არაინვაზიური თხევადი ბიოფსიის დიაგნოსტიკა ახდენს რევოლუციას კიბოს მკურნალობის შერჩევაში, პაციენტის პროგნოზსა და მონიტორინგში. ამჟამად ხელმისაწვდომ qPCR კომპლექტებს RAS მუტაციების გამოსავლენად, აქვთ შეზღუდული მგრძნობელობა და დაფარვა, რადგან ისინი არ არის ოპტიმიზირებული თხევადი ბიოფსიის მიზნებისთვის.
ამ ცოტა ხნის დაიწყეს უჯრედებისგან თავისუფალ დნმ-ში აღმოჩენილი KRAS მუტაციის მნიშვნელობის ინტენსიური კვლევა. მიუხედავად იმისა, რომ საჭიროა დამატებითი მონაცემები, მეტა-ანალიზმა აჩვენა, რომ კიბოს პაციენტის cfDNA-ში KRAS მუტაცია, როგორც ჩანს, გვევლინება გადარჩენის პროგნოზული ბიომარკერად. [4]
ctDNA RAS მუტაციის გამოვლენის ნაკრები არის არაინვაზიური, ულტრამგრძნობიარე ტესტი, რომელიც შერჩევით აძლიერებს და აღმოაჩენს 25 კლინიკურად მნიშვნელოვან KRAS ეგზონ 2 და NRAS ეგზონ 2 და 3 მუტაციას მოცირკულირე უჯრედისგან თავისუფალი დნმ-დან, რომელიც მიღებულია ადამიანის პლაზმიდან.
`,
    code: "CTRAS-RT40",
    linkTitle: "ctras-mutation-detection-kit",
    active: false,
  },
];
const glioblastomaType = [
  {
    title: "MGMT მეთილაციის გამოვლენის ნაკრები",
    description: `მულტიფორმული გლიობლასტომა (GBM) წარმოადგენს თავის ტვინის სიმსივნის ყველაზე მომაკვდინებელ ფორმას ადამიანებში, მიმდინარე მკურნალობა, როგორც წესი, იძლევა მხოლოდ მცირე სარგებელს საერთო გადარჩენისთვის. ბოლოდროინდელმა მიღწევებმა მოლეკულური ქვეტიპების გაგებაში გამოიწვია რიგი ბიომარკერების იდენტიფიცირება GBM-ის უფრო ზუსტი კლასიფიკაციისთვის. ეს მოლეკულური მარკერები აჩვენებენ GBM პაციენტების უკეთესი დიაგნოსტიკისა და პროგნოზის პოტენციალს.
MGMT პრომოტორის მეთილაციის სტატუსი მიიჩნევა მნიშვნელოვანი ბიომარკერი ალკილაციური ქიმიოთერაპიის მიმართ რეაგირების დასადგენად. MGMT პრომოტორის მეთილაცია იწვევს მგრძნობელობის გაზრდას ალკილირების აგენტების მიმართ, როგორიცაა ტემოზოლომიდი და ახლახან ნაჩვენებია, რომ მას აქვს ძლიერი ხელსაყრელი პროგნოზული მნიშვნელობა.
ნაკრების მახასიათებლები
EntroGen-ის MGMT პრომოტორის მეთილაციის ნაკრები არის პოლიმერაზულ ჯაჭვურ რეაქციაზე (PCR) დაფუძნებული ანალიზი, რომელიც იყენებს ალელისთვის სპეციფიკურ პრაიმერებს მულტიპლექს რეაქციაში მათი სამიზნის იდენტიფიცირებისთვის. ის მუშაობს ეპიგენეტიკურად ინჰიბირებული MGMT პრომოტორის რეგიონების გაძლიერებით დნმ-ის ბისულფიტით დამუშავების შემდეგ MGMT პრომოტორის მეთილაციის სტატუსის დასადგენად. თითოეულ კომპლექტს მიეწოდება პრაიმერის/ზონდის ნაკრები, როგორც სამიზნე, ასევე შიდა კონტროლის გენების მულტიპლექსირებული გამოვლენისთვის. კომპლექტში შედის ბისულფიტის კონვერტაციის ნაკრები.
`,
    code: "MGMT-RT44",
    linkTitle: "glioblastoma-panel",
    active: false,
  },
  {
    title: "IDH1/2 მუტაციის გამოვლენის ნაკრები",
    description: `იზოციტრატდეჰიდროგენაზა 1 და 2 (IDH1/2) არის ძირითადი ფერმენტები უჯრედულ მეტაბოლიზმში, ეპიგენეტიკურ რეგულაციაში, რედოქს მდგომარეობებში და დნმ-ის შეკეთებაში. IDH1/2-ის მუტაციებმა შეიძლება გამოიწვიოს სხვადასხვა ტიპის კიბოს განვითარება და/ან პროგრესირება, მათ შორის მეორადი გლიობლასტომა და მწვავე მიელოიდური ლეიკემია (AML). IDH1/2 მუტაციები დაკავშირებულია არანორმალურ ჰისტონთან და დნმ-ის მეთილაციასთან, რამაც შეიძლება გამოიწვიოს ღეროვანი უჯრედების დიფერენციაცია და საბოლოო სიმსივნე. IDH1/2 მუტაციების უნიკალური თვისებები მათ კარგ ბიომარკერებად და წამლის პერსპექტიულ სამიზნეებად აქცევს.
გლიობლასტომა
IDH 1/2 მუტაციები იდენტიფიცირებულია ძირითადად მეორად GBM-ში და ახლახან ნაჩვენებია, რომ მას აქვს ძლიერი ხელსაყრელი პროგნოზული მნიშვნელობა. გარდა ამისა, მტკიცებულებები აჩვენებს, რომ IDH მუტაციები მჭიდრო კავშირშია MGMT პრომოტორ მეთილაციასთან. MGMT პრომოტორის მეთილაცია იწვევს ალკილატორული აგენტების მიმართ მგრძნობელობის გაზრდას, როგორიცაა ტემოზოლომიდი, და აქვს IDH მუტაციების მსგავსი პროგნოზული მნიშვნელობა. IDH1/2 მუტაციები პროგნოზირებადია GBM-ში და დაკავშირებულია უკეთეს შედეგთან, ვიდრე IDH1/2-უარყოფითი GBM.
მწვავე მიელოიდური ლეიკემია (AML)
IDH1/2 მუტაციები გვხვდება AML პაციენტების დაახლოებით 20%-ში. ცნობილია, რომ IDH1/2 გენების მუტაციები არღვევს რამდენიმე უჯრედულ პროცესს, რაც საბოლოოდ ხელს უშლის ძვლის ტვინის უჯრედების სწორად მომწიფებას. IDH ინჰიბიტორები შექმნილია ლეიკემიის უჯრედების ნორმალურ უჯრედებად მომწიფებაში დასახმარებლად. 
`,
    code: "IDH-RT38",
    linkTitle: "idh-12-mutation-detection-kit",
    active: false,
  },
  {
    title: "EGFRvIII გამოვლენის ნაკრები",
    description:
      "გლიობლასტომა მულტიფორმული (GBM) არის ტვინის კიბოს აგრესიული ფორმა, რომელიც შეადგენს ტვინის ავთვისებიანი სიმსივნეების დაახლოებით 45%-ს. მოლეკულური პროფილირებისა და ზუსტი მედიცინის მიღწევებს აქვს პოტენციალი გააუმჯობესოს GBM პაციენტების დიაგნოზი, მკურნალობა და პროგნოზი. ახალი ბიომარკერების აღმოჩენა, რომელიც შეიძლება გახდეს მკურნალობის პოტენციური სამიზნე, იწვევს ახალი ანტი-GBM თერაპიის განვითარებას. EGFRvIII, ყველაზე გავრცელებული EGFR მუტაცია GBM-ში, გვხვდება EGFR-ით გაძლიერებული პირველადი GBM სიმსივნეების დაახლოებით 60-70%-ში და არის პოტენციური სამიზნე ექსპერიმენტული მკურნალობისთვის.",
    code: "EGFRV3-RT42",
    linkTitle: "egfrviii-detection-kit",
    active: false,
  },
];
const thyroidCancerType = [
  {
    title: "ფარისებრი ჯირკვლის კიბოს მუტაციის საანალიზო პანელი",
    description:
      "ფარისებრი ჯირკვლის კიბო ყველაზე გავრცელებული ენდოკრინული სიმსივნეა შეერთებულ შტატებში. ბოლო კვლევებმა გამოავლინა ფარისებრი ჯირკვლის კიბოს ორი სახის გენეტიკური ცვლილება; წერტილოვანი მუტაციები BRAF-ში, KRAS-ში, NRAS-ში ან HRAS-ში და ქრომოსომული ტრანსლოკაციები, რომლებიც მოიცავს RET/PTC1, RET/PTC3 ან PAX8/PPARg. ამ გენეტიკური მარკერების გამოვლენა იძლევა ავთვისებიანი სიმსივნეების საბოლოო დიაგნოზის საშუალებას, ვინაიდან ისინი განსხვავდებიან უფრო ხშირად წარმოქმნილი ფარისებრი ჯირკვლის კვანძებისგან, რაც მიჩნეულია კეთილთვისებიანად.",
    linkTitle: "thyroid-cancer-mutation-analysis-panel",
    code: "THDNA-RT64",
    active: false,
  },
  {
    title: "ფარისებრი ჯირკვლის კიბოს შერწყმის გენის გამოვლენის ნაკრები",
    description:
      "ფარისებრი ჯირკვლის კიბო ყველაზე გავრცელებული ენდოკრინული სიმსივნეა შეერთებულ შტატებში. ბოლო კვლევებმა გამოავლინა ფარისებრი ჯირკვლის კიბოს ორი სახის გენეტიკური ცვლილება; წერტილოვანი მუტაციები BRAF-ში, KRAS-ში, NRAS-ში ან HRAS-ში და ქრომოსომული ტრანსლოკაციები, რომლებიც მოიცავს RET/PTC1, RET/PTC3 ან PAX8/PPARg. ამ გენეტიკური მარკერების გამოვლენა იძლევა ავთვისებიანი სიმსივნეების საბოლოო დიაგნოზს, რომლებიც განსხვავდებიან უფრო ხშირად წარმოქმნილი ფარისებრი ჯირკვლის კვანძებისგან, რომლებიც მიჩნეულია კეთილთვისებიანად.",
    linkTitle: "thyroid-cancer-mutation-analysis-panel",
    code: "THRNA-RT32",
    active: false,
  },
];
const breastCancerType = [
  {
    title: "PIK3CA მუტაციის ანალიზის ნაკრები",
    linkTitle: "pik3ca-mutation-analysis-kit",
    description: `PIK3CA გენი აკოდირებს ფოსფატიდილ 3-კინაზას p110a ქვეერთეულს, რომელიც მონაწილეობს უჯრედების ზრდაში, პროლიფერაციაში, მოძრაობასა და გადარჩენაში. იგი PI3K-AKT-mTOR სიგნალის გადაცემის გზის ერთ-ერთი მთავარი მონაწილეა. PIK3CA გენის სომატური მუტაციები ჩართულია რამდენიმე კიბოს პათოგენეზში, როგორიცაა: მსხვილი ნაწლავის კიბო, გლიომები, კუჭის კიბო, ძუძუს კიბო, ენდომეტრიუმის კიბო და ფილტვის კიბო.
PIK3CA მუტაციები ჩვეულებრივ თავს იჩენს ეგზონ 9-ში, რომელიც აკოდირებს ხვეულ დომენსა და ეგზონ 20-ს. ეს უკანასკნელი, თავის მხრივ, თავის მხრივ აკოდირებს კინაზას დომენს.
`,
    code: "PI3K-RT48",
    active: false,
  },
];
const melanomaType = [
  {
    title: "BRAF Codon 600 Mutation Analysis Kit II",
    description: `BRAF გენი აკოდირებს სერინის/თრეონინის პროტეინკინაზას, რომელიც ასრულებს როლს MAP კინაზას/ERK სასიგნალო გზების რეგულირებაში, რაც გავლენას ახდენს უჯრედების ზრდასა და პროლიფერაციაზე. ამ გენის სომატური მუტაციები აღმოჩენილია კიბოს დროს, მათ შორის არა-ჰოჯკინის ლიმფომა, მსხვილი ნაწლავის კიბო, ავთვისებიანი მელანომა, ფარისებრი ჯირკვლის პაპილარული კარცინომა, ფილტვის არაწვრილუჯრედოვანი კარცინომა და ფილტვის ადენოკარცინომა. BRAF-ის ყველაზე გავრცელებული მუტაციები ხდება კოდონ 600-ში. სადაც ამინომჟავის ჩანაცვლება კინაზას დომენის აქტივაციის სეგმენტში ქმნის ცილის კონსტიტუციურად აქტიურ ფორმას. BRAF მუტაციები ძირითადად გვხვდება სიმსივნეებში, რომლებიც ველური ტიპისაა KRAS, NRAS და EGFR.
EntroGen-ის BRAF კოდონის 600 მუტაციის საანალიზო ნაკრები არის პოლიმერაზულ ჯაჭვურ რეაქციაზე (PCR) დაფუძნებული ანალიზი, რომელიც იყენებს ალელის სპეციფიკურ ზონდებს BRAF V600E, V600K, V600D, V600R, V600M და V600G მუტაციების არსებობის დასადგენად. ტესტირების პროცედურა მოიცავს სამ (3) მარტივ ნაბიჯს:
•	დნმ-ის იზოლაცია სიმსივნის ბიოფსიიდან, პარაფინში ჩაშენებული სექციებიდან (FFPE), ახლად გაყინული სიმსივნეებიდან და პლაზმის ნიმუშებიდან.
•	BRAF გენის რეგიონების ამპლიფიკაცია ალელური სპეციფიური ზონდების გამოყენებით.
•	ამპლიფიცირებული პროდუქტის გამოვლენა რეალურ დროში PCR დანადგარზე.
ეს ტესტი შეიძლება დასრულდეს დაახლოებით 2 საათში დნმ-ის იზოლირებიდან ტესტის შედეგამდე.
`,
    linkTitle: "b-raf-codon-600-mutation-analysis-kit",
    code: "BRAFX-RT64",
    active: false,
  },
  {
    title: "NRAS მუტაციის ანალიზის ნაკრები",
    description: `NRAS არის GTPase-ების RAS ოჯახის წევრი და ცენტრალურ როლს ასრულებს MAPK სასიგნალო გზაზე. გააქტიურებული მუტაციები ეგზონ 2-ში (კოდონი 12/13), ეგზონ 3 (კოდონი 61) და ეგზონი 4 (კოდონი 146) აღმოჩენილია სხვადასხვა კიბოს დროს, მათ შორის მელანომა (13-25%), მსხვილი ნაწლავის კიბო (1-6%). ფილტვის კიბო (1%), ჰეპატოცელულარული კარცინომა (10%), მიელოიდური ლეიკემიები (14%) და ფარისებრი ჯირკვლის კარცინომა (7%). ქვემოთ მოყვანილი ცხრილი ჩამოთვლის მუტაციებს, რომლებიც აღმოჩენილია NRAS Mutation Detection ნაკრების მიერ.

ეგზონის მუტაციის სახელი ნუკლეოტიდის ცვლილება ამინომჟავის ცვლილება
2 G12C c.34G>T გლიცინი (G) ცისტეინი (C)
G12D c.35G>A გლიცინი (G) ასპარტატი (D)
G12S c.34G>A გლიცინი (G) სერინი (S)
G13V c.38G>T გლიცინი (G) ვალინი (V)
G13R c.37G>C გლიცინი (G) არგინინი (R)
3 Q61K c.181C>A გლუტამინი (Q) ლიზინი (K)
Q61R c.182A>G გლუტამინი (Q) არგინინი (R)
Q61L c.182A>T გლუტამინი (Q) ლეიცინი (L)
Q61H c.183A>C & c.183A>T გლუტამინი (Q) ჰისტიდინი (H)
4 A146T c.436G>A ალანინი (A) თრეონინი (T)
გაფართოებული დაფარვისთვის, RAS c.59/117 მუტაციის გამოვლენის ნაკრები აღმოაჩენს KRAS c.59, NRAS c.59/117 სომატურ მუტაციებს. EntroGen-ის NRAS მუტაციის გამოვლენის ნაკრები არის პოლიმერაზულ ჯაჭვურ რეაქციაზე (PCR) დაფუძნებული ანალიზი, რომელიც იყენებს ალელისთვის სპეციფიკურ პრაიმერებს ზემოთ ჩამოთვლილი მუტაციების არსებობის დასადგენად. ტესტირების პროცედურა მოიცავს სამ (3) მარტივ ნაბიჯს:
•	დნმ-ის იზოლაცია სიმსივნის ბიოფსიიდან, პარაფინში ჩაშენებული სექციებიდან (FFPE) ან ახლად გაყინული სიმსივნეებიდან
•	NRAS გენის რეგიონების ამპლიფიკაცია ალელური სპეციფიური პრაიმერების გამოყენებით.
•	ამპლიფიცირებული პროდუქტის გამოვლენა რეალურ დროში PCR დანადგარზე.
ეს ტესტი შეიძლება დასრულდეს დაახლოებით 2 საათში დნმ-ის იზოლირებიდან ტესტის შედეგამდე.
`,
    linkTitle: "nras-mutation-detection-kit",
    code: "NRAS-RT50",
    active: false,
  },
];
const gistType = [
  {
    title: "GIST მუტაციის გამოვლენის ნაკრები",
    description: `კუჭ-ნაწლავის სტრომული სიმსივნეები (GISTs) არის კუჭ-ნაწლავის ტრაქტის ყველაზე გავრცელებული მეზენქიმული სიმსივნეები. GIST-ების 80%-ზე მეტი შეიცავს მააქტიურებელ მუტაციას c-KIT-ში და დაახლოებით 5-7%-ს PDGFRA-ში. მიუხედავად იმისა, რომ ეს მუტაციები იწვევენ სიმსივნის გენეზს, ისინი ასევე პროგნოზირებენ პასუხს მიზანმიმართულ თერაპიაზე და აწვდიან პროგნოზულ ინფორმაციას. 
ტესტირების პროცედურა და ანალიზი
EntroGen-ის GIST მუტაციის სკრინინგის პანელი არის პოლიმერაზულ ჯაჭვურ რეაქციაზე (PCR) დაფუძნებული ანალიზი, რომელიც იყენებს ალელისთვის სპეციფიურ პრაიმერებს c-KIT და PDGFRA გენებში სომატური მუტაციების არსებობის დასადგენად. ტესტირების პროცედურა მოიცავს სამ (3) მარტივ ნაბიჯს:
•	დნმ-ის იზოლაცია სიმსივნის ბიოფსიიდან, პარაფინში ჩაშენებული სექციებიდან (FFPE) ან ახლად გაყინული სიმსივნეებიდან
•	c-KIT და PDGFRA გენების რეგიონების ამპლიფიკაცია ალელის სპეციფიკური პრაიმერების გამოყენებით
•	ამპლიფიცირების მონაცემების ანალიზი.
ეს ტესტი შეიძლება დასრულდეს დაახლოებით 2 საათში დნმ-ის იზოლირებიდან ტესტის შედეგამდე.
`,
    linkTitle: "gist-mutation-screening-panel",
    code: "GIST-RT44",
    active: false,
  },
];
const panCancerType = [
  {
    title: "NGS მიზნობრივი ცხელი წერტილის პანელი",
    description: `EntroGen NGS Targeted Hotspot Panel არის ყოვლისმომცველი პან-კიბოს ანალიზი, რომელიც შექმნილია მყარი სიმსივნეების კლინიკურად მნიშვნელოვანი მუტაციების გამოსავლენად. შემდეგი თაობის თანმიმდევრობის (NGS) მძლავრი პლატფორმის გამოყენებით, ლაბორატორიებს შეუძლიათ ერთდროულად გააანალიზონ რამდენიმე სხვადასხვა ტიპის სიმსივნე 12-მდე ნიმუშის შეგროვებით ერთ გაშვებაზე*. NGS Targeted Hotspot Panel (THSP) თავსებადია ახლად გაყინულ და ფორმალინში ფიქსირებული პარაფინის ჩაშენებული (FFPE) ნიმუშებთან. ეს ანალიზი ახასიათებს მაღალი მგრძნობელობის და გამტარუნარიანობის გამოვლენის კლინიკურად შესაბამისი ცხელ წერტილების ვარიანტებს 5%-მდე დნმ-ის მინიმალური შეყვანით. თავისი ყოვლისმომცველი, გამარტივებული სამუშაო ნაკადით, THSP შექმნილია ნებისმიერ ლაბორატორიაში შეუფერხებლად ინტეგრირებისთვის. სპეციფიური გამოწვევების მქონე ლაბორატორიებს, როგორიცაა დაავადების სპეციფიკური ნიმუშის დაბალი მოცულობა, შეუძლიათ სხვადასხვა ტიპის ნიმუშების ერთად შეკრება და სიმსივნის პროფილირების დაჩქარება.`,
    linkTitle: "ngs-targeted-hotspot-panel-16-kit",
    code: "THSP-ILNGS",
    active: false,
  },
  {
    title: "რნმ შერწყმის გენის პანელი",
    description: `EntroGen RNA Fusion Gene Panel არის სრული შემდეგი თაობის თანმიმდევრობის (NGS) გადაწყვეტა 23 გენზე 307 კლინიკურად შესაბამისი შერწყმის გამოსავლენად.

EntroGen RNA Fusion Gene Panel არის სრული რნმ-ის ანალიზისთვის გამოსავალი, რომელიც აღმოაჩენს ცნობილ შერწყმა გენებს სულ მცირე 10 ნგ შეყვანის რნმ-ით. რნმ-ის შერწყმის გენის პანელი შეიცავს ცნობილი NTRK შერწყმის გენების და 22 სხვა კლინიკურად მნიშვნელოვანი გენის ყოვლისმომცველ დაფარვას, მათ შორის ABL1, ALK, AKT3, AXL, BRAF, EGFR, ERBB2, ERG, ETV1, ETV4, ETV5, FGFR1, FGFR3, METGF. NTRK1, NTRK2, NTRK3, PDGFRA, PPARG, RAF1, RET და ROS1.

რნმ შერწყმის გენის პანელი თავსებადია სისხლის, ახლად გაყინული და ფორმალინით ფიქსირებული პარაფინის ჩაშენებული (FFPE) ნიმუშებთან. მოყვება რეაგენტები საპირისპირო ტრანსკრიფციისთვის, ბიბლიოთეკის მომზადებისა და გაწმენდისთვის, ასევე ადგილობრივი, მოსახერხებელი პროგრამული უზრუნველყოფა, რომელიც შექმნილია საბოლოო მომხმარებლის ბიოინფორმატიკის ტვირთის შესამცირებლად, მაღალი საიმედო შერწყმის გენის აღმოჩენის საშუალებით. ბიბლიოთეკის ხარისხის კონტროლის ანალიზი (Library Quantification Kit for Illumina®) ხელმისაწვდომია მაღალი ხარისხის მონაცემების უზრუნველსაყოფად განმეორებითი თანმიმდევრობის საჭიროების გარეშე.`,
    linkTitle: "rna-fusion-panel",
    code: "RFGP-NGS",
    active: false,
  },
];
</script>
<template>
  <Header />
  <div class="entrogen_item_header">
    <h1 class="entrogen_item_title">{{ title }}</h1>
  </div>
  <div class="entrogen_item_description" v-if="description">
    <p class="entrogen_item_description_text">{{ description }}</p>
  </div>
  <div class="reagent_wrapper">
    <h1 class="reagent_wrapper_title">რეაგენტები</h1>
    <template v-if="title == 'სწორი ნაწლავის კიბო'">
      <div class="reagent" v-for="type in colorectalCancerType">
        <div class="reagent_container reagent_container_title">
          <h2>დასახელება</h2>
          <p>{{ type.title }}</p>
        </div>
        <div class="reagent_container reagent_container_description">
          <h2>აღწერა</h2>
          <p>{{ type.description }}</p>
        </div>
        <div class="reagent_container reagent_container_code">
          <h2>კოდი</h2>
          <a target="_blank" :href="`http://entrogen.com/web3/${type.linkTitle}`">{{ type.code }}</a>
        </div>
      </div>
    </template>
    <template v-if="title == 'ფილტვის კიბო'">
      <div class="reagent" v-for="type in lungCancerType">
        <div class="reagent_container reagent_container_title">
          <h2>დასახელება</h2>
          <p>{{ type.title }}</p>
        </div>
        <div class="reagent_container reagent_container_description">
          <h2>აღწერა</h2>
          <p>{{ type.description }}</p>
        </div>
        <div class="reagent_container reagent_container_code">
          <h2>კოდი</h2>
          <a target="_blank" :href="`http://entrogen.com/web3/${type.linkTitle}`">{{ type.code }}</a>
        </div>
      </div>
    </template>
    <template v-if="title == 'გლიობლასტომა'">
      <div class="reagent" v-for="type in glioblastomaType">
        <div class="reagent_container reagent_container_title">
          <h2>დასახელება</h2>
          <p>{{ type.title }}</p>
        </div>
        <div class="reagent_container reagent_container_description">
          <h2>აღწერა</h2>
          <p>{{ type.description }}</p>
        </div>
        <div class="reagent_container reagent_container_code">
          <h2>კოდი</h2>
          <a target="_blank" :href="`http://entrogen.com/web3/${type.linkTitle}`">{{ type.code }}</a>
        </div>
      </div>
    </template>
    <template v-if="title == 'Ფარისებრი ჯირკვლის კიბო'">
      <div class="reagent" v-for="type in thyroidCancerType">
        <div class="reagent_container reagent_container_title">
          <h2>დასახელება</h2>
          <p>{{ type.title }}</p>
        </div>
        <div class="reagent_container reagent_container_description">
          <h2>აღწერა</h2>
          <p>{{ type.description }}</p>
        </div>
        <div class="reagent_container reagent_container_code">
          <h2>კოდი</h2>
          <a target="_blank" :href="`http://entrogen.com/web3/${type.linkTitle}`">{{ type.code }}</a>
        </div>
      </div>
    </template>
    <template v-if="title == 'Მკერდის კიბო'">
      <div class="reagent" v-for="type in breastCancerType">
        <div class="reagent_container reagent_container_title">
          <h2>დასახელება</h2>
          <p>{{ type.title }}</p>
        </div>
        <div class="reagent_container reagent_container_description">
          <h2>აღწერა</h2>
          <p>{{ type.description }}</p>
        </div>
        <div class="reagent_container reagent_container_code">
          <h2>კოდი</h2>
          <a target="_blank" :href="`http://entrogen.com/web3/${type.linkTitle}`">{{ type.code }}</a>
        </div>
      </div>
    </template>
    <template v-if="title == 'მელანომა'">
      <div class="reagent" v-for="type in melanomaType">
        <div class="reagent_container reagent_container_title">
          <h2>დასახელება</h2>
          <p>{{ type.title }}</p>
        </div>
        <div class="reagent_container reagent_container_description">
          <h2>აღწერა</h2>
          <p>{{ type.description }}</p>
        </div>
        <div class="reagent_container reagent_container_code">
          <h2>კოდი</h2>
          <a target="_blank" :href="`http://entrogen.com/web3/${type.linkTitle}`">{{ type.code }}</a>
        </div>
      </div>
    </template>
    <template v-if="title == 'GIST'">
      <div class="reagent" v-for="type in gistType">
        <div class="reagent_container reagent_container_title">
          <h2>დასახელება</h2>
          <p>{{ type.title }}</p>
        </div>
        <div class="reagent_container reagent_container_description">
          <h2>აღწერა</h2>
          <p>{{ type.description }}</p>
        </div>
        <div class="reagent_container reagent_container_code">
          <h2>კოდი</h2>
          <a target="_blank" :href="`http://entrogen.com/web3/${type.linkTitle}`">{{ type.code }}</a>
        </div>
      </div>
    </template>
    <template v-if="title == 'Pan-Cancer პანელები'">
      <div class="reagent" v-for="type in panCancerType">
        <div class="reagent_container reagent_container_title">
          <h2>დასახელება</h2>
          <p>{{ type.title }}</p>
        </div>
        <div class="reagent_container reagent_container_description">
          <h2>აღწერა</h2>
          <p>{{ type.description }}</p>
        </div>
        <div class="reagent_container reagent_container_code">
          <h2>კოდი</h2>
          <a target="_blank" :href="`http://entrogen.com/web3/${type.linkTitle}`">{{ type.code }}</a>
        </div>
      </div>
    </template>
  </div>
  <CallPhoneButton v-if="windowWidth < 900" />
  <Footer />
</template>
<style>
.entrogen_item_header {
  background: url("@/assets/homebcg.png") no-repeat center;
  width: 100%;
  height: 30vh;
  background-size: cover;
  margin-top: 100px;
  display: flex;
  justify-content: center;
  align-items: center;
}

.entrogen_item_title {
  color: #9732ed;
}

.entrogen_item_description {
  width: 800px;
  margin: 50px auto;
  line-height: 35px;
  text-align: justify;
}

.entrogen_item_description_title {
  text-align: center;
  margin-bottom: 15px;
}

.entrogen_item_description_text {
  text-align: justify;
}

.reagent_wrapper {
  margin: 50px auto;
  width: 800px;
}

.reagent_wrapper_title {
  text-align: center;
}

.reagent {
  display: flex;
  margin: 20px auto;
  font-size: 13px;
}

.reagent_container {
  margin: 10px 20px;
  line-height: 1.2rem;
}

.reagent_container p {
  text-align: justify;
  margin: 10px auto;
}

.reagent_container_code a {
  width: 150px;
  text-decoration: none;
  display: block;
  margin-top: 10px;
}

.reagent_container_description h2 {
  text-align: center;
}

.reagent_container_description p {
  width: 400px;
}

@media (max-width: 900px) and (min-width: 100px) {

  .entrogen_item_description {
    width: 80%;
    margin: 0 auto;
    margin-top: 16px;
  }

  .entrogen_item_title {
    font-size: 30px;
  }

  .reagent_wrapper_title {
    font-size: 26px;
  }

  .reagent_wrapper {
    width: auto;
    text-align: center;
  }

  .reagent {
    flex-direction: column;
  }

  .reagent_container_description {
    text-align: inherit;
  }

  .reagent_container_description p {

    width: 80%;
    line-height: 22.82px;
  }

  .reagent_container_code a {
    width: auto;
  }

  .reagent_container_title p {
    text-align: inherit;
  }
}
</style>
