<script setup>
import Header from "@/components/Header.vue";
import Footer from "@/components/Footer.vue";
import { onMounted, ref } from "vue";
import store from "@/store";
const hepatitisToggled = ref(false);
const hivToggled = ref(false);
const hpvToggled = ref(false);
const stdToggled = ref(false);
const herpesToggled = ref(false);
const torchToggled = ref(false);
const respiratoryToggled = ref(false);
const neurologicalToggled = ref(false);
const intestinalToggled = ref(false);
const dangerousInfectionToggled = ref(false);
const toggleHepatitis = (hepatitis) => {
  hepatitisToggled.value = !hepatitisToggled.value;
  hepatitis.active = !hepatitis.active;
  console.log(hepatitis.active, hepatitisToggled.value);
};
const toggleHIV = (hiv) => {
  hivToggled.value = !hivToggled.value;
  hiv.active = !hiv.active;
};
const toggleHPV = (hpv) => {
  hpvToggled.value = !hpvToggled.value;
  hpv.active = !hpv.active;
};
const toggleSTD = (std) => {
  stdToggled.value = !stdToggled.value;
  std.active = !std.active;
};
const toggleHerpes = (herpes) => {
  herpesToggled.value = !herpesToggled.value;
  herpes.active = !herpes.active;
};
const toggleTorch = (torch) => {
  torchToggled.value = !torchToggled.value;
  torch.active = !torch.active;
};
const toggleRespiratory = (respiratory) => {
  respiratoryToggled.value = !respiratoryToggled.value;
  respiratory.active = !respiratory.active;
};
const toggleNeurological = (neurological) => {
  neurologicalToggled.value = !neurologicalToggled.value;
  neurological.active = !neurological.active;
};
const toggleIntestinal = (instestinal) => {
  intestinalToggled.value = !intestinalToggled.value;
  instestinal.active = !instestinal.active;
};
const toggleDangerous = (dangerous) => {
  dangerousInfectionToggled.value = !dangerousInfectionToggled.value;
  dangerous.active = !dangerous.active;
};
const hepatitisViruses = [
  {
    title: "A ჰეპატიტის (HAV) PCR ნაკრები",
    description:
      "A ჰეპატიტის ვირუსი (HAV) არის ნაწლავური ინფექცია ყველაზე ფართოდ გავრცელებული მსოფლიოში. HAV არის ხუთ ყველაზე ეკონომიკურად მნიშვნელოვანი ინფექციური დაავადებადან ერთ-ერთი და საზოგადოებრივი ჯანდაცვის ერთ-ერთი პრიორიტეტული პრობლემა.\n" +
      "PCR მეთოდით HAV რნმ-ის გამოვლენას მნიშვნელოვანი უპირატესობები აქვს ELISA-სთან და ბიოქიმიურ ტესტებთან დაკავშირებით კონტაქტის პირთა სისხლში ვირუსის გამოვლენისას, რადგან A ჰეპატიტის ვირუსის რნმ სისხლში ვლინდება დაბინძურების მომენტიდან მესამე კვირაში და ვლინდება საშუალოდ 20 დღის განმავლობაში დაავადების სიმპტომების გამოვლენიდან. ამრიგად, რნმ არის პირველი დიაგნოსტიკური მარკერი, რომელიც აღმოჩენილია პაციენტის სისხლში, ჩნდება უფრო ადრე, ვიდრე HAV IgM და არ იძლევა ცრუ უარყოფით რეაქციებს.\n" +
      "HAV RNA-ს გამოვლენა PCR-ის დახმარებით განავალში შესაძლებელია ინკუბაციური პერიოდის მესამე კვირიდან და დაავადების სიმპტომების გამოვლინებიდან სამ თვემდე. რნმ-ის გამოვლენას უფრო მეტი უპირატესობა აქვს (მინიმუმ 1000-ჯერ მეტი) ვიდრე HAV-Ag-ის გამოვლენა გარემოს ერთეულებში (სასმელი ან ჩამდინარე წყლები, დატბორილი ზედაპირული წყლებიდან და ა.შ.). ",
    reagents: {
      title: "HAV Real-TM Qual",
      description: "რეალურ დროში PCR ტესტი HAV-ის გამოვლენისთვის",
      code: "V4-50FRT",
      active: false,
      id: 1,
    },
  },
  {
    title: "B ჰეპატიტის (HBV) PCR ნაკრები",
    description:
      "B ჰეპატიტის ვირუსი (HBV) არის ფართოდ გავრცელებული ადამიანის ინფექცია, რომელიც გამოწვეულია დნმ-ის შემცველი HBV ვირუსით, რომელიც მიეკუთვნება Hepadnaviridae-ს ოჯახს. ამჟამად ჯანმო-ს მონაცემებით HBV ვირუსით ინფიცირებული მოსახლეობა 500 მილიონ ადამიანს შეადგენს.\n" +
      "HBV დნმ-ის გამოვლენა გამოიყენება:\n" +
      "- მწვავე ვირუსული B ჰეპატიტის ადრეული დიაგნოსტიკისთვის;\n" +
      "- ვირუსული B ჰეპატიტის ლატენტური ფორმების გამოვლენა;\n" +
      "- B ჰეპატიტის ვირუსის მუტანტური შტამების გამოვლენა HBsAg-ით;\n" +
      "- ქრონიკული ვირუსული B ჰეპატიტის დიაგნოზის დადგენა;\n" +
      "- ანტივირუსული თერაპიის ეფექტურობის მონიტორინგი;\n" +
      "\n" +
      "SACACE HBV REAL TIME QUANT KIT-ის უპირატესობები\n" +
      "- CE-IVD მარკირება\n" +
      "- რაოდენობრივი შიდა კონტროლის გამოყენება (კონცენტრაცია მოხსენებული მონაცემთა ბარათში), რომელიც წარმოადგენს რეკომბინანტულ დნმ-ის შემცველ სტრუქტურას, რომელიც განხორციელდა ანალიზის ყველა საფეხურზე ნუკლეინის მჟავას ექსტრაქციიდან PCR გაძლიერებამდე. რაოდენობრივი HBV Rec IC-ის არსებობა საშუალებას იძლევა არა მხოლოდ მონიტორინგს მოახდინოთ ექსტრაქციის პროცედურა და შეამოწმოთ შესაძლო PCR ინჰიბირება, არამედ გადაამოწმოთ დნმ-ის შესაძლო დანაკარგები ექსტრაქციის პროცედურის დროს, რაც საშუალებას გაძლევთ ზუსტად გამოთვალოთ HBV ვირუსული დატვირთვა.\n" +
      "- ექსტრაქციის ორი დადებითი კონტროლის ნაკრების კომპლექტში მოწოდებულ რეაგენტებში: Pos1 HBV დაბალი ვირუსული დატვირთვა და Pos2 HBV საშუალო ვირუსული დატვირთვა, რომლებიც რაოდენობრივად არის აღწერილი მონაცემთა ბარათში, რომელიც განხორციელდა ყველა საფეხურზე და იძლევა ჩატარებული ანალიზის ხარისხის კონტროლის საშუალებას.\n" +
      "- მაღალი მგრძნობელობა: 20 ასლი/მლ (მნიშვნელობა მიღებულია მაგნოვირუსის ექსტრაქციის ნაკრების გამოყენებით (Sacace REF K-2-16) ",
    reagents: {
      first_reagent: {
        title: "HBV Real-TM Quant Dx",
        description:
          "რეალურ დროში PCR ტესტი HBV-ის რაოდენობრივი გამოვლენისთვის (96 მზა გამოსაყენებლად ლიოფილიზებული მილები - 50 მკლ რეაქციის ნარევი)",
        code: "V5-96/3FRT",
      },
      second_reagent: {
        title: "HBV Real-TM Quant",
        description:
          "რეალურ დროში PCR ტესტი HBV-ის რაოდენობრივი გამოვლენისთვის (25 მკლ რეაქციის ნარევი)",
        code: "V5-100/2FRT",
      },
      third_reagent: {
        title: "HBV Real-TM Qual",
        description:
          "რეალურ დროში PCR ტესტი HBV-ის გამოსავლენად (25 მკლ რეაქციის ნარევი)",
        code: "V5-100FRT/N",
      },
      fourth_reagent: {
        title: "HBV გენოტიპი A, B, C, D Real-TM",
        description:
          "რეალურ დროში PCR ტესტი HBV დნმ-ის A, B, C, D გენოტიპების გამოსავლენად",
        code: "R5-Gen",
      },
      active: false,
      id: 2,
    },
  },
  {
    title: "C ჰეპატიტის (HCV) PCR ნაკრები",
    description:
      "C ჰეპატიტის ვირუსი (HCV) არის რნმ-ის შემცველი, ჰეპატოტროპული ვირუსი, რომელიც მიეკუთვნება Flaviviridae-ს ოჯახს. HCV-ით დაბინძურება ხდება ვირუსის სისხლში პირდაპირი შეყვანისას. HCV მწვავე ინფექციით დაავადებულთა უმეტესობა ასიმპტომურია ან აქვს მსუბუქი სიმპტომები, მაგრამ მათ არ შეუძლიათ ვირუსის გაწმენდა და დაახლოებით 80% შემთხვევაში ეს იწვევს ქრონიკულ ინფექციას. პაციენტების 15-დან 20%-ში ქრონიკული HCV ინფექცია პროგრესირებს ცვლადი სიჩქარით ციროზამდე, ჰეპატოცელულარული კარცინომის განვითარების 1-დან 4%-მდე წლიური რისკით. დღეისათვის ინფიცირებულია 170 მილიონზე მეტი ადამიანი, რაც შეადგენს მსოფლიოს მოსახლეობის 3 პროცენტს.\n" +
      "HCV-ის ლაბორატორიულ დიაგნოსტიკაში წამყვანი ადგილი უკავია მოლეკულურ-ბიოლოგიურ მეთოდებს, რაც საშუალებას იძლევა: 1) მწვავე ვირუსული ინფექციის ადრეული დიაგნოსტიკა; 2) ანტივირუსული თერაპიის ჩვენებების დადგენა; 3) ოპტიმალური თერაპიული რეჟიმის არჩევანი.\n" +
      "SACACE HCV REAL TIME QUANT KIT-ის უპირატესობები\n" +
      "- CE-IVD მარკირება\n" +
      "- პრაიმერებისა და ზონდების გამოყენება UTR რეგიონის ყველაზე კონსერვატიულ ზონაში, რაც საშუალებას იძლევა ეფექტური გამოვლენის HCV გენოტიპების უმეტესობა (შემოწმებული გენოტიპები: 1a, 1b, 1c, 2b, 4,4,3, c. d, 5a, 6a)\n" +
      "- რაოდენობრივი შიდა კონტროლის გამოყენება (კონცენტრაცია მოხსენებული მონაცემთა ბარათში), რომელიც წარმოადგენს რეკომბინანტულ რნმ-ს შემცველ სტრუქტურას, რომელიც განხორციელდა ანალიზის ყველა საფეხურზე ნუკლეინის მჟავას ექსტრაქციისგან PCR გაძლიერებამდე. რაოდენობრივი HCV Rec IC-ის არსებობა საშუალებას იძლევა არა მხოლოდ მონიტორინგდეს ექსტრაქციის პროცედურა და შეამოწმოს შესაძლო PCR დათრგუნვა, არამედ გადაამოწმოს რნმ-ის შესაძლო დანაკარგები ექსტრაქციის პროცედურის დროს, რაც საშუალებას გაძლევთ ზუსტად გამოთვალოთ HCV ვირუსული დატვირთვა.\n" +
      "- ექსტრაქციის ორი დადებითი კონტროლის ნაკრების კომპლექტში მოწოდებულ რეაგენტებში: Pos1 HCV დაბალი ვირუსული დატვირთვა და Pos2 HCV საშუალო ვირუსული დატვირთვა, რომლებიც რაოდენობრივად აღწერილია მონაცემთა ბარათში, რომელიც განხორციელდა ყველა საფეხურზე და იძლევა ჩატარებული ანალიზის ხარისხის კონტროლის საშუალებას.\n" +
      "- გაზომვების ფართო ხაზოვანი დიაპაზონი (20-დან 50.000.000 სე/მლ-მდე). ",
    reagents: {
      first_reagent: {
        title: "HCV Real-TM Quant Dx",
        description:
          "რეალურ დროში PCR ტესტი HCV-ის რაოდენობრივი გამოვლენისთვის",
        code: "V1-96/3FRT",
      },
      second_reagent: {
        title: "HCV Real-TM Quant",
        description:
          "რეალურ დროში PCR ტესტი HCV-ის რაოდენობრივი გამოვლენისთვის (25 μl რეაქციის ნარევი)",
        code: "V1-100/2FRT",
      },
      third_reagent: {
        title: "HCV Real-TM Qual",
        description:
          "რეალურ დროში PCR ტესტი HCV-ის გამოვლენისთვის (25 მკლ რეაქციის ნარევი)",
        code: "V1-100FRT/N",
      },
      active: false,
      id: 3,
    },
  },
  {
    title: "HCV გენოტიპირება",
    description:
      "HCV კლასიფიცირდება თერთმეტ ძირითად გენოტიპად (მონიშნულია 1-11), ბევრ ქვეტიპად (ა, b, c და ა.შ.) და დაახლოებით 100 სხვადასხვა შტამად (დანომრილი 1,2,3 და ა.შ.) გენომიური თანმიმდევრობის ჰეტეროგენურობის მიხედვით. 1-3 გენოტიპებს აქვთ მსოფლიო გავრცელება. 1a და 1b ტიპები ყველაზე გავრცელებულია, რომლებიც გლობალური ინფექციების დაახლოებით 60%-ს შეადგენს. ისინი ჭარბობენ ჩრდილოეთ ევროპასა და ჩრდილოეთ ამერიკაში, ხოლო სამხრეთ და აღმოსავლეთ ევროპაში და იაპონიაში, შესაბამისად. ტიპი 2 ნაკლებად ხშირად არის წარმოდგენილი, ვიდრე ტიპი 1. ტიპი 3 ენდემურია სამხრეთ-აღმოსავლეთ აზიაში და ცვალებადია გავრცელებული სხვადასხვა ქვეყანაში. გენოტიპი 4 ძირითადად გვხვდება ახლო აღმოსავლეთში, ეგვიპტეში და ცენტრალურ აფრიკაში. ინფიცირებული გენოტიპის განსაზღვრა მნიშვნელოვანია ანტივირუსულ მკურნალობაზე პასუხის პროგნოზირებისთვის: გენოტიპები 1 და 4 ჩვეულებრივ ასოცირდება მხოლოდ ინტერფერონზე ცუდ პასუხთან, ხოლო 2 და 3 გენოტიპები დაკავშირებულია უფრო ხელსაყრელ პასუხებთან. 1b ქვეტიპის მქონე პაციენტებში დაავადება გადადის ქრონიკულ მდგომარეობაში შემთხვევების 90%-ში, იმ დროს, როგორც 2 და 3b გენოტიპების შემთხვევაში 33-50%-ში. რიგ ნაშრომებში აღნიშნულია, რომ 1b გენოტიპის ინფექციას აქვს დაავადების მძიმე მიმდინარეობა ციროზის და ჰეპატოკარცინომის განვითარებით. ",
    reagents: {
      first_reagent: {
        title: "HCV 1/2/3 გენოტიპი Real-TM",
        description:
          "რეალურ დროში PCR ნაკრები 1, 2, 3 გენოტიპების გამოსავლენად",
        code: "R1-Gen-4X",
      },
      second_reagent: {
        title: "HCV გენოტიპი Plus Real-TM",
        description:
          "რეალურ დროში PCR ნაკრები 1a,1b, 2, 3a, 4, 5a, 6 გენოტიპის გამოსავლენად",
        code: "R1-Gen-6",
      },
      active: false,
      id: 4,
    },
  },
  {
    title: "D ჰეპატიტის (HDV) PCR ნაკრები",
    description:
      "D ჰეპატიტის ვირუსი (HDV) არის უაღრესად დეფექტური ვირუსი, რადგან მას არ შეუძლია ინფექციური ვირიონების წარმოქმნა თანადამხმარე ვირუსის დახმარების გარეშე. ეს დამხმარე ვირუსი არის B ჰეპატიტის ვირუსი (HBV), რომელიც ამარაგებს ზედაპირული მემბრანის ცილებს (HBsAg). უჯრედიდან გამოსვლისას HDV იძენს HBsAg-ის შემცველ მემბრანას. დაავადების შედეგი დიდწილად დამოკიდებულია იმაზე, ინფიცირდება თუ არა ეს ორი ვირუსი ერთდროულად (კოინფექცია), ან არის თუ არა ახლად HDV-ით ინფიცირებული ადამიანი ქრონიკულად ინფიცირებული HBV მატარებელი (სუპერინფექცია). კოინფექციაHBV და HDV იწვევს როგორც მწვავე B, ასევე მწვავე ტიპის D ჰეპატიტებს და სუპერინფექცია ასოცირდება ფუმინატულ მწვავე ჰეპატიტთან და მძიმე ქრონიკულ აქტიურ ჰეპატიტთან, ხშირად პროგრესირებად ციროზამდე. HDV რნმ-ის გამოვლენა PCR-ით საშუალებას იძლევა გამომწვევი აგენტის გამოვლენა ინფექციის შეყვანის პერიოდში სეროკონვერსიამდე, რაც ძალიან მნიშვნელოვანია ადრეული დიაგნოსტიკისთვის.",
    reagents: {
      first_reagent: {
        title: "HDV Real-TM Quant",
        description:
          "რეალურ დროში PCR ტესტი HDV-ის რაოდენობრივი გამოვლენისთვის",
        code: "V3-100/2FRT",
      },
      second_reagent: {
        title: "HBV/HDV Real-TM",
        description:
          "რეალურ დროში PCR ტესტი HBV და HDV-ის ერთდროული გამოვლენისთვის",
        code: "V56-100FRT",
      },
      active: false,
      id: 5,
    },
  },
  {
    title: "G ჰეპატიტის (HGV) PCR ნაკრები",
    description:
      "ჰეპატიტი G არის ღვიძლის ანთების ფორმა, რომელიც გამოწვეულია HGV-ით Flaviviridae-ს ოჯახიდან. ცნობილია, რომ HGV შემცველი სისხლის გადასხმა გამოიწვია ჰეპატიტის ზოგიერთი შემთხვევა. ამ მიზეზით, ჰემოფილიით და სხვა სისხლდენით დაავადებული პაციენტები, რომლებსაც ესაჭიროებათ დიდი რაოდენობით სისხლის პროდუქტები, იმყოფებიან G ჰეპატიტის რისკის ქვეშ. ასევე რისკის ქვეშ არიან თირკმელების დაავადების მქონე პაციენტები ჰემოდიალიზით სისხლის გაცვლით.",
    reagents: {
      title: "HGV Real-TM Qual",
      description: "რეალურ დროში PCR ტესტი HGV-ის გამოსავლენად",
      code: "V2-50FRT",
      active: false,
      id: 6,
    },
  },
  {
    title: "HCV/HBV/HIV მულტიპლექს PCR ნაკრები",
    description:
      "HCV/HBV/HIV Real-TM ნაკრები არის თვისებრივი ინ ვიტრო ტესტი ადამიანის იმუნოდეფიციტის ვირუსის (აივ) რნმ-ის, C ჰეპატიტის ვირუსის რნმ-ის და B ჰეპატიტის ვირუსის დნმ-ის რეალურ დროში ყოვლისმომცველი ერთჯერადი ანალიზისთვის ადამიანის პლაზმაში შიდა კონტროლის (IC) ერთდროული გამოვლენით. ეს ნაკრები განკუთვნილია გამოსაყენებლად, როგორც დონორის სკრინინგ ტესტი, რათა გამოავლინოს აივ რნმ, HCV რნმ და HBV დნმ პლაზმაში ცალკეული დონორებისგან, რომლებიც შეიძლება იყოს სკრინინგული როგორც ცალკეული ნიმუშები ან შეიძლება ტესტირება მოხდეს თანაბარი ნაწილებისგან შემდგარ აუზებში.",
    reagents: {
      first_reagent: {
        title: "HCV/HBV/HIV/HIV2 Real-TM",
        description: "რეალურ დროში PCR ნაკრები (ლიოფილიზებული)",
        code: "V50-50FRT/L",
      },
      second_reagent: {
        title: "HCV/HBV/HIV1/HIV2 Real-TM",
        description: "რეალურ დროში PCR ნაკრები",
        code: "V62-100FRT",
      },
      active: false,
      id: 7,
    },
  },
  {
    title: "HCV ასოცირებული PCR კომპლექტები",
    description:
      " ინტერლეუკინ-28 (IL28) არის ციტოკინი, რომელიც თამაშობს როლს ვირუსებისგან იმუნურ დაცვაში. IL28B მიეკუთვნება III ტიპის ციტოკინების ინტერფერონის ოჯახს. მისი კლასიფიკაცია, როგორც ინტერფერონი, განპირობებულია ანტივირუსული მდგომარეობის გამოწვევის უნარით. პოლიმორფიზმი IL28B გენის რეგიონში (rs12979860 და rs8099917) მნიშვნელოვანია ქრონიკული C ჰეპატიტის ვირუსის (HCV) ინფექციის თერაპიის შემდეგ შედეგის პროგნოზირებისთვის. კომბინირებული თერაპია INF პეგილირებული (PEG-IFN) და რიბავირინი (RBV) არის ამჟამინდელი სტანდარტული თერაპია HCV ინფექციის წინააღმდეგ და პოლიმორფიზმის დეტალური ცოდნა HCV-ით ინფიცირებულ პაციენტებში IL28B გენის რეგიონში შეიძლება იყოს მნიშვნელოვანი კომპონენტი PEG-IFN და RBV-ით მკურნალობის დაწყების გადაწყვეტილების მისაღებად.",
    reagents: {
      title: "IL28B rs17/rs60 Real-TM",
      description:
        "რეალურ დროში PCR ნაკრები ინტერლეუკინის 28B გენის rs8099917 და rs12979860 პოლიმორფიზმების გამოსავლენად",
      code: "R05-100FRT",
      active: false,
      id: 8,
    },
  },
  {
    title: "B ჰეპატიტის ვირუსის გენოტიპის PCR ნაკრები",
    description:
      "B ჰეპატიტის ვირუსი (HBV) აინფიცირებს თითქმის ორ მილიარდ ადამიანს მთელ მსოფლიოში. B ჰეპატიტის ვირუსი (HBV) ამჟამად დაყოფილია რვა გენოტიპად (A-დან H). გენოტიპები აღმოჩნდა გეოგრაფიულად განაწილებული. მრავალრიცხოვანმა კვლევამ გამოიკვლია HBV გენოტიპების კლინიკური გავლენა დაავადების სიმძიმეზე, IFN-ზე პასუხზე, დაავადების ქრონიკულობაზე და ჰეპატოცელულურ კარცინომაზე (HCC).",
    reagents: {
      title: "HBV Genotype A, B, C, D Real-TM",
      description:
        "რეალურ დროში PCR ნაკრები B ჰეპატიტის ვირუსის A, B, C და D გენოტიპების გამოვლენისა და დიფერენციაციისთვის HBV-დადებით კლინიკურ მასალაში",
      code: "R5-Gen",
      active: false,
      id: 9,
    },
  },
];
const hivViruses = [
  {
    title: "აივ რნმ PCR ნაკრები",
    description:
      "აივ-ის პირდაპირი გამოვლენის ერთ-ერთი ყველაზე ეფექტური მეთოდია ნუკლეინის მჟავების სპეციფიკური გაძლიერება in vitro პოლიმერაზული ჯაჭვური რეაქციით (PCR). ამ მეთოდს ბევრი უპირატესობა აქვს:\n" +
      "- ვირუსის დნმ/რნმ-ის გამოვლენა საშუალებას იძლევა შემცირდეს სეროლოგიური ფანჯრის სიგრძე;\n" +
      "- PCR არის შეუცვლელი მიდგომა აივ ინფიცირებული დედებიდან დაბადებულ ბავშვებში აივ-დიაგნოსტიკისთვის:\n" +
      "- სისხლის პლაზმაში აივ რნმ-ის განსაზღვრა (ვირუსული დატვირთვა) სავალდებულო პროცედურაა თერაპიის ეფექტურობის მონიტორინგისთვის. ",
    reagents: {
      title: "HIV Real-TM Quant Dx",
      description:
        "რეალურ დროში PCR ტესტი აივ-ის რაოდენობრივი გამოვლენისთვის, 96 მზა ლიოფილიზებული მილები - 50 μl Reaction Mix",
      code: "V0-96/3FRT",
      active: false,
      id: 1,
    },
  },
  {
    title: "აივ დნმ PCR ნაკრები",
    description:
      " აივ ინფიცირებული დედებისგან დაბადებულ ბავშვებში აივ-ინფექციის დიაგნოსტიკა რთულია იმის გამო, რომ დედის ანტისხეულები აივ-ის მიმართ ასეთ ბავშვებს სისხლში დიდი ხნის განმავლობაში ნარჩუნდება. მაგრამ ინფიცირებული დედისგან დაბადებული ყველა ბავშვი არ არის ინფიცირებული აივ-ით, მიუხედავად იმისა, რომ ბავშვები ექვემდებარებიან აივ ინფექციის მაღალი რისკის ინტრაუტერიულ პერიოდში, მშობიარობისა და ძუძუთი კვების დროს. თუ პრევენციული ზომები არ მიიღება, ბავშვებში დედიდან შვილზე აივ ინფექციის გადაცემის რისკი 20-45 პროცენტს შეადგენს. დღეს ეფექტურმა ზომებმა, რომლებიც გამიზნულია აივ-ის ვერტიკალური გადაცემის პრევენციისთვის, შეუძლია შეამციროს რისკი 1-2 პროცენტამდე.\n" +
      "ახალშობილებში აივ-ინფექციის ადრეული დიაგნოსტიკის პრობლემა რამდენიმე წლის წინ მოგვარდა მოლეკულურ-გენეტიკური მეთოდების შემუშავებით, რაც საშუალებას იძლევა პერიფერიულ სისხლში აივ-ის გენომის ფრაგმენტების გამოვლენა ინფექციის ადრეულ ეტაპზე. მოპოვებული იქნა მტკიცებულება, რომ აივ-პროვირუსის დნმ განისაზღვრება ბავშვების უმრავლესობაში ერთი თვის ასაკში და პრაქტიკულად ყველაში - 6 თვის ასაკში. ამ მონაცემების საფუძველზე რეკომენდებულია პოლიმერაზული ჯაჭვური რეაქციის (PCR) ჩატარება აივ პროვირუსის დნმ-ზე პირველად დაბადებიდან 48 საათის განმავლობაში და ბავშვის სიცოცხლის 6-8 კვირაში, პირველი გამოკვლევის შედეგის მიუხედავად. ბავშვში აივ ინფექციის არსებობის შესახებ საბოლოო გადაწყვეტილება მიიღება არაუგვიანეს 6 თვის ასაკისა. ",
    reagents: {
      title: "HIV DNA Real-TM Qual",
      description: "რეალურ დროში PCR ტესტი პროვირუსული აივ დნმ-ის გამოსავლენად",
      code: "R-V1-D",
      active: false,
      id: 2,
    },
  },
  {
    title: "აივ ასოცირებული PCR კომპლექტები",
    description:
      " აბაკავირი არის ნუკლეოზიდური საპირისპირო ტრანსკრიპტაზას ინჰიბიტორი, აქტივობით ადამიანის იმუნოდეფიციტის ვირუსის (აივ) წინააღმდეგ, ხელმისაწვდომია დღეში ერთხელ გამოყენებისთვის სხვა ანტირეტროვირუსულ საშუალებებთან ერთად, რომელიც აჩვენა ეფექტურობა, რამდენიმე წამლის ურთიერთქმედება და ხელსაყრელი გრძელვადიანი ტოქსიკურობის პროფილი. აბაკავირის ყველაზე მნიშვნელოვანი გვერდითი ეფექტი, რომელიც ზღუდავს მის გამოყენებას თერაპიაში და მოითხოვს მაღალი ხარისხის კლინიკურ სიფხიზლეს, არის იმუნოლოგიურად შუამავალი ჰიპერმგრძნობელობის რეაქცია, რომელიც გავლენას ახდენს პაციენტების 5-დან 8%-მდე მკურნალობის პირველი 6 კვირის განმავლობაში. 2002 წელს, ასოციაცია აბაკავირზე ჰიპერმგრძნობელობის რეაქციის დიაგნოზსა და I კლასის ჰისტოშეთავსებადობის კომპლექსის ძირითადი ალელის HLA-B*5701 გადატანას შორის დამოუკიდებლად მოხსენებული იყო რამდენიმე დამოუკიდებელი კვლევის შედეგად.\n" +
      "აივ ინფექციის მქონე კოჰორტების კვლევებმა ასევე აჩვენა, რომ აბაკავირის თავიდან აცილება HLA-B*5701 დადებით პაციენტებში მნიშვნელოვნად ამცირებს საეჭვო ჰიპერმგრძნობელობის რეაქციის სიხშირეს 0,5%-მდე. ამ მიზეზით მრავალი კლინიკური კვლევა გვირჩევს, რომ ფარმაკოგენეტიკური მოლეკულური ტესტირება მოხდეს I კლასის ჰისტოშეთავსებადობის კომპლექსის ძირითადი ალელეს HLA-B*5701-ზე ყველა აივ დადებით პაციენტში, რომლებიც მკურნალობენ აბაკოვირით.\n" +
      "HLA-B*5701 Real-TM ტესტს შეუძლია წინასწარ განსაზღვროს, თუ ვის განუვითარდება მძიმე ალერგიული რეაქცია აივ-ის საწინააღმდეგო პრეპარატ აბაკავირზე, რადგან HLA-B*5701-ის არსებობა მნიშვნელოვნად ასოცირდება აბაკავირის ჰიპერმგრძნობელობასთან. ",
    reagents: {
      first_reagent: {
        title: "HLA B*5701 Real-TM",
        description: "რეალურ დროში PCR ტესტი HLA B*5701-ის გამოსავლენად",
        code: "H53-100FRT",
      },
      second_reagent: {
        title: "Pneumocystis jirovecii (carinii) Real-TM",
        description:
          "რეალურ დროში PCR ტესტი Pneumocystis jirovecii (carinii) გამოვლენისთვის",
        code: "P2-50FRT",
      },
      third_reagent: {
        title: "Cryptococcus neoformans Real-TM",
        description:
          "რეალურ დროში PCR ტესტი Cryptococcus neoformans-ის გამოვლენისთვის",
        code: "F4-100FRT",
      },
      active: false,
      id: 3,
    },
  },
];
const hpvViruses = [
  {
    title:
      "PCR კომპლექტები მაღალი კანცეროგენული რისკის HPV გენოტიპების სკრინინგისთვის",
    description:
      " ნაკრები HPV High Risk Screen Real-TM Quant არის in vitro რეალურ დროში გამაძლიერებელი ტესტი HPV-ის 12 ტიპის რაოდენობრივი გამოვლენისთვის (16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59). ცნობილია, რომ ვირუსული დატვირთვის პარამეტრს აქვს პროგნოზული მნიშვნელობა და ვირუსული დატვირთვა 10*5 HPV გენომიურ ეკვივალენტზე ნაკლები ნაცხში ან 10*3 გენომის ეკვივალენტი 10*5 უჯრედისთვის, ითვლება უმნიშვნელოდ და მიუთითებს გარდამავალი ინფექციის არსებობაზე, თუმცა დატვირთვის ასეთი მონიტორინგი შეიძლება ჰქონდეს მხოლოდ მკურნალობის შემთხვევაში. 10*5-ზე მეტი გენომიური ეკვივალენტის ვირუსული დატვირთვა 10*5 უჯრედისთვის მიჩნეულია მაღალი მნიშვნელობით და მიუთითებს დისპლასტიკური ცვლილებების არსებობაზე ან მათი წარმოქმნის მაღალ რისკზე. ",
    reagents: {
      title: "HPV 14 Screen & 16,18,45 Typing Real-TM Quant",
      description:
        "რეალურ დროში PCR ტესტი 14 HPV-ის რაოდენობრივი გამოვლენისთვის (16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 და 68) და HPV 16, 18, 45-ის გენოტიპირება.",
      code: "V31-100/F FRT",
      active: false,
      id: 1,
    },
  },
  {
    title: "PCR კომპლექტები მაღალი კანცეროგენული რისკის HPV გენოტიპებისთვის",
    description:
      " ნაკრები HPV High Risk Typing Real-TM არის ინ ვიტრო მულტიპლექსური რეალურ დროში გამაძლიერებელი ტესტი ადამიანის პაპილომავირუსის ხარისხობრივი გამოვლენისა და გენოტიპაციისთვის (16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59 და ბიოგენური . ნაკრები HPV High Risk Typing Real-TM ეფუძნება ორ ძირითად პროცესს: ნიმუშებიდან დნმ-ის იზოლაციას და 4 მილის მულტიპლექსურ რეალურ დროში გაძლიერებას თითოეული ნიმუშისთვის. თითოეული ტუბი შეიცავს პრაიმერებს, რომლებიც მიმართულია სამი HPV ტიპის რეგიონისა და ბეტა-გლობინის გენის წინააღმდეგ, რომელიც გამოიყენება როგორც შიდა კონტროლი. ",
    reagents: {
      first_reagent: {
        title: "HPV genotypes 14 Real-TM Quant",
        description:
          "რეალურ დროში PCR ტესტი HPV-ს რაოდენობრივი გამოვლენისა და გენოტიპისთვის (16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 და 68)",
        code: "V67-100FRT",
      },
      second_reagent: {
        title: "HPV 16/18 Real-TM Quant",
        description:
          "რეალურ დროში PCR ტესტი HPV 16 და 18-ის რაოდენობრივი გამოვლენისთვის",
        code: "V12-100FRT",
      },
      active: false,
      id: 2,
    },
  },
  {
    title: "PCR კომპლექტები დაბალი კანცეროგენული რისკის HPV-სთვის",
    description:
      " დაბალი კანცეროგენული რისკის HPV-ს ჯგუფი წარმოდგენილია 12-ზე მეტი გენოტიპით და მათ უწოდებენ დაბალი რისკის ჯგუფს, რადგან მათ არ შეუძლიათ საშვილოსნოს ყელის კიბოს გამოწვევა. ზოგჯერ დაბალი რისკის HPV ტიპებმა შეიძლება გამოიწვიოს ხილული ცვლილებები გენიტალური არეში, რომელსაც გენიტალური მეჭეჭები ეწოდება. გენიტალური მეჭეჭები არის წარმონაქმნები ან მუწუკები ქალისა და მამაკაცის სასქესო ორგანოებში. ისინი ჩვეულებრივ უმტკივნეულოა. ისინი შეიძლება იყოს აწეული, ბრტყელი, პატარა ან დიდი და ერთჯერადი ან მრავალჯერადი. დაბალი რისკის HPV-დან მე-6 და მე-11 გენოტიპებს უდიდესი მნიშვნელობა აქვს, რადგან ისინი პასუხისმგებელნი არიან სასქესო ორგანოების დაბალი კანცეროგენული წვეტიანი კონდილომების დიდ რაოდენობაზე და ბავშვებში ხორხის კონდილომატოზის შემთხვევების 90 პროცენტზე მეტზე. ",
    reagents: {
      title: "HPV 6/11 Real-TM",
      description: "რეალურ დროში PCR ტესტი HPV 6 და 11-ის გამოვლენისთვის",
      code: "V11-100FRT",
      active: false,
      id: 3,
    },
  },
];
const stdViruses = [
  {
    title: "Chlamydia trachomatis PCR კომპლექტები",
    description:
      "C. trachomatis შეიძლება დიფერენცირებული იყოს 18 სეროვარად, მონოკლონურ ანტისხეულებზე დაფუძნებული ტიპური ანალიზის საფუძველზე. A, B, Ba და C სეროვარები ასოცირდება ტრაქომასთან (თვალის სერიოზული დაავადება, რომელიც შეიძლება გამოიწვიოს სიბრმავე), სეროვარები DK ასოცირდება გენიტალური ტრაქტის ინფექციებთან და L1-L3 ასოცირდება ვენერულ ლიმფოგრანულომასთან (LGV). Chlamydia trachomatis არის სავალდებულო უჯრედშიდა პათოგენი (ანუ ბაქტერია ცხოვრობს ადამიანის უჯრედებში) და შეიძლება გამოიწვიოს მრავალი დაავადების მდგომარეობა როგორც მამაკაცებში, ასევე ქალებში. ორივე სქესს შეუძლია აჩვენოს ურეთრიტი, პროქტიტი (რექტალური დაავადება და სისხლდენა), ტრაქომა და უნაყოფობა. ბაქტერიას შეუძლია გამოიწვიოს პროსტატიტი და ეპიდიდიმიტი მამაკაცებში და ცერვიციტი, მენჯის ღრუს ანთებითი დაავადება (PID), ექტოპიური ორსულობა ქალებში. C. trachomatis ასევე არის მნიშვნელოვანი ახალშობილთა პათოგენი",
    reagents: {
      title: "Chlamydia trachomatis Real-TM",
      description:
        "რეალურ დროში PCR ტესტი Chlamydia trachomatis-ის გამოვლენისთვის",
      code: "B1-100FRT",
      active: false,
      id: 1,
    },
  },
  {
    title: "Neisseria gonorrhoeae",
    description:
      " გონორეა, რომელიც გამოწვეულია Neisseria gonorrhoeae-ით, არის საზოგადოებრივი ჯანმრთელობის მნიშვნელოვანი პრობლემა და არის ყველაზე გავრცელებული საანგარიშო ინფექციური დაავადება. შეერთებულ შტატებში ყოველწლიურად დაახლოებით 700 000 ახალი გონოკოკური ინფექცია ხდება. გონორეა ყველაზე ხშირად სქესობრივი კონტაქტის დროს ვრცელდება. თუმცა, ის ასევე შეიძლება გადაეცეს დედის სასქესო ტრაქტიდან ახალშობილს დაბადებისას, რამაც გამოიწვიოს ახალშობილთა ოფთალმია და სისტემური ნეონატალური ინფექცია. ",
    reagents: {
      title: "Neisseria gonorrhoeae Real-TM",
      description:
        "რეალურ დროში PCR ტესტი Neisseria gonorrhoeae-ს გამოსავლენად",
      code: "B5-100FRT",
      active: false,
      id: 2,
    },
  },
  {
    title: "ურეაპლაზმის სახეობები და Mycoplasma PCR კომპლექტები",
    description:
      "ურეაპლაზმის სახეობები და მიკოპლაზმა არის არაქლამიდიური არაგონოკოკური ურეთრიტის მიზეზები. მიკოპლაზმის სახეობები არ იწვევენ ვაგინიტს, მაგრამ ისინი შეიძლება გამრავლდეს ბაქტერიული ვაგინოზის მქონე პაციენტებში და შეიძლება ხელი შეუწყონ ამ მდგომარეობას. სალპინგიტით დაავადებული ქალების დაახლოებით 10%-ის ენდომეტრიუმიდან და ფალოპის მილებიდან M hominis იზოლირებულია; M genitalium ასევე შეიძლება ჩართული იყოს მენჯის ანთებით დაავადებასა და ცერვიციტში. ურეაპლაზმის სახეობებს შეუძლიათ გამოიწვიონ პლაცენტის ანთება და შეიძლება ადრევე შეაღწიონ სანაყოფე პარკში, რამაც გამოიწვიოს მუდმივი ინფექცია და ორსულობის არასასურველი შედეგები, მათ შორის ნაადრევი მშობიარობა. Ureaplasma-ს ორი ბიოვარი, Ureaplasma urealyticum და Ureaplasma parvum, ახლა ცალკე სახეობად არის დასახელებული. ამ სახეობების განცალკევება შეუძლებელია გარდა მოლეკულური ტექნიკით, როგორიცაა პოლიმერაზული ჯაჭვური რეაქცია (PCR). ",
    reagents: {
      first_reagent: {
        title: "Ureaplasma species Real-TM",
        description:
          "რეალურ დროში PCR ტესტი ურეაპლაზმის სახეობების გამოსავლენად",
        code: "B2-100FRT",
      },
      second_reagent: {
        title: "Ureaplasma parvum/urealyticum Real-TM",
        description:
          "რეალურ დროში PCR ტესტი Ureaplasma parvum/urealyticum-ის გამოსავლენად",
        code: "B19-100FRT",
      },
      third_reagent: {
        title: "Mycoplasma hominis Real-TM",
        description:
          "რეალურ დროში PCR ტესტი Mycoplasma hominis-ის გამოვლენისთვის",
        code: "B3-100FRT",
      },
      fourth_reagent: {
        title: "Mycoplasma genitalium Real-TM",
        description:
          "რეალურ დროში PCR ტესტი Mycoplasma genitalium-ის გამოვლენისთვის",
        code: "B4-100FRT",
      },
      active: false,
      id: 3,
    },
  },
  {
    title: "ტრიქომონას ვაგინალური",
    description:
      "ტრიქომონიაზი არის ყველაზე გავრცელებული, განკურნებადი სქესობრივი გზით გადამდები დაავადება მსოფლიოში. ის ასევე არის სამი ყველაზე გავრცელებული ვაგინალური ინფექციიდან ქალებში. ჯანდაცვის მსოფლიო ორგანიზაციის წლიური შეფასებით, შეერთებულ შტატებში ყოველწლიურად ტრიქომონიაზის 7,4 მილიონი შემთხვევა ფიქსირდება, 180 მილიონზე მეტი შემთხვევა დაფიქსირდა მთელ მსოფლიოში. ტრიქომონიაზს იწვევს ერთუჯრედიანი პარაზიტი, Trichomonas vaginalis. ტრიქომონიაზი ავადდება როგორც ქალებში, ასევე მამაკაცებში. ქალებში ინფექციის ყველაზე გავრცელებული ლოკაცია საშოა, მამაკაცებში კი შარდსადენი. ",
    reagents: {
      title: "Trichomonas vaginalis Real-TM ",
      description:
        "რეალურ დროში PCR ტესტი Trichomonas vaginalis-ის გამოსავლენად",
      code: "B6-100FRT",
      active: false,
      id: 4,
    },
  },
  {
    title:
      "სქესობრივი გზით გადამდები დაავადებები: Multiplex RT-PCR კომპლექტები",
    reagents: {
      first_reagent: {
        title: "Chlamydia trachomatis/Ureaplasma/M.hominis Real-TM",
        description: "Multiplex Real Time PCR ტესტი",
        code: "B43-100FRT",
      },
      second_reagent: {
        title: "Chlamydia trachomatis/Ureaplasma/M.genitalium Real-TM",
        description: "Multiplex Real Time PCR ტესტი",
        code: "B46-100FRT",
      },
      third_reagent: {
        title: "C.trachomatis/Ureapl./M.hominis/M.genitalium Real-TM",
        description: "Multiplex Real Time PCR ტესტი",
        code: "B60-100FRT",
      },
      fourth_reagent: {
        title: "N.gonor./C.trachomatis/T.vaginalis/M.genitalium Real-TM",
        description: "Multiplex Real Time PCR ტესტი",
        code: "B61-100FRT",
      },
      fifth_reagent: {
        title: "T. vaginalis/N.gonorrhoeae Real-TM",
        description: "Multiplex Real Time PCR ტესტი",
        code: "B65-100FRT",
      },
      sixth_reagent: {
        title: "Chl. trachomatis/N.gonorrhoeae/M.genitalium Real-TM",
        description: "Multiplex Real Time PCR ტესტი",
        code: "B67-100FRT",
      },
      seventh_reagent: {
        title: "T. vaginalis/N.gonorrhoeae/Chl.trachomatis Real-TM",
        description: "Multiplex Real Time PCR ტესტი",
        code: "B83-100FRT",
      },
      eighth_reagent: {
        title: "Ureaplasma parvum/Ur.urealyticum/M.hominis Quant Real-TM",
        description: "Multiplex Real Time PCR ტესტი",
        code: "B75-100FRT Q",
      },
      active: false,
      id: 5,
    },
  },
  {
    title: "Candida albicans PCR კომპლექტები",
    description:
      " Candida albicans არის დიპლოიდური სოკო (საფუარის ფორმა) და ადამიანებში პირის ღრუს და სასქესო ორგანოების ოპორტუნისტული ინფექციების გამომწვევი აგენტი.\n" +
      "ნორმალურ პირობებში, C. albicans ცხოვრობს ადამიანის მოსახლეობის 80 პროცენტში მავნე ზემოქმედების გარეშე, თუმცა გადაჭარბებული ზრდა იწვევს კანდიდოზის განვითარებას. კანდიდოზი ხშირად შეინიშნება იმუნოკომპრომეტირებულ პირებში, როგორიცაა აივ-დადებითი პაციენტები, მაგრამ ასევე შეიძლება მოხდეს სისხლში და სასქესო ტრაქტში. ",
    reagents: {
      first_reagent: {
        title: "Candida albicans Real-TM",
        description:
          "რეალურ დროში PCR ტესტი Candida albicans-ის გამოვლენისთვის",
        code: "F1-100FRT",
      },
      second_reagent: {
        title: "Candida albicans/C.glabrata/C.krusei Real-TM",
        description: "Multiplex Real Time PCR ტესტი",
        code: "F3-100FRT",
      },
      third_reagent: {
        title: "Candidosis  Real-TM",
        description:
          "რეალურ დროში PCR ნაკრები C.albicans, C.glabrata, C.krusei, C.parapsilosis, C. tropicansi-ის რაოდენობრივი გამოვლენისთვის",
        code: "F5-100FRT",
      },
      fourth_reagent: {
        title: "MycoScreen Real-TM",
        description:
          "რეალურ დროში გამაძლიერებელი ნაკრები სოკოვანი ინფექციური აგენტების გამოვლენისა და ტიპაჟისთვის: C. guilliermondi, C. albicans, C. krusei, C. auris, C. tropicalis, C. lusitaniae, C. famata, C. dubliniensis, C. glabrata, C. პარაფსილოზი, C.kefyr, Malassezia spp., Malassezia furfur, Saccharomyces cerevisiae",
        code: "F23-48FRT",
      },
      active: false,
      id: 6,
    },
  },
  {
    title: "Treponema pallidum PCR კომპლექტები",
    description:
      "Treponema pallidum არის სპიროქეეტის ბაქტერიის სახეობა ქვესახეობებით, რომლებიც იწვევენ დაავადებას, როგორიცაა სიფილისი. სიფილისი არის სქესობრივი გზით გადამდები დაავადება, რომლის გადაცემის გზა თითქმის ყოველთვის არის სქესობრივი კონტაქტით, თუმცა არსებობს თანდაყოლილი სიფილისის მაგალითები დედიდან შვილზე საშვილოსნოში ან დაბადებისას გადაცემის გზით. T. pallidum გადაეცემა სპიროქეტების შეღწევის გზით ლორწოვანი გარსებით და ეპითელიუმის ზედაპირებზე აბრაზიებით. ",
    reagents: {
      title: "Treponema pallidum Real-TM",
      description: "რეალურ დროში PCR ტესტი Treponema pallidum-ის გამოსავლენად",
      code: "B20-100FRT",
      active: false,
      id: 7,
    },
  },
  {
    title: "ბაქტერიული ვაგინოზის PCR ნაკრები",
    description:
      " ბაქტერიული ვაგინოზი (BV) ითვლება ვაგინალური ანთების ყველაზე გავრცელებულ მიზეზად როგორც ორსულ, ისე არაორსულ ქალებში და პრევალენტობა 4.9%-დან 36.0%-მდე დაფიქსირდა ევროპულ და ამერიკულ კვლევებში. ადრე მას ეძახდნენ არასპეციფიკურ ვაგინიტს ან გარდნერელასთან ასოცირებულ ვაგინიტს.\n" +
      "ზრდასრული ადამიანის საშო არის რთული ეკოსისტემა, რომელიც შეიცავს უამრავ მიკროორგანიზმებს. მშობიარობის ასაკის ქალებში ამ სისტემაში დომინირებს Lactobacillus spp., გრამდადებითი, არამოძრავი ღეროს მსგავსი ბაქტერიების გვარი, რომლის განმსაზღვრელი მახასიათებელია მჟავე გარემოში ზრდისა და მჟავე პირობების ტოლერანტობის უნარი (pH <4,5); ლაქტობაცილი ასევე დუღს ნახშირწყლებს, რათა გამოიმუშაოს რძემჟავა და წარმოქმნას H2O2, რომელიც უზრუნველყოფს ბუნებრივ დაცვას Gardnerella vaginalis-ისგან. ბაქტერიული ვაგინოზის (BV) დროს ფლორის ბალანსი იცვლება ლაქტობაცილების შემცირებული რაოდენობით (ნორმალური კონცენტრაცია 10^6-10^10 CFU/მლ) და სხვა ფაკულტატური და ანაერობული სახეობების რაოდენობის ზრდა, როგორიცაა ანაერობული კოკები Prevotella spp., Gardnerella spp. და Mobil. (ნორმალური კონცენტრაცია < 10^3-10^5 CFU/მლ). გ.\n" +
      "ვაგინალური ფლორის შესწავლის კლინიკური მნიშვნელობა იმაში მდგომარეობს, რომ ის ეხმარება განსაზღვროს მიკროორგანიზმების რაოდენობა და შეაფასოს თანაფარდობა პირობით პათოგენური მიკროორგანიზმების სხვადასხვა ჯგუფებსა და ნორმალურ ფლორას შორის.\n" +
      "ბაქტერიების მთლიანი რაოდენობა ემსახურება ინფექციის დონის ინდიკატორს საშოს გარემოში: ნორმალურ პირობებში ის შეიძლება განსხვავდებოდეს 10^6-დან 10^9-მდე (6-9 Log). ლაქტობაცილებისა და ბაქტერიების მთლიან რაოდენობას შორის თანაფარდობა შეიძლება გამოყენებულ იქნას ნორმალურ და პირობითად პათოგენურ ფლორას შორის ბალანსის ინდიკატორად: ლაქტობაცილების ნორმალური პროპორცია უნდა იყოს ბაქტერიების მთლიანი რაოდენობის 95-დან 100%-მდე.\n" +
      "ბაქტერიული ვაგინოზის Real-TM Quant ნაკრები არის Gardnerella vaginalis, Atopobium vaginae, Lactobacillus spp რაოდენობრივი გამოვლენისთვის. და ბაქტერიების მთლიანი რაოდენობა ვაგინალურ ბიოტოპში. ლოგარითმული თანაფარდობა Lactobacillus spp-ს შორის. და ბაქტერიების მთლიანი რაოდენობა და ასევე Lactobacillus spp-ს შორის. და ფაკულტატური პათოგენური მიკროორგანიზმები (Gardnerella vaginalis და Atopobium vaginae) საშუალებას იძლევა მაღალი სიზუსტით გამოავლინოს ბაქტერიული ვაგინოზის დაავადება, რომელიც დაკავშირებულია ნორმალური ვაგინალური მიკროფლორის დათრგუნვით (Lactobacillus spp.) და ჩანაცვლებით ფაკულტატური გამომწვევი მიკროორგანიზმებით (Gardnerella vaginalis და Atopobium). ბაქტერიული ვაგინოზის Real-TM Quant ნაკრების გამოყენება საშუალებას იძლევა ვაგინალური გარემოს მდგომარეობის მონიტორინგი და თერაპიის ეფექტურობის შემოწმება. ",
    reagents: {
      first_reagent: {
        title: "Gardnerella vaginalis Real-TM",
        description:
          "რეალურ დროში PCR ტესტი Gardnerella vaginalis-ის გამოვლენისთვის",
        code: "B7-100FRT",
      },
      second_reagent: {
        title: "Gardnerella vaginalis/Lactobac. species Real-TM Quant",
        description:
          "რეალურ დროში PCR ტესტი G.vaginalis-ისა და Lactobacillus-ის რაოდენობრივი გამოვლენისთვის",
        code: "R-B7-100FRT",
      },
      third_reagent: {
        title: "Bacterial Vaginosis Real-TM Quant",
        description:
          "Multiplex RT-PCR G. vaginalis, Atopobium vaginae, Lactobacillus spp რაოდენობრივი გამოვლენისთვის. და მთლიანი ბაქტერიები ვაგინალურ ბიოტოპში",
        code: "B74-100FRT",
      },
      active: false,
      id: 8,
    },
  },
  {
    title: "მამაკაცის ჯანმრთელობის PCR კომპლექტები",
    description:
      "ქრონიკული ბაქტერიული პროსტატიტი (CBP) წარმოადგენს პროსტატის ჯირკვლის ბაქტერიულ ინფექციას. CBP იწვევს ასოცირებულ სიმპტომურ კომპლექსს, რომლის დამახასიათებელი ნიშანია საშარდე გზების მორეციდივე ინფექციების გაჩენა. ყველა მამაკაცის დაახლოებით ნახევარს საბოლოოდ უვითარდება პროსტატიტის შესაბამისი სიმპტომები. ეს სიმპტომების კომპლექსი შეადგენს მამაკაცებში უროლოგიური შეფასებების დაახლოებით 25%-ს.",
    reagents: {
      title: "ProstateScreen Real-TM",
      description:
        "რეალურ დროში PCR ტესტი ქრონიკული ბაქტერიული პროსტატიტის დიაგნოსტიკისთვის (Enterobacter spp., Klebsiella spp., Enterococcus faecalis, Е. faecium, Escherichia coli, Proteus spp., Pseudomonas aeruginosa, Serratia spp., Staphylococcus aureus, Streptococcus sp.812) ზოლის ფორმატი",
      code: "01765-50",
      active: false,
      id: 9,
    },
  },
];
const herpesViruses = [
  {
    title: "ციტომეგალოვირუსი (CMV)",
    description:
      "ციტომეგალოვირუსი (CMV) არის ორჯაჭვიანი დნმ ვირუსი და წარმოადგენს Herpesviridae ოჯახის წარმომადგენელს. CMV იზიარებს ბევრ ატრიბუტს სხვა ჰერპეს ვირუსებთან, მათ შორის გენომი, ვირიონის სტრუქტურა და ლატენტური და მდგრადი ინფექციების გამოწვევის უნარი. ადამიანის CMV იზრდება მხოლოდ ადამიანის უჯრედებში და საუკეთესოდ მეორდება ადამიანის ფიბრობლასტებში. 6 წელზე უფროსი ასაკის პირთა დაახლოებით 58.9% ინფიცირებულია CMV-ით, ხოლო 80 წელზე უფროსი ასაკის პირთა 90.8% დადებითია CMV ანტისხეულებზე. იმუნოდეფიციტის მქონე ადამიანებში სიმპტომატურმა CMV დაავადებამ შეიძლება გავლენა მოახდინოს სხეულის თითქმის ყველა ორგანოზე, რამაც გამოიწვია უცნობი წარმოშობის ცხელება, პნევმონია, ჰეპატიტი, ენცეფალიტი, მიელიტი, კოლიტი, უვეიტი, რეტინიტი და ნეიროპათია. აივ ინფექციით ინფიცირებულ პაციენტებში CMV ინფექცია იწვევს შიდსის პროგრესირებას და საბოლოოდ სიკვდილს.",
    reagents: {
      first_reagent: {
        title: "CMV Real-TM",
        description: "რეალურ დროში PCR ტესტი ციტომეგალოვირუსის გამოსავლენად",
        code: "V7-100FRT",
      },
      second_reagent: {
        title: "CMV Real-TM Quant",
        description:
          "რეალურ დროში PCR ტესტი CMV-ის რაოდენობრივი გამოვლენისთვის",
        code: "V7-100/2FRT",
      },
      third_reagent: {
        title: "CMV/EBV/HHV6 Quant Real-TM",
        description:
          "Multiplex Real Time PCR ტესტი CMV, EBV, HHV6 რაოდენობრივი გამოვლენისთვის",
        code: "V48-100FRT ",
      },
      active: false,
      id: 1,
    },
  },
  {
    title: "ეპშტეინ-ბარის ვირუსი (EBV)",
    description:
      "ეპშტეინ-ბარის ვირუსი (EBV), ან ადამიანის ჰერპესვირუსი 4, არის გამაჰერპესვირუსი, რომელიც აინფიცირებს მოსახლეობის 95%-ზე მეტს. ამ ორგანიზმით პირველადი ინფექციის ყველაზე გავრცელებული გამოვლინებაა მწვავე ინფექციური მონონუკლეოზი, თვითშეზღუდული კლინიკური სინდრომი, რომელიც ყველაზე ხშირად აზიანებს მოზარდებსა და ახალგაზრდებს. კლასიკური სიმპტომებია ყელის ტკივილი, ცხელება და ლიმფადენოპათია. თუმცა, ეპშტეინ-ბარის ვირუსი ასევე არის ადამიანის სიმსივნური ვირუსი, პირველი ვირუსი, რომელიც ასოცირდება ადამიანის ავთვისებიან სიმსივნესთან. ეპშტეინ-ბარის ვირუსით ინფექცია ასოცირდება ლიმფოპროლიფერაციულ დარღვევებთან, განსაკუთრებით იმუნოკომპრომეტირებულ მასპინძლებში და ასოცირდება სხვადასხვა სიმსივნეებთან, მათ შორის ცხვირ-ხახის კარცინომასთან და ბურკიტის ლიმფომასთან.",
    reagents: {
      title: "EBV Real-TM Quant",
      description: "რეალურ დროში PCR ტესტი EBV-ის რაოდენობრივი გამოვლენისთვის",
      code: "V9-100FRT",
      active: false,
      id: 2,
    },
  },
  {
    title: "ადამიანის ჰერპესვირუსი 6 და 7 (HHV-6 და HHV-7)",
    description:
      "Herpesviridae არის დნმ-ის ვირუსების დიდი ოჯახი, რომლებიც იწვევენ დაავადებებს ადამიანებში. ამ ოჯახის წევრები ასევე ცნობილია როგორც ჰერპესვირუსები. ცნობილია ჰერპესვირუსის 9 ტიპი, რომელიც აინფიცირებს ადამიანებს: ჰერპეს სიმპლექსის ვირუსები 1 და 2, HSV-1 და HSV-2, (HHV1 და HHV2), ვარიცელა-ზოსტერის ვირუსი (VZV ან HHV-3), ეპშტეინ-ბარის ვირუსი (EBV ან HHV-4), ადამიანის ციტომეგალოვირუსი (HCV-5HVHV-4), ადამიანის ციტომეგალოვირუსი (HCV-5HHV-4). HV-6A და HHV-6B), ადამიანის ჰერპესვირუსი 7 (HHV-7) და კაპოშის სარკომასთან ასოცირებული ჰერპესვირუსი (KSHV ან HHV-8).\n" +
      "\n" +
      "ადამიანის ჰერპესვირუსები 6 (HHV-6) A და B არის ორი განსხვავებული ლიმფოტროპული β-ჰერპესვირუსი, რომელიც აინფიცირებს ადამიანების უმრავლესობას. 5 წლისთვის ადამიანთა უმრავლესობამ შეიძინა HHV-6 ინფექცია, როგორც ეს მიუთითებს სეროპოზიტიურობით. პირველადი HHV-6 ინფექციის კლასიკური პრეზენტაცია არის Roseola Infantum. იმუნოკომპეტენტურ პირებში პირველადი HHV-6 ინფექცია ხშირად ასიმპტომურია ან კლინიკურად შეიძლება გამოვლინდეს როგორც ფებრილური დაავადება, რომელიც დაკავშირებულია ეგზანთემასთან, დიარეასთან, რესპირატორულ სიმპტომებთან, კრუნჩხვით ან ენცეფალიტთან.\n" +
      "\n" +
      "ადამიანის ჰერპესვირუსი (HHV-7) ასევე არის ლიმფოტროპული β-ჰერპესვირუსი, რომელიც აინფიცირებს ადამიანებს სიცოცხლის პირველი 5 წლის განმავლობაში. HHV-6-ის მსგავსად, ის შეიძლება იყოს ასიმპტომური ან კლინიკურად გამოვლინდეს როგორც ცხელება, ზედა სასუნთქი გზების სიმპტომები, ღებინება, დიარეა, კრუნჩხვები, ენცეფალიტი და როზეოლას მსგავსი დაავადება. მიუხედავად იმისა, რომ ყველაზე გავრცელებული კლინიკური გამოვლინებები HHV-7 ვირემიულ ბავშვებში არის კრუნჩხვები და ცხელება.",
    reagents: {
      first_reagent: {
        title: "HHV6 Real-TM Quant",
        description:
          "რეალურ დროში PCR ტესტი HHV6-ის რაოდენობრივი გამოვლენისთვის",
        code: "V10-100FRT",
      },
      second_reagent: {
        title: "HHV7 Real-TM Quant",
        description:
          "რეალურ დროში PCR ტესტი HHV7-ის რაოდენობრივი გამოვლენისთვის",
        code: "V17-100FRT",
      },
      third_reagent: {
        title: "HHV8 Real-TM",
        description: "რეალურ დროში PCR ტესტი HHV8-ის გამოსავლენად",
        code: "V203-100FRT",
      },
      active: false,
      id: 3,
    },
  },
  {
    title: "Varicella Zoster virus (VZV)",
    description:
      "Varicella-zoster virus (VZV) არის ალფა ჰერპეს ვირუსი, რომელიც იწვევს ჩუტყვავილას და ჰერპეს ზოსტერს (ზოსტერი). [ 1 ]  ვარიკოზს ახასიათებს მაკულოპაპულური, ბუშტუკოვანი გამონაყარი, რომელიც შეიძლება იყოს ქავილი და 3-დან 7-დღიან პერიოდში გადაიზარდოს გამომშრალ ქერქებად (ქაფები). მიძინებული ვირუსის ხელახალი გააქტიურება იწვევს ჰერპეს ზოსტერის დამახასიათებელ მტკივნეულ დერმატომულ გამონაყარს, რასაც ხშირად მოჰყვება ტკივილი გამონაყარის განაწილებაში (პოსტერპეტური ნევრალგია). \n" +
      "\n" +
      "ჩუტყვავილა ითვლება გადამდები, რომელიც იწყება გამონაყარის დაწყებამდე 1-2 დღით ადრე, სანამ ყველა დაზიანებები არ გახდება ქერქი.",
    reagents: {
      title: "VZV Real-TM",
      description: "რეალურ დროში PCR ტესტი VZV-ის გამოვლენისთვის",
      code: "V61-50FRT",
      active: false,
      id: 4,
    },
  },
  {
    title: "ჰერპეს სიმპლექსის ვირუსი (HSV)",
    description:
      "ჰერპეს სიმპლექსი არის ვირუსული დაავადება, რომელიც გამოწვეულია როგორც ჰერპეს სიმპლექსის ვირუსის ტიპი 1 (HSV-1) და ტიპი 2 (HSV-2). ჰერპესის ვირუსით ინფექცია იყოფა რამდენიმე განსხვავებულ აშლილობად, ინფექციის ადგილიდან გამომდინარე. პირის ღრუს ჰერპესი, რომლის თვალსაჩინო სიმპტომებს სასაუბროდ უწოდებენ სიცივეს ან ციებ-ცხელების ბუშტუკებს, აზიანებს სახესა და პირს. პირის ღრუს ჰერპესი ინფექციის ყველაზე გავრცელებული ფორმაა. გენიტალური ჰერპესი, რომელიც ცნობილია უბრალოდ ჰერპესის სახელით, ჰერპესის მეორე ყველაზე გავრცელებული ფორმაა. სხვა აშლილობები, როგორიცაა ჰერპესული თეთრი, ჰერპეს გლადიატორუმი, თვალის ჰერპესი (კერატიტი), ცერებრალური ჰერპესული ინფექციური ენცეფალიტი, მოლარეტის მენინგიტი, ახალშობილთა ჰერპესი, ყველა გამოწვეულია ჰერპეს სიმპლექსის ვირუსებით.",
    reagents: {
      first_reagent: {
        title: "HSV 1/2 Real-TM",
        description: "რეალურ დროში PCR ტესტი HSV-ის გამოსავლენად",
        code: "V8-100FRT",
      },
      second_reagent: {
        title: "HSV 1/2 Typing Real-TM",
        description: "რეალურ დროში PCR ტესტი HSV-ის გამოვლენისა და აკრეფისთვის",
        code: "V38-100FRT",
      },
      active: false,
      id: 5,
    },
  },
];
const torchViruses = [
  {
    title: "ტოქსოპლაზმოზი",
    description:
      "ტოქსოპლაზმოზი გამოწვეულია Toxoplasma gondii-ით, სავალდებულო უჯრედშიდა პარაზიტით. ინფექცია იწვევს კლინიკურ სინდრომების ფართო სპექტრს ადამიანებში, ხმელეთის და ზღვის ძუძუმწოვრებში და სხვადასხვა ფრინველის სახეობებში. იმუნოკომპეტენტური პირების უმეტესობაში პირველადი ან ქრონიკული (ლატენტური) T gondii ინფექცია ასიმპტომურია. ამ პაციენტების მცირე პროცენტს საბოლოოდ უვითარდება ქორიორეტინიტი, ლიმფადენიტი, ან იშვიათად მიოკარდიტი და პოლიმიოზიტი. თუმცა, ზოგიერთ ადამიანს აქვს მძიმე ან სიცოცხლისათვის საშიში ტოქსოპლაზმოზის მაღალი რისკი. ტოქსოპლაზმოზის რისკის ქვეშ მყოფი პირები მოიცავს ნაყოფს, ახალშობილს და იმუნოლოგიურად დაქვეითებულ პაციენტებს. თანდაყოლილი ტოქსოპლაზმოზი ჩვეულებრივ სუბკლინიკური ინფექციაა. იმუნოდეფიციტურ პირებს შორის ტოქსოპლაზმოზი ყველაზე ხშირად გვხვდება T-უჯრედოვანი იმუნიტეტის დეფექტებით.",
    reagents: {
      title: "Toxoplasma Real-TM",
      description: "რეალურ დროში PCR ტესტი ტოქსოპლაზმის გამოსავლენად",
      code: "P1-50FRT",
      active: false,
      id: 1,
    },
  },
  {
    title: "პარვოვირუსი B19 (B19V)",
    description:
      "პარვოვირუსი B19 (B19V) არის ერთჯაჭვიანი დნმ-ის ვირუსი Parvoviridae-სა და ერითროვირუსების გვარიდან. ნაჩვენებია, რომ ადამიანის პარვოვირუსი B19 იყო ინფექციური ერითემის ეტიოლოგიური აგენტი ჰემატოლოგიურად ნორმალურ ადამიანებში. ინფექციურ ერითემას თავდაპირველად მეხუთე დაავადება ეწოდა, რადგან ეს იყო მეხუთე ბავშვობის 6 კლასიკური ეგზანთემატოზური დაავადების აღწერილობა. მოგვიანებით დაფიქსირდა არაიმუნური ჰიდროპსის ფეტალისის შემთხვევები, როდესაც ქალში ინფექცია მოხდა ორსულობის დროს. იმუნოდეფიციტის მქონე პაციენტებს (მაგ., იღებენ ქიმიოთერაპიას ან იმუნოსუპრესიულ პრეპარატებს ან აქვთ იმუნური დეფექტები [თანდაყოლილი და შეძენილი]) შეიძლება განუვითარდეთ ქრონიკული პარვოვირუსის B19 ინფექცია, რომელიც იწვევს ქრონიკულ ანემიას. წმინდა წითელი უჯრედების აპლაზია (PRAC) გრძელდება ვირუსის გაწმენდამდე და უნდა გამოირჩეოდეს ზემოთ აღწერილი გარდამავალი ანემიისგან.",
    reagents: {
      title: "Parvovirus B19 Real-TM",
      description: "რეალურ დროში PCR ტესტი პარვოვირუსის B19-ის გამოსავლენად",
      code: "V49-50FRT",
      active: false,
      id: 2,
    },
  },
  {
    title: "წითურა",
    description:
      "სახელწოდება რუბელა მომდინარეობს ლათინური ტერმინიდან, რაც ნიშნავს პატარა წითელს. რუბელა ზოგადად კეთილთვისებიანი გადამდები ეგზანთემატოზური დაავადებაა და ის გამოწვეულია რუბელა ვირუსით, რომელიც არის რუბივირუსების გვარის წარმომადგენელი Togaviridae-ს ოჯახისა. ამ ვირუსით ინფიცირებულთა თითქმის ნახევარი უსიმპტომოა. მცირეწლოვან ბავშვებში ინფექციას ახასიათებს მსუბუქი კონსტიტუციური სიმპტომები, გამონაყარი და სუბკოციპიტალური ადენოპათია; პირიქით, უფროს ბავშვებში, მოზარდებში და მოზრდილებში წითურა შეიძლება გართულდეს ართრალგიით, ართრიტით და თრომბოციტოპენიური პურპურით. ასევე აღწერილია წითურას ენცეფალიტის იშვიათი შემთხვევები ბავშვებში. წითურას მთავარი გართულება არის მისი ტერატოგენული ეფექტი, როდესაც ორსული ქალები ავადდებიან ამ დაავადებით, განსაკუთრებით ორსულობის პირველ კვირებში.",
    reagents: {
      title: "Rubella Real-TM",
      description: "რეალურ დროში PCR ტესტი რუბელას გამოსავლენად",
      code: "V24-50FRT",
      active: false,
      id: 3,
    },
  },
];
const respiratoryInfection = [
  {
    title: "გრიპი",
    description:
      "გრიპის ვირუსის ინფექცია, ერთ-ერთი ყველაზე გავრცელებული ინფექციური დაავადება, არის უაღრესად გადამდები დაავადება, რომელიც იწვევს მწვავე ფებრილურ დაავადებას და იწვევს სისტემური სიმპტომების ცვალებად ხარისხს, დაწყებული მსუბუქი დაღლილობით სუნთქვის უკმარისობით და სიკვდილამდე. ეს სიმპტომები ხელს უწყობს სამუშაო დღეების მნიშვნელოვან დაკარგვას, ადამიანის ტანჯვას, სიკვდილიანობას და მნიშვნელოვან ავადობას. გრიპი გამოწვეულია გრიპის ვირუსის 3 ძირითადი ტიპის 1-დან ინფექციის შედეგად: A, B ან C, რომლებიც კლასიფიცირებულია Orthomyxoviridae-ს ოჯახში. ეს ერთჯაჭვიანი რნმ ვირუსები სტრუქტურულად და ბიოლოგიურად მსგავსია, მაგრამ განსხვავდება ანტიგენურად. A გრიპის ყველაზე გავრცელებული ქვეტიპები, რომლებიც აინფიცირებს ადამიანებს, არის H1N1, H5N1 და H3N2.",
    reagents: {
      first_reagent: {
        title: "Influenza A, B Real-TM",
        description: "რეალურ დროში PCR ტესტი A და B გრიპის გამოსავლენად",
        code: "V36-100FRT",
      },
      second_reagent: {
        title: "Avian A Screening & Avian H5N1 Typing FRT",
        description:
          "რეალურ დროში PCR ტესტი ფრინველის A ვირუსის გამოვლენისა და H5N1 ქვეტიპის გენოტიპისთვის",
        code: "R-V33-FRT",
      },
      third_reagent: {
        title: "Influenza A H5 H7 H9 Typing FRT",
        description:
          "რეალურ დროში PCR ტესტი გრიპის A ვირუსის H5 H7 H9 ქვეტიპების გამოსავლენად",
        code: "V47-50FRT",
      },
      fourth_reagent: {
        title: "Influenza A H1N1 & H3N2 Real-TM",
        description:
          "რეალურ დროში PCR ტესტი H1N1 და H3N2 ტიპის გრიპის A ვირუსის გამოსავლენად",
        code: "V54-50FRT",
      },
      fifth_reagent: {
        title: "Swine Influenza Virus H1 Real-TM",
        description:
          "რეალურ დროში PCR ტესტი ღორის გრიპის A/H1 ვირუსის გამოსავლენად",
        code: "V55-50FRT",
      },
      active: false,
      id: 1,
    },
  },
  {
    title: "ქლამიდია და მიკოპლაზმური პნევმონია",
    description:
      "Chlamydophila (ყოფილი Chlamydia) pneumoniae იწვევს მსუბუქ პნევმონიას ან ბრონქიტს მოზარდებში და ახალგაზრდებში. ხანდაზმულებს შეიძლება განიცდიან უფრო მძიმე დაავადება და განმეორებითი ინფექციები. ახალგაზრდების დაახლოებით 50%-ს და ხანდაზმულთა 75%-ს აქვს წინა ინფექციის სეროლოგიური მტკიცებულება. შეფასებულია, რომ პათოგენი იწვევს მოზრდილებში საზოგადოების მიერ შეძენილი პნევმონიის შემთხვევების 10-20%-ს. C pneumoniae პნევმონიის შემთხვევების სავარაუდო რაოდენობა წელიწადში 300000 შემთხვევაა.",
    reagents: {
      title: "Mycoplasma pneumoniae / Chl. pneumoniae Real-TM",
      description:
        "რეალურ დროში PCR ტესტი ქლამიდიის და მიკოპლაზმური პნევმონიის გამოსავლენად",
      code: "B42-4-50FRT",
      active: false,
      id: 2,
    },
  },
  {
    title: "Pseudomonas aeruginosa",
    description:
      "Pseudomonas არის გრამუარყოფითი ღერო, რომელიც ეკუთვნის Pseudomonadaceae-ს ოჯახს. Pseudomonas aeruginosa გახდა ინფექციის მნიშვნელოვანი მიზეზი, განსაკუთრებით პაციენტებში მასპინძლის დამცავი მექანიზმების დარღვევით. ფსევდომონალური ბაქტერიემია გვხვდება ავთვისებიან სიმსივნესთან, ქიმიოთერაპიასთან, შიდსთან, დამწვრობის ჭრილობის სეფსისთან და დიაბეტთან ერთად. წინასწარგანწყობილი პირობები მოიცავს ინტრავენური ხაზების განთავსებას, მძიმე დამწვრობას, საშარდე გზების კათეტერიზაციას, ოპერაციას, ტრავმას და ნაადრევ მშობიარობას. ეს არის ყველაზე გავრცელებული პათოგენი, რომელიც იზოლირებულია პაციენტებისგან, რომლებიც ჰოსპიტალიზირებულია 1 კვირაზე მეტხანს. ეს არის ნოზოკომიური ინფექციების ხშირი მიზეზი, როგორიცაა პნევმონია, ენდოკარდიტი, მენინგიტი, საშარდე გზების ინფექციები (UTIs) და ბაქტერიემია.",
    reagents: {
      title: "Pseudomonas aeruginosa  Quant Real-TM",
      description:
        "რეალურ დროში PCR ნაკრები Pseudomonas aeruginosa-ს რაოდენობრივი გამოვლენისთვის",
      code: "B76-50FRT",
      active: false,
      id: 3,
    },
  },
  {
    title: "ლეგიონელა პნევმოფილა",
    description:
      "Legionella pneumophila არის წვრილი, პლეომორფული, დროშისებრი გრამუარყოფითი ბაქტერია ლეგიონელას გვარისა. Legionella pneumophila არის ყველგან გავრცელებული წყლის გარემოში მთელს მსოფლიოში და ბინადრობს, როგორც ამეების და პროტოზოების უჯრედშიდა პარაზიტი, რომელიც უზრუნველყოფს კავშირს ბუნებრივ გარემოსა და ადამიანის დაავადებას შორის. ამრიგად, გარემოსდაცვითი მონიტორინგი, განსაკუთრებით სასმელი წყლის, გამაგრილებელი კოშკების და მასთან დაკავშირებული წყაროების, ძირითადი აქცენტია ამ დაავადების გავრცელების კონტროლის მცდელობებში. ლეგიონერების დაავადება ჰოსპიტალში მყოფ პაციენტებში ატიპიური პნევმონიის ყველაზე გავრცელებული მიზეზია. ეს არის საზოგადოების მიერ შეძენილი ბაქტერიული პნევმონიის მეორე ყველაზე გავრცელებული მიზეზი 25% სიკვდილიანობით.",
    reagents: {
      title: "Legionella pneumophila Real-TM",
      description:
        "რეალურ დროში PCR ტესტი Legionella pneumophila-ს რაოდენობრივი გამოვლენისთვის",
      code: "B50-50FRT",
      active: false,
      id: 4,
    },
  },

  {
    title: "მწვავე რესპირატორული ვირუსული ინფექციები",
    description:
      " მწვავე რესპირატორული ვირუსული ინფექციები (ARVI) ყველაზე ხშირი დაავადებაა, რომელსაც ადამიანების უმეტესობა განიცდის მსოფლიოში. მცირეწლოვან ბავშვებს აქვთ ამ დაავადებებს შორის ხუთიდან შვიდი წელიწადში, ასაკთან ერთად სიხშირე მცირდება. მოზრდილებს წელიწადში დაახლოებით ორი ასეთი დაავადება ექნებათ.\n" +
      "მრავალფეროვანი ვირუსები, რომლებიც შეიცავს როგორც რნმ-ს, ასევე დნმ-ს, იწვევს მწვავე რესპირატორულ ინფექციებს. ყველაზე მნიშვნელოვანი ვირუსებია რინოვირუსები, კოროვირუსები, პარაგრიპის ვირუსები, რესპირატორული სინციციალური ვირუსები, ადენოვირუსები, მეტაპნევმოვირუსები.",
    reagents: {
      first_reagent: {
        title: "ARVI Screen Real-TM",
        description:
          "Multiplex RT-PCR ადამიანის პარაგრიპის ვირუსის-1-4 (hPiv) რნმ-ის გამოვლენა და იდენტიფიკაცია; ადამიანის კორონავირუსის (hCov) რნმ; ადამიანის რინოვირუსის (hRv) რნმ; ადამიანის ადენოვირუსი (hAdv) დნმ და ადამიანის ბოკავირუსი (hBov)",
        code: "V57-100FRT",
      },
      second_reagent: {
        title: "ARVI Plus Real-TM",
        description:
          "16 რესპირატორული ვირუსის მულტიპლექსური RT-PCR გამოვლენა და იდენტიფიკაცია: SARS-Cov-2 კორონავირუსი, გრიპის A ვირუსი, გრიპის B ვირუსი, ადამიანის პარაგრიპის ვირუსი-1-2-3-4 რნმ, ОС43, 229E, NL63 და HKUI ადამიანის კორონავირუსის (hCov) რნმ, ადამიანის ბოკავირუსი, ადამიანის რინოვირუსი, hRSV, ადამიანის ადენოვირუსი, ადამიანის მეტაპნევმოვირუსი",
        code: "V439-48FRT",
      },
      active: false,
      id: 6,
    },
  },
  {
    title: "ბორდეტელა",
    description:
      "Bordetella pertussis არის ადამიანის სავალდებულო პათოგენი და არის ყივანახველას გამომწვევი აგენტი. Bordetella parapertussis იწვევს დაავადების უფრო მსუბუქ ფორმას ადამიანებში და ასევე იწვევს რესპირატორულ ინფექციებს ცხვრებში. Bordetella bronchiseptica იწვევს დაავადებას ძუძუმწოვართა ბევრ სახეობაში, მაგრამ ადამიანები იშვიათად ინფიცირდებიან ამ ორგანიზმით და, როგორც წესი, მოიცავს იმუნოკომპრომეტირებულ პაციენტებს.",
    reagents: {
      title: "Bordetella pertussis/B.parapertussis/B.bronchiseptica Real-TM",
      description:
        "რეალურ დროში PCR ნაკრები Bordetella-ს გამოვლენისა და აკრეფისთვის",
      code: "B84-100FRT",
      active: false,
      id: 7,
    },
  },
  {
    title: "კორონავირუსი MERS SARS",
    description:
      "რაც შეეხება SARS-ს, ოჯახის საერთო ნიშნების გარდა, წყლიანი დიარეა გამოვლინდა პაციენტების 73%-ში 1 კვირის შემდეგ, რაც დაკავშირებულია კანალიზაციის გაუმართავ სისტემასთან, რაც შესაძლოა მიეკუთვნებოდეს კუჭ-ნაწლავის ტრაქტის ინფექციას ფეკალურ-ორალური გზით. SARS-ის ხანდაზმულ პაციენტებს ასევე შეუძლიათ გამოავლინონ ანორექსია ან მოტეხილობით გართულებული დაცემა. ასევე შესაძლებელია დელირიუმი.[ 46 , 47 ] მოზარდებში SARS-ის ნიშნები ახლოსაა მოზრდილებში აღმოჩენილებთან.[ 48 ] ფილტვების აუსკულტაციისას პაციენტების უმრავლესობაში რამდენიმე კვლევაში გამოვლინდა რალები ან რონქები. საქმეების სერიაში, რომელიც შესრულებულია ჰონგ კონგში JSM Peiris et al.პაციენტთა უმრავლესობას აღენიშნებოდა მორეციდივე სიმპტომები. კვლევამ გამოიკვეთა 3-კვირიანი კურსი, რომელიც დაიწყო ცხელებით და მიალგიით 1 კვირაში და პროგრესირებდა პერიოდულ ცხელებამდე, ჰიპოქსემიით, დიარეით და გულმკერდის ხანმოკლე ინფილტრატებამდე მე-2 კვირაში. ARDS განვითარდა პაციენტების 20%-ში მათი დაავადების მესამე კვირაში. " +
      "MERS-ის ინფექციით დაავადებულ პაციენტებს ხშირად აღენიშნებოდათ თავის ტკივილი, მიალგია და დიარეა.[ 50 ] MERS-ით დაავადებული 70 პაციენტისგან შემდგარი შემთხვევების სერიაში 30 (42.9%) პაციენტს განუვითარდა თირკმლის მწვავე უკმარისობა.[ 27 ] ეს მაჩვენებლები გაცილებით მაღალია ქრონიკული დაავადებული MERS პაციენტებისთვის. ერთ მოხსენებაში 58%-ს (7/12 პაციენტს) ესაჭიროებოდა თირკმლის ჩანაცვლებითი თერაპია. გარდა ამისა, ვინაიდან MERS-ის ამოღება შესაძლებელია ინფიცირებული პაციენტების შარდიდან, მკვლევარებმა გამოთქვეს ვარაუდი ვირუსული ინფექციის მიერ თირკმლის შესაძლო ჩარევის რისკზე.[51 ] ამის საპირისპიროდ, Chu KH et al.- ის მიერ ჩატარებული კვლევა . SARS-ის მქონე პაციენტებში პაციენტთა 6.3%-ს აღენიშნებოდა თირკმლის მწვავე უკმარისობა და 91.7% თირკმლის უკმარისობით გარდაიცვალა.",
    reagents: {
      title: "MERS-SARS CoV Real-TM",
      description:
        "რეალურ დროში PCR ნაკრები ახლო აღმოსავლეთის რესპირატორული სინდრომის (MERS-CoV) და მძიმე მწვავე რესპირატორული სინდრომის კორონავირუსების (SARS) გამოვლენისა და დიფერენციაციისთვის.",
      code: "V65-50FRT",
      active: false,
      id: 8,
    },
  },
  {
    title: "COVID-19 (SARS-Cov-2)",
    description:
      " ახალი კორონავირუსი (SARS-CoV-2) არის ახალი შტამი, რომელიც ადრე არ იყო გამოვლენილი ადამიანებში. მძიმე მწვავე რესპირატორული სინდრომი კორონავირუსი 2 (SARS-CoV-2), რომელიც ასევე ცნობილია როგორც 2019 წლის ახალი კორონავირუსი (2019-nCoV), არის დადებითი გრძნობის ერთჯაჭვიანი რნმ ვირუსი. ის გადამდებია ადამიანებში და არის 2019 წლის კოროვირუსული დაავადების (COVID-19) მიმდინარე პანდემიის მიზეზი, რომელიც ჯანდაცვის მსოფლიო ორგანიზაციის (WHO) მიერ არის გამოცხადებული საზოგადოებრივი ჯანმრთელობის საერთაშორისო შეშფოთების საგანგებო სიტუაციად.\n" +
      "ამჟამად ცნობილი ინფექციის ყველაზე ადრეული შემთხვევა, სავარაუდოდ, აღმოჩენილია 2019 წლის ნოემბერში. ვირუსი შემდგომში გავრცელდა ჩინეთის ყველა პროვინციაში და ასზე მეტ ქვეყანაში აზიაში, ევროპაში, ჩრდილოეთ ამერიკაში, სამხრეთ ამერიკაში, აფრიკასა და ოკეანიაში. 11 მარტს ჯანმო-მ ის ოფიციალურად გამოაცხადა პანდემიად.",
    reagents: {
      first_reagent: {
        title: "SARS-Cov-2 Real-TM",
        description:
          "SARS-CoV-2 Real-TM არის მრავალსამიზნე რეალურ დროში PCR ტესტი SARS-CoV-2 (COVID-19 ვირუსი, 2019-nCoV) რნმ-ის ხარისხობრივი გამოვლენისთვის კლინიკურ ნიმუშებში. ის აღმოაჩენს SARS-Cov-2 ვირუსის გენომის 2 სხვადასხვა სპეციფიკურ გენს, E-გენს და N-გენს. იგი მოიცავს ცალკეულ ფლუორესცენციულ არხს SARS-ის მსგავსი ვირუსების კონსერვირებული რეგიონის გამოსავლენად, რომელიც აღმოაჩენს როგორც SARS-Cov-ს, ასევე SARS-Cov-2-ს.",
        code: "V435-100FRT",
      },
      second_reagent: {
        title: "SARS-CoV-2/Influenza A/B multiplex Real-TM",
        description: `რეალურ დროში PCR ნაკრები SARS-CoV-2 (COVID-19)/Influenza A/Influenza B რნმ-ის მულტიპლექსური გამოვლენისა და დიფერენციაციისთვის კლინიკურ ნიმუშებში`,
        code: "V440-100FRT",
        active: false,
        id: 9,
      },
    },
  },
];
const neurologicalInfections = [
  {
    title: "ენტეროვირუსი/პოლიოვირუსი",
    description:
      "ადამიანის ენტეროვირუსები არის ყველგან გავრცელებული ვირუსები, რომლებიც გადაეცემა ადამიანიდან ადამიანზე კუჭ-ნაწლავის ან ზედა სასუნთქი გზებიდან გამოყოფილ ვირუსთან პირდაპირი კონტაქტით. ენტეროვირუსები მიეკუთვნება Picornaviridae ვირუსების ოჯახს და ტრადიციულად იყოფა 5 ქვეგენერად მასპინძლის დიაპაზონში და პათოგენური პოტენციალის განსხვავებების საფუძველზე. თითოეული ქვეგვარი შეიცავს უამრავ უნიკალურ სეროტიპს, რომლებიც გამოირჩევიან სპეციფიური ანტისერებით ნეიტრალიზაციის საფუძველზე. ქვეგენერა მოიცავს პოლიოვირუსებს, კოქსაკის ვირუსებს (ჯგუფები A და B) და ექოვირუსები. ენტეროვირუსები იწვევენ ინფექციების ფართო სპექტრს. პოლიოვირუსი, პროტოტიპული ენტეროვირუსი, შეიძლება გამოიწვიოს სუბკლინიკური ან მსუბუქი დაავადება, ასეპტიური მენინგიტი ან პარალიზური პოლიომიელიტი, დაავადება, რომელიც აღმოიფხვრა შეერთებულ შტატებში და სხვა განვითარებულ ქვეყნებში. არაპოლიო ვირუსები (A და B ჯგუფის კოქსაკის ვირუსები, ექოვირუსები, ენტეროვირუსები) კვლავ პასუხისმგებელნი არიან დაავადებების ფართო სპექტრზე ყველა ასაკის ადამიანში, თუმცა ინფექცია და დაავადება ყველაზე ხშირად ჩვილებში გვხვდება.",
    reagents: {
      first_reagent: {
        title: "Enterovirus Real-TM",
        description: "რეალურ დროში PCR ტესტი ენტეროვირუსის გამოსავლენად",
        code: "V16-50FRT",
      },
      second_reagent: {
        title: "Enterovirus 71-Type Real-TM",
        description:
          "რეალურ დროში PCR ნაკრები ენტეროვირუსის გამოვლენისა და აკრეფისთვის",
        code: "V64-50FRT",
      },
      third_reagent: {
        title: "პოლიოვირუსი Real-TM",
        description:
          "რეალურ დროში PCR ნაკრები პოლიოვირუსის გამოვლენისა და აკრეფისთვის",
        code: "V58-50FRT",
      },
      active: false,
      id: 1,
    },
  },
  {
    title: "მენინგიტი",
    description:
      "მენინგიტი არის კლინიკური სინდრომი, რომელიც ხასიათდება მენინგის ანთებით. კლინიკურად, ეს სამედიცინო მდგომარეობა ვლინდება მენინგეალური სიმპტომებით (მაგ. თავის ტკივილი, ნუკალური სიმტკიცე, ფოტოფობია) და ცერებროსპინალურ სითხეში (CSF) სისხლის თეთრი უჯრედების გაზრდილი რაოდენობა. სიმპტომების ხანგრძლივობიდან გამომდინარე, მენინგიტი შეიძლება დაიყოს მწვავე ან ქრონიკულად. მწვავე ბაქტერიული მენინგიტი აღნიშნავს ამ სინდრომის ბაქტერიულ მიზეზს. კონკრეტული ბაქტერიული გამომწვევიდან გამომდინარე, სინდრომს შეიძლება ეწოდოს, მაგალითად, Streptococcus pneumoniae მენინგიტი, Neisseria მენინგიტი ან Haemophilus influenzae მენინგიტი.",
    reagents: {
      first_reagent: {
        title: "NHS Meningitidis Real-TM",
        description:
          "რეალურ დროში PCR ტესტი N.meningitidis, H.influenzae, St.pneumoniae-ის გამოვლენისთვის",
        code: "B25-50FRT",
      },
      second_reagent: {
        title: "Lysteria monocytogenes Real-TM Quant",
        description:
          "რეალურ დროში PCR ნაკრები L.monocytogenes რაოდენობრივი გამოვლენისთვის",
        code: "B14-50FRT",
      },
      third_reagent: {
        title: "JCV/BKV Virus Real-TM რაოდენობა",
        description:
          "რეალურ დროში PCR ტესტი JC ვირუსისა და BK ვირუსის რაოდენობრივი გამოვლენისთვის",
        code: "V71-100FRT",
      },
      active: false,
      id: 2,
    },
  },
  {
    title: "პოლიომავირუსები (JCV და BKV)",
    description:
      "JC ვირუსი და BK ვირუსი არის ყველაზე მნიშვნელოვანი პოლიომავირუსები, რომლებიც იწვევენ შესაბამისად მულტიფოკალურ ლეიკოენცეფალოპათიას და ნეფროპათიას იმუნოკომპრომეტირებულ პაციენტებში.",
    reagents: {
      title: "JCV/BKV Virus Real-TM რაოდენობა",
      description:
        "რეალურ დროში PCR ნაკრები JCV/BKV ვირუსის რაოდენობრივი გამოვლენისთვის",
      code: "V71-100FRT",
      active: false,
      id: 3,
    },
  },
];
const dangerousInfections = [
  {
    title: "Borrelia burgdorferi",
    reagents: {
      title: "Borrelia burgdorferi sensu lat Real-TM",
      description:
        "რეალურ დროში PCR ტესტი Borrelia burgdorferi-ის გამოსავლენად",
      code: "B37-50FRT",
      active: false,
      id: 1,
    },
  },
  {
    title: "ბრუცელა",
    description:
      "ბრუცელოზი არის მსოფლიოში გავრცელებული ზოონოზი, რომელიც გამოწვეულია ბაქტერიული გვარის ბრუცელას ინფექციით. ეს ორგანიზმები, რომლებიც წარმოადგენენ პატარა აერობული უჯრედშიდა კოკობაცილებს, ლოკალიზებულია მასპინძელი ცხოველების რეპროდუქციულ ორგანოებში, რაც იწვევს აბორტს და უნაყოფობას. ისინი დიდი რაოდენობით გამოიყოფა ცხოველის შარდში, რძეში, პლაცენტურ სითხეში და სხვა სითხეებში. ინფიცირებულ ცხოველებთან და ცხოველურ პროდუქტებთან კონტაქტი იწვევს ბრუცელოზს ადამიანებში. ადამიანის ბრუცელოზის გლობალური ტვირთი რჩება უზარმაზარი; ის წელიწადში 500 000-ზე მეტ ინფექციას იწვევს მთელ მსოფლიოში. ბრუცელას 4 სახეობას შორის, რომელიც ცნობილია, რომ იწვევს დაავადებას ადამიანებში (B. abortus, B. melitensis, B. canis, B. suis), B. melitensis ითვლება ყველაზე ვირუსული და იწვევს ბრუცელოზის ყველაზე მძიმე და მწვავე შემთხვევებს.",
    reagents: {
      title: "Brucella Real-TM",
      description:
        "რეალურ დროში გამაძლიერებელი ნაკრების ტესტი ბრუცელას სახეობების ხარისხობრივი გამოვლენისთვის (B. melitensis, B. abortus, B. suis, B. ovis, B. canis)",
      code: "B10-50FRT",
      active: false,
      id: 2,
    },
  },
  {
    title: "Bacillus anthracis",
    description:
      "Bacillus anthracis არის გრამდადებითი სპორის წარმომქმნელი, ღეროს ფორმის ბაქტერია, რომლის სიგანეა 1-1,2 მკმ და სიგრძე 3-5 მკმ. ჯილეხი აღწერილი იყო ბერძნების, რომაელებისა და ინდუსების ადრეულ ლიტერატურაში. ჯილეხის დაავადების სამი ფორმა აღიარებულია მათი ინოკულაციის ფორმის მიხედვით: კანის - ყველაზე გავრცელებული ფორმა (95%), იწვევს ლოკალიზებულ ანთებით შავ ნეკროზულ დაზიანებას (ესკარი), ფილტვის - უაღრესად ფატალური და ხასიათდება უეცარი მასიური გულმკერდის შეშუპებით, რასაც მოჰყვება გულ-სისხლძარღვთა. შოკი, კუჭ-ნაწლავის - იშვიათი, მაგრამ ასევე ფატალური (იწვევს სიკვდილს 25%) ტიპის სპორების შეწოვის შედეგად.",
    reagents: {
      title: "Bacillus anthracis Real-TM",
      description: "რეალურ დროში PCR ტესტი Bacillus anthracis-ის გამოსავლენად",
      code: "B101-50FRT",
      active: false,
      id: 3,
    },
  },
  {
    title: "ვიბრიო ქოლერა",
    description:
      "ქოლერას იწვევს Vibrio cholerae, ყველაზე საშიში ეპიდემიური დიარეული დაავადება მისი სიმძიმის გამო. დეჰიდრატაცია და სიკვდილი შეიძლება მოხდეს ინფექციიდან რამდენიმე საათში. რობერტ კოხმა აღმოაჩინა V ქოლერა 1883 წელს ეგვიპტეში გავრცელების დროს. ორგანიზმი არის მძიმის ფორმის, გრამუარყოფითი აერობული ბაცილი, რომლის ზომა მერყეობს 1-3 მკმ სიგრძით 0,5-0,8 მკმ დიამეტრით. მისი ანტიგენური სტრუქტურა შედგება flagellar H ანტიგენისა და სომატური O ანტიგენისგან.",
    reagents: {
      title: "Vibrio cholerae Real-TM",
      description:
        "რეალურ დროში გამაძლიერებელი ნაკრების ტესტი პათოგენის Vibrio cholerae შტამების ხარისხობრივი გამოვლენისა და იდენტიფიკაციისთვის",
      code: "B53-50FRT",
      active: false,
      id: 4,
    },
  },
  {
    title: "ლეპტოსპირა",
    description:
      "ლეპტოსპიროზი არის მსოფლიოში გავრცელებული ზოონოზი, რომელიც გამოწვეულია ლეპტოსპირების გვარის პათოგენური სახეობებით. შემთხვევათა 90%-ში ლეპტოსპიროზი ვლინდება მწვავე ფებრილური დაავადების სახით ორფაზიანი მიმდინარეობით და შესანიშნავი პროგნოზით. ლეპტოსპიროზის არასპეციფიკური ნიშნები და სიმპტომები (მაგ., ცხელება, თავის ტკივილი, გულისრევა, ღებინება) ხშირად აირია ვირუსულ დაავადებასთან. შემთხვევათა 10%-ში პრეზენტაცია უფრო დრამატულია და ინფექციას აქვს სიკვდილიანობის მაჩვენებელი 10%. ცნობილი როგორც ვეილის დაავადება ან იქტერული ლეპტოსპიროზი, ლეპტოსპიროზის ამ ფორმის კლასიკური განმარტება მოიცავს ცხელებას, სიყვითლეს, თირკმლის უკმარისობას და სისხლდენას. სხვა ორგანოთა სისტემა (მაგ., ფილტვის სისტემა, გულის სისტემა, ცნს) ასევე ხშირად არის ჩართული.",
    reagents: {
      title: "Leptospira 16s RNA Real-TM",
      description: "რეალურ დროში PCR ტესტი ლეპტოსპირას გამოსავლენად",
      code: "B49-50FRT",
      active: false,
      id: 5,
    },
  },
  {
    title: "დასავლეთ ნილოსის ვირუსი",
    description:
      "დასავლეთ ნილოსის ვირუსი არის ფლავივირუსის გვარის ერთ-ერთი მრავალი წარმომადგენელი, რომელიც ცნობილია ადამიანის დაავადებების გამომწვევი. დასავლეთ ნილოსის ვირუსის სასიცოცხლო ციკლი მოიცავს მიკრობის გადაცემას არაადამიანური ცხოველებიდან ადამიანებზე Aedes, Culex ან Anopheles კოღოების საშუალებით. დასავლეთ ნილოსის ვირუსს შეუძლია დააინფიციროს ცხენები, ფრინველები, ძაღლები და სხვა ძუძუმწოვრები. თუმცა, გარეული ფრინველები, როგორც ჩანს, ოპტიმალური მასპინძლები არიან ვირუსის შესანახად და გასამრავლებლად. დასავლეთ ნილოსის ვირუსი იწვევს სერიოზულ გამოვლინებებს ინფიცირებულთა დაახლოებით 1%-ში, ავადობისა და სიკვდილიანობის გაზრდით 50 წელზე უფროსი ასაკის პირებში. ჰოსპიტალიზირებულ პაციენტებში დასავლეთ ნილოსის ვირუსის ნევროლოგიური შედეგები მოიცავდა კუნთების ძლიერ სისუსტეს, პაციენტთა დაახლოებით 10%-ს განუვითარდა სრული მბზინავი დამბლა. დასავლეთ ნილოსის ვირუსით ინფიცირებიდან 150-დან ერთი იწვევს ენცეფალიტს ან მენინგიტს, ხოლო მძიმე დაავადებით სიკვდილიანობის მაჩვენებელი 3-15%-ია.",
    reagents: {
      title: "West Nile Virus Real-TM",
      description: "რეალურ დროში PCR ტესტი WNV-ის გამოსავლენად",
      code: "V53-50FRT",
      active: false,
      id: 6,
    },
  },
  {
    title: "Coxiella burnetii",
    description:
      "Q ცხელება არის ზოონოზი, რომელიც გამოწვეულია Coxiella burnetii-ით, სავალდებულო გრამუარყოფითი უჯრედშიდა ბაქტერიით. ყველაზე ხშირად სამხრეთ საფრანგეთსა და ავსტრალიაში, Q ცხელება გვხვდება მთელ მსოფლიოში. C. burnetii აინფიცირებს სხვადასხვა მასპინძლებს, მათ შორის ადამიანებს, მომცროებს (მსხვილფეხა რქოსანი პირუტყვი, ცხვარი, თხა) და შინაური ცხოველები. იშვიათ შემთხვევებში დაფიქსირდა C. burnetii ინფექცია ქვეწარმავლებში, ფრინველებში და ტკიპებში. C. burnetii გამოიყოფა შარდში, რძეში, განავალში და დაბადების პროდუქტებში. ეს პროდუქტები, განსაკუთრებით ეს უკანასკნელი, შეიცავს დიდი რაოდენობით ბაქტერიებს, რომლებიც გაშრობის შემდეგ ხდება აეროზოლური. ბაქტერია ძალიან ინფექციურია და მხოლოდ რამდენიმე ორგანიზმს შეუძლია დაავადების გამოწვევა.",
    reagents: {
      title: "Coxiella burnetii Real-TM",
      description: "რეალურ დროში გამაძლიერებელი ნაკრები",
      code: "B85-50FRT",
      active: false,
      id: 7,
    },
  },
  {
    title: "ტკიპებით გამოწვეული ენცეფალიტი",
    description:
      "ტკიპები არის arachnids, ნათესავები ობობები, რომლებიც ჩვეულებრივ ცხოვრობენ ტყის ადგილებში, ფუნჯიან მინდვრებში. ისინი გადარჩებიან მასპინძლის სისხლით ჭამით და შეუძლიათ ინფექციების გადატანა ერთი მასპინძლიდან მეორეზე, მათ შორის ადამიანებზე. გავრცელებული ტკიპებით გამოწვეული დაავადებებია: ტკიპებით გამოწვეული ენცეფალიტი (TBE), ანაპლაზმოზი, ერლიქიოზი.",
    reagents: {
      title:
        "TBEV, B.burgdorferi, A.phagocytophilum, E.chaffeensis / E.muris Real-TM",
      description:
        "რეალურ დროში PCR ნაკრები ტკიპებით გამოწვეული დაავადებების გამოსავლენად",
      code: "V59-100FRT",
      active: false,
      id: 8,
    },
  },
  {
    title: "კონგოს ყირიმის ვირუსი",
    description:
      "კონგო-ყირიმის ჰემორაგიული ცხელება არის გავრცელებული ტკიპებით გამოწვეული ვირუსული დაავადება, ცხოველთა ზოონოზი, რომელიც შეიძლება გავლენა იქონიოს ადამიანებზე. პათოგენური ვირუსი, რომელიც ჩვეულებრივ გვხვდება აღმოსავლეთ და დასავლეთ აფრიკაში, არის Bunyaviridae რნმ ვირუსების ოჯახის წევრი. კლინიკური დაავადება იშვიათია ინფიცირებულ ძუძუმწოვრებში, მაგრამ ხშირად მძიმეა ინფიცირებულ ადამიანებში, 30%-იანი სიკვდილიანობით.",
    reagents: {
      title: "კონგო ყირიმი Real-TM",
      description: "რეალურ დროში PCR ტესტი კონგოს ყირიმის ვირუსის გამოსავლენად",
      code: "V22-50FRT",
      active: false,
      id: 9,
    },
  },
  {
    title: "დენგეს ვირუსი",
    description:
      "დენგე არის ერთ-ერთი ყველაზე მნიშვნელოვანი ართროპოდის მიერ გადამდები ვირუსული დაავადება დიდი გლობალური ტვირთით. The დაავადება გამოწვეულია დენგეს ვირუსით (DENV), Flaviviridae ოჯახის წევრით, ოთხი განსხვავებული სეროტიპები (DENV-1, -2, -3 და -4), რომლებიც ცირკულირებენ მსოფლიოს ტროპიკულ და სუბტროპიკულ რეგიონებში. DENV ადამიანზე გადადის Aedes-ის კოღოებით, როგორც ვექტორი. დენგეს კლინიკური გამოვლინებები განსხვავდება ასიმპტომური ან მსუბუქი გრიპის მსგავსი სინდრომიდან, რომელიც ცნობილია როგორც კლასიკური დენგეს ცხელება (DF) მძიმე ფორმა, რომელიც ცნობილია როგორც დენგეს ჰემორაგიული ცხელება (DHF) და პოტენციურად ფატალური დენგეს შოკი სინდრომი (DSS). სხვა რნმ ვირუსების მსგავსად, DENV-ს გააჩნია მრავალფეროვანი გენეტიკური მახასიათებლები, როგორც ნაჩვენებია სხვადასხვა გენოტიპების არსებობით სეროტიპებში.",
    reagents: {
      first_reagent: {
        title: "Dengue Real-TM",
        description: "რეალურ დროში PCR ნაკრები დენგეს ვირუსის გამოსავლენად",
        code: "V63-S-50FRT",
      },
      second_reagent: {
        title: "დენგეს გენოტიპი Real-TM",
        description:
          "რეალურ დროში PCR ნაკრები დენგეს 1, 2, 3, 4 გამოვლენისა და დიფერენციაციისთვის",
        code: "V63-50FRT",
      },
      active: false,
      id: 11,
    },
  },
  {
    title: "ებოლას ვირუსი",
    description:
      "ებოლას ვირუსი (EBOV, ადრე სახელწოდებით Zaire ebolavirus) არის ზაირის ებოლავირუსის სახეობის ერთადერთი წევრი და ყველაზე საშიში ხუთი ცნობილი ვირუსიდან Ebolavirus-ის გვარში.",
    reagents: {
      title: "Ebola Zaire Real-TM",
      description: "რეალურ დროში PCR ტესტი ებოლას ვირუსის გამოსავლენად",
      code: "V69-50FRT",
      active: false,
      id: 12,
    },
  },
  {
    title: "Yersinia pestis",
    description:
      "Yersinia pestis არის გრამუარყოფითი ღეროს ფორმის ბაქტერია. ეს არის ფაკულტატური ანაერობი, რომელსაც შეუძლია დააინფიციროს ადამიანები და სხვა ცხოველები. მრავალი მტკიცებულება ვარაუდობს, რომ ეს იყო მრავალი ჭირის ხელშემწყობი ფაქტორი კაცობრიობის ისტორიის მანძილზე. წყალსაცავი, რომელიც ჩვეულებრივ ასოცირდება Y. pestis-თან არის მღრღნელების რამდენიმე სახეობა (მარმოტა, ვირთხები).",
    reagents: {
      title: "Yersinia pestis Real-TM",
      description: "რეალურ დროში PCR ნაკრები",
      code: "B79-50FRT",
      active: false,
      id: 13,
    },
  },
  {
    title: "Ზიკას ვირუსი",
    description:
      "ზიკა ვირუსი (ZIKV) არის Flaviviridae-ის ოჯახისა და ფლავივირუსების გვარის წარმომადგენელი. ის ვრცელდება დღისით აქტიური Aedes კოღოებით, როგორიცაა A. aegypti და A. albopictus. მისი სახელი მომდინარეობს უგანდაში ზიკას ტყიდან, სადაც ვირუსი პირველად იზოლირებული იქნა 1947 წელს.",
    reagents: {
      title: "Zika Virus Real-TM",
      description: "რეალურ დროში PCR ტესტი ზიკას ვირუსის გამოსავლენად",
      code: "V73-50FRT",
      active: false,
      id: 14,
    },
  },
  {
    title: "Corynebacterium diphtheriae",
    reagents: {
      title: "Corinebacterium diphtheriae/tox-genes Real-TM",
      description:
        "რეალურ დროში PCR ნაკრები Corinebacterium diphteriae-ის გამოვლენისთვის",
      code: "B2842-100FRT",
      active: false,
      id: 16,
    },
  },
  {
    title: "Rickettsia conorii",
    reagents: {
      title: "Rickettsia conorii Real-TM",
      description:
        "რეალურ დროში PCR ნაკრები Rickettsia conorii-ის გამოვლენისთვის",
      code: "H2741-50FRT",
      active: false,
      id: 17,
    },
  },
];
const intenstinalInfections = [
  {
    title: "Helicobacter Pylori",
    description:
      "Helicobacter pylori არის გრამუარყოფითი ბაცილი, რომელიც პასუხისმგებელია ადამიანებში მსოფლიოში ერთ-ერთ ყველაზე გავრცელებულ ინფექციაზე. H. pylori ორგანიზმები არიან სპირალური ფორმის გრამუარყოფითი ბაქტერიები, რომლებიც ძალიან მოძრავია მრავლობითი ცალმხრივი დროშების გამო. H pylori ბინადრობს კუჭის ლორწოვანი გარსის მიმდებარე ლორწოვანში. ციტოტოქსინთან ასოცირებული ანტიგენი (CagA) ალბათ ყველაზე მნიშვნელოვანი ვირულენტური ფაქტორია H pylori-ში. CagA ცილის გადატანა კუჭის ეპითელურ უჯრედებში იწვევს მასპინძლის ციტოჩონჩხის გადაკეთებას და ცვლის უჯრედის სიგნალიზაციას და არღვევს უჯრედული ციკლის კონტროლს. გარდა ამისა, ცნობილია, რომ CagA-დადებითი შტამები იწვევენ დნმ-ის რედაქტირების ფერმენტის ექსპრესიას, რაც იწვევს სიმსივნის სუპრესორ p53 H. pylori-ში მუტაციების დაგროვებას, რომელიც მჭიდროდ არის დაკავშირებული ანტრალურ გასტრიტთან (კუჭის და თორმეტგოჯა ნაწლავის წყლული მოზრდილებში და ბავშვებში. ) და ავთვისებიანი სიმსივნე, კონკრეტულად კუჭის ლიმფომა და ადენოკარცინომა. H. pylori ასოცირდება რკინადეფიციტურ ანემიასთან. 2 ძირითადი ჰიპოთეზა, რომელიც პოტენციურად ხსნის ამ ურთიერთობას, არის (1) რკინის სეკვესტრი ანტრალური H pylori ინფექციის გამო და (2) ჰიპოქლორჰიდრიით გამოწვეული არაჰემური რკინის შეწოვის დაქვეითება.",
    reagents: {
      title: "Helicobacter pylori Real-TM",
      description:
        "რეალურ დროში გამაძლიერებელი ნაკრების ტესტი თვისებრივი გამოვლენისთვის jf Helicobacter pylori",
      code: "B9-50FRT",
      active: false,
      id: 1,
    },
  },
  {
    title: "კვების პათოგენები",
    reagents: {
      first_reagent: {
        title: "Cronobacter sakazakii Real-TM",
        description:
          "რეალურ დროში გამაძლიერებელი ნაკრების ტესტი Cronobacter sakazakii-ის გამოვლენისთვის",
        code: "B58-50FRT",
      },
      second_reagent: {
        title: "Shigella Spp & EIEC Real-TM",
        description:
          "რეალურ დროში გამაძლიერებელი ნაკრების ტესტი Shigella spp-ისა და Enteroinvasive E.Coli (EIEC) ხარისხობრივი გამოვლენისთვის",
        code: "B12-50FRT",
      },
      active: false,
      id: 2,
    },
  },
  {
    title: "Multiplex PCR კომპლექტები",
    reagents: {
      first_reagent: {
        title: "როტავირუსი/ნოროვირუსი/ასტროვირუსი Real-TM",
        description:
          "რეალურ დროში PCR ნაკრები როტავირუსის A, ნოროვირუსის 2 გენოტიპის, ასტროვირუსის ხარისხობრივი გამოვლენისთვის",
        code: "V40-50FRT",
      },
      second_reagent: {
        title: "Shigella/Salmonella/Campylobacter Real-TM",
        description:
          "რეალურ დროში PCR ნაკრები Shigella spp-ისა და Enteroinvasive E.Coli (EIEC)/ Salmonella spp/Campylobacter spp-ის გამოვლენისა და დიფერენციაციისთვის",
        code: "B44-50FRT",
      },
      third_reagent: {
        title: "A.I.I. ეკრანი Real-TM",
        description:
          "რეალურ დროში გამაძლიერებელი ნაკრების ტესტი Shigella Spp-ის ხარისხობრივი გამოვლენისა და დიფერენცირებისთვის. E.coli, Salmonella spp., Campylobacter spp., ადენოვირუსი F, როტავირუსი A, ნოროვირუსი 2 გენოტიპი, ასტროვირუსი",
        code: "B45-50FRT",
      },
      fourth_reagent: {
        title: "Escherichioses Screen & Diff Real-TM",
        description:
          "რეალურ დროში PCR კომპლექტი დიარეგენის ხარისხობრივი გამოვლენისა და დიფერენციაციისთვის E.coli (EPEC, ETEC, EIEC, EHEC და EAgEC)",
        code: "B62-50FRT",
      },
      fifth_reagent: {
        title: "Yersinia enterocolitica/Y.ფსევდოტუბერკულოზი Real-TM",
        description:
          "რეალურ დროში ამპლიფიკაციის ტესტი ვირულენტური და არავირუსული Yersinia enterocolitica შტამების და Yersinia pseudotuberculosis შტამების ხარისხობრივი გამოვლენისა და დიფერენცირებისთვის",
        code: "B64-50FRT",
      },
      sixth_reagent: {
        title: "აერობული კომპლექსი Real-TM Quant",
        description:
          "რეალურ დროში ამპლიფიკაციის ტესტი ენტერობაქტერიების რაოდენობრივი გამოვლენისა და დიფერენციაციისთვის (E. coli, Klebsiella spp., Proteus spp., Streptococcus spp.)",
        code: "B88-100FRT",
      },
    },
  },
];
const molecularGenetics = [
  {
    title: "მოლეკულური გენეტიკა",
    description:
      "მოლეკულური გენეტიკა (MG) არის ორგანიზმის გენომის მანიპულირება. ფერმის კარიბჭის გარეთ, MG გამოიყენებოდა მორგებული ბაქტერიული კულტურების შესაქმნელად. MG რძის ცხოველებში იწვევს ტრანსგენურ ცხოველებს ახალი თვისებებით, რომლებიც ვერ მიიღწევა სტანდარტული მეცხოველეობის სტრატეგიებით. ფერმის კარიბჭის შიგნით, MG-ს აქვს როლი ცხოველთა მოშენებაში . MG გამოიყენება გამომწვევი მუტაციების ან დაკავშირებული გენეტიკური მარკერების იდენტიფიცირებისთვის, რომლებიც განაპირობებენ განსხვავებებს ფენოტიპებში (ანუ ცხოველის მოქმედება). ამ მიდგომის საბოლოო მიზანია კომერციულ პოპულაციაში უმაღლესი გენეტიკა ეფექტურად და ეფექტურად გავრცელდეს.",
  },
];
const virusData = store.state.virusData;
const { title, description } = virusData;
onMounted(() => {
  console.log(virusData, `title:${title}`);
});
</script>

<template>
  <Header />
  <main>
    <div class="virus_header">
      <h1>რეაგენტების ჩამონათვალი</h1>
    </div>
    <div class="virus_description">
      <h1>{{ title }}</h1>
      <p>{{ description }}</p>
    </div>
    <div class="virus_wrapper">
      <div v-if="title == 'ჰეპატიტის ვირუსები'">
        <template v-for="hepatitis in hepatitisViruses">
          <div class="virus_type">
            <h1>{{ hepatitis.title }}</h1>
            <p>{{ hepatitis.description }}</p>
          </div>
          <div
            class="toggle_reagent"
            @click="toggleHepatitis(hepatitis.reagents)"
          >
            <p>რეაგენტები</p>
            <img
              v-if="hepatitisToggled"
              src="@/assets/arrow-up.png"
              alt="arrow-up"
            />
            <img
              v-if="!hepatitisToggled"
              src="@/assets/arrow-down.png"
              alt=""
            />
          </div>
          <div class="virus_reagent" v-if="hepatitis.reagents.active">
            <div class="reagent_container">
              <h2>დასახელება</h2>
              <p class="reagent_title" v-if="hepatitis.reagents.title">
                {{ hepatitis.reagents.title }}
              </p>
              <p class="reagent_title" v-if="hepatitis.reagents.first_reagent">
                {{ hepatitis.reagents.first_reagent.title }}
              </p>
              <p class="reagent_title" v-if="hepatitis.reagents.second_reagent">
                {{ hepatitis.reagents.second_reagent.title }}
              </p>
              <p class="reagent_title" v-if="hepatitis.reagents.third_reagent">
                {{ hepatitis.reagents.third_reagent.title }}
              </p>
              <p class="reagent_title" v-if="hepatitis.reagents.fourth_reagent">
                {{ hepatitis.reagents.fourth_reagent.title }}
              </p>
            </div>
            <div class="reagent_container">
              <h2>აღწერა</h2>
              <p
                class="reagent_description"
                v-if="hepatitis.reagents.description"
              >
                {{ hepatitis.reagents.description }}
              </p>
              <p
                class="reagent_description"
                v-if="hepatitis.reagents.first_reagent"
              >
                {{ hepatitis.reagents.first_reagent.description }}
              </p>
              <p
                class="reagent_description"
                v-if="hepatitis.reagents.second_reagent"
              >
                {{ hepatitis.reagents.second_reagent.description }}
              </p>
              <p
                class="reagent_description"
                v-if="hepatitis.reagents.third_reagent"
              >
                {{ hepatitis.reagents.third_reagent.description }}
              </p>
              <p
                class="reagent_description"
                v-if="hepatitis.reagents.fourth_reagent"
              >
                {{ hepatitis.reagents.fourth_reagent.description }}
              </p>
            </div>
            <div class="reagent_container">
              <h2>კოდი</h2>
              <a
                :href="`https://sacace.com/hepatitis-viruses-hcv-rna.htm#s${hepatitis.reagents.id}`"
                target="_blank"
                class="reagent_code"
                v-if="hepatitis.reagents.code"
                >{{ hepatitis.reagents.code }}</a
              >
              <a
                :href="`https://sacace.com/hepatitis-viruses-hcv-rna.htm#s${hepatitis.reagents.id}`"
                target="_blank"
                class="reagent_code"
                v-if="hepatitis.reagents.first_reagent"
                >{{ hepatitis.reagents.first_reagent.code }}</a
              >
              <a
                class="reagent_code"
                v-if="hepatitis.reagents.second_reagent"
                :href="`https://sacace.com/hepatitis-viruses-hcv-rna.htm#s${hepatitis.reagents.id}`"
                target="_blank"
                >{{ hepatitis.reagents.second_reagent.code }}</a
              >
              <a
                :href="`https://sacace.com/hepatitis-viruses-hcv-rna.htm#s${hepatitis.reagents.id}`"
                target="_blank"
                class="reagent_code"
                v-if="hepatitis.reagents.third_reagent"
                >{{ hepatitis.reagents.third_reagent.code }}</a
              >
              <a
                :href="`https://sacace.com/hepatitis-viruses-hcv-rna.htm#s${hepatitis.reagents.id}`"
                target="_blank"
                class="reagent_code"
                v-if="hepatitis.reagents.fourth_reagent"
                >{{ hepatitis.reagents.fourth_reagent.code }}</a
              >
            </div>
          </div>
        </template>
      </div>
      <div v-if="title == 'ადამიანის იმუნოდეფიციტის ვირუსი'">
        <template v-for="hiv in hivViruses">
          <div class="virus_type">
            <h1>{{ hiv.title }}</h1>
            <p>{{ hiv.description }}</p>
            <div class="toggle_reagent" @click="toggleHIV(hiv.reagents)">
              <p>რეაგენტები</p>
              <img
                v-if="hivToggled"
                src="@/assets/arrow-up.png"
                alt="arrow-up"
              />
              <img v-if="!hivToggled" src="@/assets/arrow-down.png" alt="" />
            </div>
            <div class="virus_reagent" v-if="hiv.reagents.active">
              <div class="reagent_container">
                <h2>დასახელება</h2>
                <p class="reagent_title" v-if="hiv.reagents.title">
                  {{ hiv.reagents.title }}
                </p>
                <p class="reagent_title" v-if="hiv.reagents.first_reagent">
                  {{ hiv.reagents.first_reagent.title }}
                </p>
                <p class="reagent_title" v-if="hiv.reagents.second_reagent">
                  {{ hiv.reagents.second_reagent.title }}
                </p>
                <p class="reagent_title" v-if="hiv.reagents.third_reagent">
                  {{ hiv.reagents.third_reagent.title }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>აღწერა</h2>
                <p class="reagent_description" v-if="hiv.reagents.description">
                  {{ hiv.reagents.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="hiv.reagents.first_reagent"
                >
                  {{ hiv.reagents.first_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="hiv.reagents.second_reagent"
                >
                  {{ hiv.reagents.second_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="hiv.reagents.third_reagent"
                >
                  {{ hiv.reagents.third_reagent.description }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>კოდი</h2>
                <a
                  :href="`https://sacace.com/human-immunodeficiency-virus.htm#s${hiv.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="hiv.reagents.code"
                  >{{ hiv.reagents.code }}</a
                >
                <a
                  :href="`https://sacace.com/human-immunodeficiency-virus.htm#s${hiv.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="hiv.reagents.first_reagent"
                  >{{ hiv.reagents.first_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="hiv.reagents.second_reagent"
                  :href="`https://sacace.com/human-immunodeficiency-virus.htm#s${hiv.reagents.id}`"
                  target="_blank"
                  >{{ hiv.reagents.second_reagent.code }}</a
                >
                <a
                  :href="`https://sacace.com/human-immunodeficiency-virus.htm#s${hiv.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="hiv.reagents.third_reagent"
                  >{{ hiv.reagents.third_reagent.code }}</a
                >
              </div>
            </div>
          </div>
        </template>
      </div>
      <div v-if="title == 'ადამიანის პაპილომა ვირუსები'">
        <template v-for="hpv in hpvViruses">
          <div class="virus_type">
            <h1>{{ hpv.title }}</h1>
            <p>{{ hpv.description }}</p>
            <div class="toggle_reagent" @click="toggleHPV(hpv.reagents)">
              <p>რეაგენტები</p>
              <img
                v-if="hpvToggled"
                src="@/assets/arrow-up.png"
                alt="arrow-up"
              />
              <img v-if="!hpvToggled" src="@/assets/arrow-down.png" alt="" />
            </div>
            <div class="virus_reagent" v-if="hpv.reagents.active">
              <div class="reagent_container">
                <h2>დასახელება</h2>
                <p class="reagent_title" v-if="hpv.reagents.title">
                  {{ hpv.reagents.title }}
                </p>
                <p class="reagent_title" v-if="hpv.reagents.first_reagent">
                  {{ hpv.reagents.first_reagent.title }}
                </p>
                <p class="reagent_title" v-if="hpv.reagents.second_reagent">
                  {{ hpv.reagents.second_reagent.title }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>აღწერა</h2>
                <p class="reagent_description" v-if="hpv.reagents.description">
                  {{ hpv.reagents.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="hpv.reagents.first_reagent"
                >
                  {{ hpv.reagents.first_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="hpv.reagents.second_reagent"
                >
                  {{ hpv.reagents.second_reagent.description }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>კოდი</h2>
                <a
                  :href="`https://sacace.com/human-papilloma-virus.htm#s${hpv.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="hpv.reagents.code"
                  >{{ hpv.reagents.code }}</a
                >
                <a
                  :href="`https://sacace.com/human-papilloma-virus.htm#s${hpv.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="hpv.reagents.first_reagent"
                  >{{ hpv.reagents.first_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="hpv.reagents.second_reagent"
                  :href="`https://sacace.com/human-papilloma-virus.htm#s${hpv.reagents.id}`"
                  target="_blank"
                  >{{ hpv.reagents.second_reagent.code }}</a
                >
              </div>
            </div>
          </div>
        </template>
      </div>
      <div v-if="title == 'სქესობრივი გზით გადამდები დაავადებები'">
        <template v-for="std in stdViruses">
          <div class="virus_type">
            <h1>{{ std.title }}</h1>
            <p>{{ std.description }}</p>
            <div class="toggle_reagent" @click="toggleSTD(std.reagents)">
              <p>რეაგენტები</p>
              <img
                v-if="stdToggled"
                src="@/assets/arrow-up.png"
                alt="arrow-up"
              />
              <img v-if="!stdToggled" src="@/assets/arrow-down.png" alt="" />
            </div>
            <div class="virus_reagent" v-if="std.reagents.active">
              <div class="reagent_container">
                <h2>დასახელება</h2>
                <p class="reagent_title" v-if="std.reagents.title">
                  {{ std.reagents.title }}
                </p>
                <p class="reagent_title" v-if="std.reagents.first_reagent">
                  {{ std.reagents.first_reagent.title }}
                </p>
                <p class="reagent_title" v-if="std.reagents.second_reagent">
                  {{ std.reagents.second_reagent.title }}
                </p>
                <p class="reagent_title" v-if="std.reagents.third_reagent">
                  {{ std.reagents.third_reagent.title }}
                </p>
                <p class="reagent_title" v-if="std.reagents.fourth_reagent">
                  {{ std.reagents.fourth_reagent.title }}
                </p>
                <p class="reagent_title" v-if="std.reagents.fifth_reagent">
                  {{ std.reagents.fifth_reagent.title }}
                </p>
                <p class="reagent_title" v-if="std.reagents.sixth_reagent">
                  {{ std.reagents.sixth_reagent.title }}
                </p>
                <p class="reagent_title" v-if="std.reagents.seventh_reagent">
                  {{ std.reagents.seventh_reagent.title }}
                </p>
                <p class="reagent_title" v-if="std.reagents.eighth_reagent">
                  {{ std.reagents.eighth_reagent.title }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>აღწერა</h2>
                <p class="reagent_description" v-if="std.reagents.description">
                  {{ std.reagents.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="std.reagents.first_reagent"
                >
                  {{ std.reagents.first_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="std.reagents.second_reagent"
                >
                  {{ std.reagents.second_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="std.reagents.third_reagent"
                >
                  {{ std.reagents.third_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="std.reagents.fourth_reagent"
                >
                  {{ std.reagents.fourth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="std.reagents.fifth_reagent"
                >
                  {{ std.reagents.fifth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="std.reagents.sixth_reagent"
                >
                  {{ std.reagents.sixth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="std.reagents.seventh_reagent"
                >
                  {{ std.reagents.seventh_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="std.reagents.eighth_reagent"
                >
                  {{ std.reagents.eighth_reagent.description }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>კოდი</h2>
                <a
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${std.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="std.reagents.code"
                  >{{ std.reagents.code }}</a
                >
                <a
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${std.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="std.reagents.first_reagent"
                  >{{ std.reagents.first_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="std.reagents.second_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${std.reagents.id}`"
                  target="_blank"
                  >{{ std.reagents.second_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="std.reagents.third_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${std.reagents.id}`"
                  target="_blank"
                  >{{ std.reagents.third_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="std.reagents.fourth_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${std.reagents.id}`"
                  target="_blank"
                  >{{ std.reagents.fourth_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="std.reagents.fifth_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${std.reagents.id}`"
                  target="_blank"
                  >{{ std.reagents.fifth_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="std.reagents.sixth_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${std.reagents.id}`"
                  target="_blank"
                  >{{ std.reagents.sixth_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="std.reagents.seventh_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${std.reagents.id}`"
                  target="_blank"
                  >{{ std.reagents.seventh_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="std.reagents.eighth_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${std.reagents.id}`"
                  target="_blank"
                  >{{ std.reagents.eighth_reagent.code }}</a
                >
              </div>
            </div>
          </div>
        </template>
      </div>
      <div v-if="title == 'ჰერპეს ვირუსებით გამოწვეული ინფექციები'">
        <template v-for="herpes in herpesViruses">
          <div class="virus_type">
            <h1>{{ herpes.title }}</h1>
            <p>{{ herpes.description }}</p>
            <div class="toggle_reagent" @click="toggleHerpes(herpes.reagents)">
              <p>რეაგენტები</p>
              <img
                v-if="herpesToggled"
                src="@/assets/arrow-up.png"
                alt="arrow-up"
              />
              <img v-if="!herpesToggled" src="@/assets/arrow-down.png" alt="" />
            </div>
            <div class="virus_reagent" v-if="herpes.reagents.active">
              <div class="reagent_container">
                <h2>დასახელება</h2>
                <p class="reagent_title" v-if="herpes.reagents.title">
                  {{ herpes.reagents.title }}
                </p>
                <p class="reagent_title" v-if="herpes.reagents.first_reagent">
                  {{ herpes.reagents.first_reagent.title }}
                </p>
                <p class="reagent_title" v-if="herpes.reagents.second_reagent">
                  {{ herpes.reagents.second_reagent.title }}
                </p>
                <p class="reagent_title" v-if="herpes.reagents.third_reagent">
                  {{ herpes.reagents.third_reagent.title }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>აღწერა</h2>
                <p
                  class="reagent_description"
                  v-if="herpes.reagents.description"
                >
                  {{ herpes.reagents.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="herpes.reagents.first_reagent"
                >
                  {{ herpes.reagents.first_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="herpes.reagents.second_reagent"
                >
                  {{ herpes.reagents.second_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="herpes.reagents.third_reagent"
                >
                  {{ herpes.reagents.third_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="herpes.reagents.fourth_reagent"
                >
                  {{ herpes.reagents.fourth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="herpes.reagents.fifth_reagent"
                >
                  {{ herpes.reagents.fifth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="herpes.reagents.sixth_reagent"
                >
                  {{ herpes.reagents.sixth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="herpes.reagents.seventh_reagent"
                >
                  {{ herpes.reagents.seventh_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="herpes.reagents.eighth_reagent"
                >
                  {{ herpes.reagents.eighth_reagent.description }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>კოდი</h2>
                <a
                  :href="`https://sacace.com/herpes-virus-infections.htm#s${herpes.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="herpes.reagents.code"
                  >{{ herpes.reagents.code }}</a
                >
                <a
                  :href="`https://sacace.com/herpes-virus-infections.htm#s${herpes.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="herpes.reagents.first_reagent"
                  >{{ herpes.reagents.first_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="herpes.reagents.second_reagent"
                  :href="`https://sacace.com/herpes-virus-infections.htm#s${herpes.reagents.id}`"
                  target="_blank"
                  >{{ herpes.reagents.second_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="herpes.reagents.third_reagent"
                  :href="`https://sacace.com/herpes-virus-infections.htm#s${herpes.reagents.id}`"
                  target="_blank"
                  >{{ herpes.reagents.third_reagent.code }}</a
                >
              </div>
            </div>
          </div>
        </template>
      </div>
      <div v-if="title == '„TORCH ინფექციები“'">
        <template v-for="torch in torchViruses">
          <div class="virus_type">
            <h1>{{ torch.title }}</h1>
            <p>{{ torch.description }}</p>
            <div class="toggle_reagent" @click="toggleTorch(torch.reagents)">
              <p>რეაგენტები</p>
              <img
                v-if="torchToggled"
                src="@/assets/arrow-up.png"
                alt="arrow-up"
              />
              <img v-if="!torchToggled" src="@/assets/arrow-down.png" alt="" />
            </div>
            <div class="virus_reagent" v-if="torch.reagents.active">
              <div class="reagent_container">
                <h2>დასახელება</h2>
                <p class="reagent_title" v-if="torch.reagents.title">
                  {{ torch.reagents.title }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>აღწერა</h2>
                <p
                  class="reagent_description"
                  v-if="torch.reagents.description"
                >
                  {{ torch.reagents.description }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>კოდი</h2>
                <a
                  :href="`https://sacace.com/torch-infections.htm#s${torch.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="torch.reagents.code"
                  >{{ torch.reagents.code }}</a
                >
              </div>
            </div>
          </div>
        </template>
      </div>
      <div v-if="title == 'სასუნთქი გზების ინფექციები'">
        <template v-for="respiratory in respiratoryInfection">
          <div class="virus_type">
            <h1>{{ respiratory.title }}</h1>
            <p>{{ respiratory.description }}</p>
            <div
              class="toggle_reagent"
              @click="toggleRespiratory(respiratory.reagents)"
            >
              <p>რეაგენტები</p>
              <img
                v-if="respiratoryToggled"
                src="@/assets/arrow-up.png"
                alt="arrow-up"
              />
              <img
                v-if="!respiratoryToggled"
                src="@/assets/arrow-down.png"
                alt=""
              />
            </div>
            <div class="virus_reagent" v-if="respiratory.reagents.active">
              <div class="reagent_container">
                <h2>დასახელება</h2>
                <p class="reagent_title" v-if="respiratory.reagents.title">
                  {{ respiratory.reagents.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="respiratory.reagents.first_reagent"
                >
                  {{ respiratory.reagents.first_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="respiratory.reagents.second_reagent"
                >
                  {{ respiratory.reagents.second_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="respiratory.reagents.third_reagent"
                >
                  {{ respiratory.reagents.third_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="respiratory.reagents.fourth_reagent"
                >
                  {{ respiratory.reagents.fourth_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="respiratory.reagents.fifth_reagent"
                >
                  {{ respiratory.reagents.fifth_reagent.title }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>აღწერა</h2>
                <p
                  class="reagent_description"
                  v-if="respiratory.reagents.description"
                >
                  {{ respiratory.reagents.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="respiratory.reagents.first_reagent"
                >
                  {{ respiratory.reagents.first_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="respiratory.reagents.second_reagent"
                >
                  {{ respiratory.reagents.second_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="respiratory.reagents.third_reagent"
                >
                  {{ respiratory.reagents.third_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="respiratory.reagents.fourth_reagent"
                >
                  {{ respiratory.reagents.fourth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="respiratory.reagents.fifth_reagent"
                >
                  {{ respiratory.reagents.fifth_reagent.description }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>კოდი</h2>
                <a
                  :href="`https://sacace.com/respiratory-infections.htm#s${respiratory.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="respiratory.reagents.code"
                  >{{ respiratory.reagents.code }}</a
                >
                <a
                  :href="`https://sacace.com/respiratory-infections.htm#s${respiratory.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="respiratory.reagents.first_reagent"
                >
                  {{ respiratory.reagents.first_reagent.code }}
                </a>
                <a
                  :href="`https://sacace.com/respiratory-infections.htm#s${respiratory.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="respiratory.reagents.second_reagent"
                >
                  {{ respiratory.reagents.second_reagent.code }}
                </a>
                <a
                  :href="`https://sacace.com/respiratory-infections.htm#s${respiratory.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="respiratory.reagents.third_reagent"
                >
                  {{ respiratory.reagents.third_reagent.code }}
                </a>
                <a
                  :href="`https://sacace.com/respiratory-infections.htm#s${respiratory.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="respiratory.reagents.fourth_reagent"
                >
                  {{ respiratory.reagents.fourth_reagent.code }}
                </a>
                <a
                  :href="`https://sacace.com/respiratory-infections.htm#s${respiratory.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="respiratory.reagents.fifth_reagent"
                >
                  {{ respiratory.reagents.fifth_reagent.code }}
                </a>
              </div>
            </div>
          </div>
        </template>
      </div>
      <div v-if="title == 'ნევროლოგიური ინფექციები'">
        <template v-for="neurological in neurologicalInfections">
          <div class="virus_type">
            <h1>{{ neurological.title }}</h1>
            <p>{{ neurological.description }}</p>
            <div
              class="toggle_reagent"
              @click="toggleNeurological(neurological.reagents)"
            >
              <p>რეაგენტები</p>
              <img
                v-if="neurologicalToggled"
                src="@/assets/arrow-up.png"
                alt="arrow-up"
              />
              <img
                v-if="!neurologicalToggled"
                src="@/assets/arrow-down.png"
                alt=""
              />
            </div>
            <div class="virus_reagent" v-if="neurological.reagents.active">
              <div class="reagent_container">
                <h2>დასახელება</h2>
                <p class="reagent_title" v-if="neurological.reagents.title">
                  {{ neurological.reagents.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="neurological.reagents.first_reagent"
                >
                  {{ neurological.reagents.first_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="neurological.reagents.second_reagent"
                >
                  {{ neurological.reagents.second_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="neurological.reagents.third_reagent"
                >
                  {{ neurological.reagents.third_reagent.title }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>აღწერა</h2>
                <p
                  class="reagent_description"
                  v-if="neurological.reagents.description"
                >
                  {{ neurological.reagents.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="neurological.reagents.first_reagent"
                >
                  {{ neurological.reagents.first_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="neurological.reagents.second_reagent"
                >
                  {{ neurological.reagents.second_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="neurological.reagents.third_reagent"
                >
                  {{ neurological.reagents.third_reagent.description }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>კოდი</h2>
                <a
                  :href="`https://sacace.com/neurological-infections.htm#s${neurological.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="neurological.reagents.code"
                  >{{ neurological.reagents.code }}</a
                >
                <a
                  :href="`https://sacace.com/neurological-infections.htm#s${neurological.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="neurological.reagents.first_reagent"
                >
                  {{ neurological.reagents.first_reagent.code }}
                </a>
                <a
                  :href="`https://sacace.com/neurological-infections.htm#s${neurological.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="neurological.reagents.second_reagent"
                >
                  {{ neurological.reagents.second_reagent.code }}
                </a>
                <a
                  :href="`https://sacace.com/neurological-infections.htm#s${neurological.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="neurological.reagents.third_reagent"
                >
                  {{ neurological.reagents.third_reagent.code }}
                </a>
              </div>
            </div>
          </div>
        </template>
      </div>
      <div v-if="title == 'ნაწლავური და პარაზიტული ინფექციები'">
        <template v-for="intestinal in intenstinalInfections">
          <div class="virus_type">
            <h1>{{ intestinal.title }}</h1>
            <p>{{ intestinal.description }}</p>
            <div
              class="toggle_reagent"
              @click="toggleIntestinal(intestinal.reagents)"
            >
              <p>რეაგენტები</p>
              <img
                v-if="intestinalToggled"
                src="@/assets/arrow-up.png"
                alt="arrow-up"
              />
              <img
                v-if="!intestinalToggled"
                src="@/assets/arrow-down.png"
                alt=""
              />
            </div>
            <div class="virus_reagent" v-if="intestinal.reagents.active">
              <div class="reagent_container">
                <h2>დასახელება</h2>
                <p class="reagent_title" v-if="intestinal.reagents.title">
                  {{ intestinal.reagents.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="intestinal.reagents.first_reagent"
                >
                  {{ intestinal.reagents.first_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="intestinal.reagents.second_reagent"
                >
                  {{ intestinal.reagents.second_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="intestinal.reagents.third_reagent"
                >
                  {{ intestinal.reagents.third_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="intestinal.reagents.fourth_reagent"
                >
                  {{ intestinal.reagents.fourth_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="intestinal.reagents.fifth_reagent"
                >
                  {{ intestinal.reagents.fifth_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="intestinal.reagents.sixth_reagent"
                >
                  {{ intestinal.reagents.sixth_reagent.title }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>აღწერა</h2>
                <p
                  class="reagent_description"
                  v-if="intestinal.reagents.description"
                >
                  {{ intestinal.reagents.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="intestinal.reagents.first_reagent"
                >
                  {{ intestinal.reagents.first_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="intestinal.reagents.second_reagent"
                >
                  {{ intestinal.reagents.second_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="intestinal.reagents.third_reagent"
                >
                  {{ intestinal.reagents.third_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="intestinal.reagents.fourth_reagent"
                >
                  {{ intestinal.reagents.fourth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="intestinal.reagents.fifth_reagent"
                >
                  {{ intestinal.reagents.fifth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="intestinal.reagents.sixth_reagent"
                >
                  {{ intestinal.reagents.sixth_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="intestinal.reagents.seventh_reagent"
                >
                  {{ intestinal.reagents.seventh_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="intestinal.reagents.eighth_reagent"
                >
                  {{ intestinal.reagents.eighth_reagent.description }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>კოდი</h2>
                <a
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${intestinal.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="intestinal.reagents.code"
                  >{{ intestinal.reagents.code }}</a
                >
                <a
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${intestinal.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="intestinal.reagents.first_reagent"
                  >{{ intestinal.reagents.first_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="intestinal.reagents.second_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${intestinal.reagents.id}`"
                  target="_blank"
                  >{{ intestinal.reagents.second_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="intestinal.reagents.third_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${intestinal.reagents.id}`"
                  target="_blank"
                  >{{ intestinal.reagents.third_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="intestinal.reagents.fourth_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${intestinal.reagents.id}`"
                  target="_blank"
                  >{{ intestinal.reagents.fourth_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="intestinal.reagents.fifth_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${intestinal.reagents.id}`"
                  target="_blank"
                  >{{ intestinal.reagents.fifth_reagent.code }}</a
                >
                <a
                  class="reagent_code"
                  v-if="intestinal.reagents.sixth_reagent"
                  :href="`https://sacace.com/sexually-transmitted-diseases.htm#s${intestinal.reagents.id}`"
                  target="_blank"
                  >{{ intestinal.reagents.sixth_reagent.code }}</a
                >
              </div>
            </div>
          </div>
        </template>
      </div>
      <div v-if="title == 'საშიში ინფექციები'">
        <template v-for="dangerous in dangerousInfections">
          <div class="virus_type">
            <h1>{{ dangerous.title }}</h1>
            <p>{{ dangerous.description }}</p>
            <div
              class="toggle_reagent"
              @click="toggleDangerous(dangerous.reagents)"
            >
              <p>რეაგენტები</p>
              <img
                v-if="dangerousInfectionToggled"
                src="@/assets/arrow-up.png"
                alt="arrow-up"
              />
              <img
                v-if="!dangerousInfectionToggled"
                src="@/assets/arrow-down.png"
                alt=""
              />
            </div>
            <div class="virus_reagent" v-if="dangerous.reagents.active">
              <div class="reagent_container">
                <h2>დასახელება</h2>
                <p class="reagent_title" v-if="dangerous.reagents.title">
                  {{ dangerous.reagents.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="dangerous.reagents.first_reagent"
                >
                  {{ dangerous.reagents.first_reagent.title }}
                </p>
                <p
                  class="reagent_title"
                  v-if="dangerous.reagents.second_reagent"
                >
                  {{ dangerous.reagents.second_reagent.title }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>აღწერა</h2>
                <p
                  class="reagent_description"
                  v-if="dangerous.reagents.description"
                >
                  {{ dangerous.reagents.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="dangerous.reagents.first_reagent"
                >
                  {{ dangerous.reagents.first_reagent.description }}
                </p>
                <p
                  class="reagent_description"
                  v-if="dangerous.reagents.second_reagent"
                >
                  {{ dangerous.reagents.second_reagent.description }}
                </p>
              </div>
              <div class="reagent_container">
                <h2>კოდი</h2>
                <a
                  :href="`https://sacace.com/dangerous-infections.htm#s${dangerous.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="dangerous.reagents.code"
                  >{{ dangerous.reagents.code }}</a
                >
                <a
                  :href="`https://sacace.com/dangerous-infections.htm#s${dangerous.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="dangerous.reagents.first_reagent"
                >
                  {{ dangerous.reagents.first_reagent.code }}
                </a>
                <a
                  :href="`https://sacace.com/dangerous-infections.htm#s${dangerous.reagents.id}`"
                  target="_blank"
                  class="reagent_code"
                  v-if="dangerous.reagents.second_reagent"
                >
                  {{ dangerous.reagents.second_reagent.code }}
                </a>
              </div>
            </div>
          </div>
        </template>
      </div>
    </div>
  </main>
  <Footer />
</template>

<style scoped>
@import url("https://fonts.cdnfonts.com/css/helvetica-neue-5");
* {
  font-family: "Helvetica Neue", sans-serif;
}
.virus_header {
  background: url("../assets/homebcg.png") no-repeat center;
  width: 100%;
  height: 30vh;
  -webkit-background-size: cover;
  background-size: cover;
  margin-top: 100px;
  display: flex;
  justify-content: center;
  align-items: center;
}
.virus_header h1 {
  color: #9732ed;
}

main {
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
}
.virus_description {
  margin: 100px 0;
  width: 800px;
  position: relative;
  padding-bottom: 50px;
}
.virus_description p {
  display: block;
  line-height: 35px;
  text-align: justify;
}
.virus_description h1 {
  text-align: center;
  margin-bottom: 25px;
}
.virus_type {
  margin-top: 50px;
  width: 800px;
}

.virus_type p {
  display: block;

  text-align: justify;
}
.virus_type {
  line-height: 35px;
}
.virus_type h1 {
  text-align: center;
  margin-bottom: 25px;
}
.toggle_reagent {
  display: flex;
  cursor: pointer;
  margin: 30px 0;
  align-items: center;
}

.virus_reagent {
  font-size: 13px;
  display: flex;
  align-items: center;
  padding-bottom: 100px;
}
.reagent_container {
  margin: 0 20px;
}

.reagent_code {
  display: block;
  text-decoration: none;
  width: 90px;
  height: 80px;
  margin-top: 10px;
}
.reagent_title {
  line-height: 1.2rem;
  height: 80px;
  margin-top: 10px;
}
.reagent_description {
  height: 80px;
  line-height: 1.2rem;
  width: 400px;
  margin-top: 10px;
}
@media (max-width: 900px) and (min-width: 100px){
  .virus_description{
    width: auto;
  }
  .virus_description h1{
    font-size: 20px;
  }
  .virus_description p{
    font-size: 13px;
  }
  .virus_header h1{
    font-size: 20px;
  }
  .virus_type{
    width: auto;
  }
  .virus_type h1{
    font-size: 20px;
  }
  .virus_type p{
    font-size: 13px;
  }
  .virus_reagent{
    flex-direction: column;
  }
  .reagent_container p{
    width: auto;
  }
}
</style>
