<script setup>
import Header from "@/components/Header.vue";
import Footer from "@/components/Footer.vue";
import { onMounted } from "vue";
import store from "@/store";
const hepatitisViruses = [
  {
    title: "A ჰეპატიტის (HAV) PCR ნაკრები",
    description: "A ჰეპატიტის ვირუსი (HAV) არის ნაწლავური ინფექცია ყველაზე ფართოდ გავრცელებული მსოფლიოში. HAV არის ხუთ ყველაზე ეკონომიკურად მნიშვნელოვანი ინფექციური დაავადებადან ერთ-ერთი და საზოგადოებრივი ჯანდაცვის ერთ-ერთი პრიორიტეტული პრობლემა.\n" +
        "PCR მეთოდით HAV რნმ-ის გამოვლენას მნიშვნელოვანი უპირატესობები აქვს ELISA-სთან და ბიოქიმიურ ტესტებთან დაკავშირებით კონტაქტის პირთა სისხლში ვირუსის გამოვლენისას, რადგან A ჰეპატიტის ვირუსის რნმ სისხლში ვლინდება დაბინძურების მომენტიდან მესამე კვირაში და ვლინდება საშუალოდ 20 დღის განმავლობაში დაავადების სიმპტომების გამოვლენიდან. ამრიგად, რნმ არის პირველი დიაგნოსტიკური მარკერი, რომელიც აღმოჩენილია პაციენტის სისხლში, ჩნდება უფრო ადრე, ვიდრე HAV IgM და არ იძლევა ცრუ უარყოფით რეაქციებს.\n" +
        "HAV RNA-ს გამოვლენა PCR-ის დახმარებით განავალში შესაძლებელია ინკუბაციური პერიოდის მესამე კვირიდან და დაავადების სიმპტომების გამოვლინებიდან სამ თვემდე. რნმ-ის გამოვლენას უფრო მეტი უპირატესობა აქვს (მინიმუმ 1000-ჯერ მეტი) ვიდრე HAV-Ag-ის გამოვლენა გარემოს ერთეულებში (სასმელი ან ჩამდინარე წყლები, დატბორილი ზედაპირული წყლებიდან და ა.შ.). "
  },
  {
    title: "B ჰეპატიტის (HBV დნმ) PCR ნაკრები",
    description: "B ჰეპატიტის ვირუსი (HBV) არის ფართოდ გავრცელებული ადამიანის ინფექცია, რომელიც გამოწვეულია დნმ-ის შემცველი HBV ვირუსით, რომელიც მიეკუთვნება Hepadnaviridae-ს ოჯახს. ამჟამად ჯანმო-ს მონაცემებით HBV ვირუსით ინფიცირებული მოსახლეობა 500 მილიონ ადამიანს შეადგენს.\n" +
        "HBV დნმ-ის გამოვლენა გამოიყენება:\n" +
        "- მწვავე ვირუსული B ჰეპატიტის ადრეული დიაგნოსტიკისთვის;\n" +
        "- ვირუსული B ჰეპატიტის ლატენტური ფორმების გამოვლენა;\n" +
        "- B ჰეპატიტის ვირუსის მუტანტური შტამების გამოვლენა HBsAg-ით;\n" +
        "- ქრონიკული ვირუსული B ჰეპატიტის დიაგნოზის დადგენა;\n" +
        "- ანტივირუსული თერაპიის ეფექტურობის მონიტორინგი;\n" +
        "\n" +
        "SACACE HBV REAL TIME QUANT KIT-ის უპირატესობები\n" +
        "- CE-IVD მარკირება\n" +
        "- რაოდენობრივი შიდა კონტროლის გამოყენება (კონცენტრაცია მოხსენებული მონაცემთა ბარათში), რომელიც წარმოადგენს რეკომბინანტულ დნმ-ის შემცველ სტრუქტურას, რომელიც განხორციელდა ანალიზის ყველა საფეხურზე ნუკლეინის მჟავას ექსტრაქციიდან PCR გაძლიერებამდე. რაოდენობრივი HBV Rec IC-ის არსებობა საშუალებას იძლევა არა მხოლოდ მონიტორინგს მოახდინოთ ექსტრაქციის პროცედურა და შეამოწმოთ შესაძლო PCR ინჰიბირება, არამედ გადაამოწმოთ დნმ-ის შესაძლო დანაკარგები ექსტრაქციის პროცედურის დროს, რაც საშუალებას გაძლევთ ზუსტად გამოთვალოთ HBV ვირუსული დატვირთვა.\n" +
        "- ექსტრაქციის ორი დადებითი კონტროლის ნაკრების კომპლექტში მოწოდებულ რეაგენტებში: Pos1 HBV დაბალი ვირუსული დატვირთვა და Pos2 HBV საშუალო ვირუსული დატვირთვა, რომლებიც რაოდენობრივად არის აღწერილი მონაცემთა ბარათში, რომელიც განხორციელდა ყველა საფეხურზე და იძლევა ჩატარებული ანალიზის ხარისხის კონტროლის საშუალებას.\n" +
        "- მაღალი მგრძნობელობა: 20 ასლი/მლ (მნიშვნელობა მიღებულია მაგნოვირუსის ექსტრაქციის ნაკრების გამოყენებით (Sacace REF K-2-16) "
  },
  {
    title: "C ჰეპატიტის (HCV RNA) PCR ნაკრები",
    description: "C ჰეპატიტის ვირუსი (HCV) არის რნმ-ის შემცველი, ჰეპატოტროპული ვირუსი, რომელიც მიეკუთვნება Flaviviridae-ს ოჯახს. HCV-ით დაბინძურება ხდება ვირუსის სისხლში პირდაპირი შეყვანისას. HCV მწვავე ინფექციით დაავადებულთა უმეტესობა ასიმპტომურია ან აქვს მსუბუქი სიმპტომები, მაგრამ მათ არ შეუძლიათ ვირუსის გაწმენდა და დაახლოებით 80% შემთხვევაში ეს იწვევს ქრონიკულ ინფექციას. პაციენტების 15-დან 20%-ში ქრონიკული HCV ინფექცია პროგრესირებს ცვლადი სიჩქარით ციროზამდე, ჰეპატოცელულარული კარცინომის განვითარების 1-დან 4%-მდე წლიური რისკით. დღეისათვის ინფიცირებულია 170 მილიონზე მეტი ადამიანი, რაც შეადგენს მსოფლიოს მოსახლეობის 3 პროცენტს.\n" +
        "HCV-ის ლაბორატორიულ დიაგნოსტიკაში წამყვანი ადგილი უკავია მოლეკულურ-ბიოლოგიურ მეთოდებს, რაც საშუალებას იძლევა: 1) მწვავე ვირუსული ინფექციის ადრეული დიაგნოსტიკა; 2) ანტივირუსული თერაპიის ჩვენებების დადგენა; 3) ოპტიმალური თერაპიული რეჟიმის არჩევანი.\n" +
        "SACACE HCV REAL TIME QUANT KIT-ის უპირატესობები\n" +
        "- CE-IVD მარკირება\n" +
        "- პრაიმერებისა და ზონდების გამოყენება UTR რეგიონის ყველაზე კონსერვატიულ ზონაში, რაც საშუალებას იძლევა ეფექტური გამოვლენის HCV გენოტიპების უმეტესობა (შემოწმებული გენოტიპები: 1a, 1b, 1c, 2b, 4,4,3, c. d, 5a, 6a)\n" +
        "- რაოდენობრივი შიდა კონტროლის გამოყენება (კონცენტრაცია მოხსენებული მონაცემთა ბარათში), რომელიც წარმოადგენს რეკომბინანტულ რნმ-ს შემცველ სტრუქტურას, რომელიც განხორციელდა ანალიზის ყველა საფეხურზე ნუკლეინის მჟავას ექსტრაქციისგან PCR გაძლიერებამდე. რაოდენობრივი HCV Rec IC-ის არსებობა საშუალებას იძლევა არა მხოლოდ მონიტორინგდეს ექსტრაქციის პროცედურა და შეამოწმოს შესაძლო PCR დათრგუნვა, არამედ გადაამოწმოს რნმ-ის შესაძლო დანაკარგები ექსტრაქციის პროცედურის დროს, რაც საშუალებას გაძლევთ ზუსტად გამოთვალოთ HCV ვირუსული დატვირთვა.\n" +
        "- ექსტრაქციის ორი დადებითი კონტროლის ნაკრების კომპლექტში მოწოდებულ რეაგენტებში: Pos1 HCV დაბალი ვირუსული დატვირთვა და Pos2 HCV საშუალო ვირუსული დატვირთვა, რომლებიც რაოდენობრივად აღწერილია მონაცემთა ბარათში, რომელიც განხორციელდა ყველა საფეხურზე და იძლევა ჩატარებული ანალიზის ხარისხის კონტროლის საშუალებას.\n" +
        "- გაზომვების ფართო ხაზოვანი დიაპაზონი (20-დან 50.000.000 სე/მლ-მდე). "
  },
  {
    title: "C ჰეპატიტის ვირუსის გენოტიპის PCR ნაკრები",
    description: "HCV კლასიფიცირდება თერთმეტ ძირითად გენოტიპად (მონიშნულია 1-11), ბევრ ქვეტიპად (ა, b, c და ა.შ.) და დაახლოებით 100 სხვადასხვა შტამად (დანომრილი 1,2,3 და ა.შ.) გენომიური თანმიმდევრობის ჰეტეროგენურობის მიხედვით. 1-3 გენოტიპებს აქვთ მსოფლიო გავრცელება. 1a და 1b ტიპები ყველაზე გავრცელებულია, რომლებიც გლობალური ინფექციების დაახლოებით 60%-ს შეადგენს. ისინი ჭარბობენ ჩრდილოეთ ევროპასა და ჩრდილოეთ ამერიკაში, ხოლო სამხრეთ და აღმოსავლეთ ევროპაში და იაპონიაში, შესაბამისად. ტიპი 2 ნაკლებად ხშირად არის წარმოდგენილი, ვიდრე ტიპი 1. ტიპი 3 ენდემურია სამხრეთ-აღმოსავლეთ აზიაში და ცვალებადია გავრცელებული სხვადასხვა ქვეყანაში. გენოტიპი 4 ძირითადად გვხვდება ახლო აღმოსავლეთში, ეგვიპტეში და ცენტრალურ აფრიკაში. ინფიცირებული გენოტიპის განსაზღვრა მნიშვნელოვანია ანტივირუსულ მკურნალობაზე პასუხის პროგნოზირებისთვის: გენოტიპები 1 და 4 ჩვეულებრივ ასოცირდება მხოლოდ ინტერფერონზე ცუდ პასუხთან, ხოლო 2 და 3 გენოტიპები დაკავშირებულია უფრო ხელსაყრელ პასუხებთან. 1b ქვეტიპის მქონე პაციენტებში დაავადება გადადის ქრონიკულ მდგომარეობაში შემთხვევების 90%-ში, იმ დროს, როგორც 2 და 3b გენოტიპების შემთხვევაში 33-50%-ში. რიგ ნაშრომებში აღნიშნულია, რომ 1b გენოტიპის ინფექციას აქვს დაავადების მძიმე მიმდინარეობა ციროზის და ჰეპატოკარცინომის განვითარებით. "
  },
  {
    title: "D ჰეპატიტის (HDV) PCR ნაკრები",
    description: "D ჰეპატიტის ვირუსი (HDV) არის უაღრესად დეფექტური ვირუსი, რადგან მას არ შეუძლია ინფექციური ვირიონების წარმოქმნა თანადამხმარე ვირუსის დახმარების გარეშე. ეს დამხმარე ვირუსი არის B ჰეპატიტის ვირუსი (HBV), რომელიც ამარაგებს ზედაპირული მემბრანის ცილებს (HBsAg). უჯრედიდან გამოსვლისას HDV იძენს HBsAg-ის შემცველ მემბრანას. დაავადების შედეგი დიდწილად დამოკიდებულია იმაზე, ინფიცირდება თუ არა ეს ორი ვირუსი ერთდროულად (კოინფექცია), ან არის თუ არა ახლად HDV-ით ინფიცირებული ადამიანი ქრონიკულად ინფიცირებული HBV მატარებელი (სუპერინფექცია). კოინფექციაHBV და HDV იწვევს როგორც მწვავე B, ასევე მწვავე ტიპის D ჰეპატიტებს და სუპერინფექცია ასოცირდება ფუმინატულ მწვავე ჰეპატიტთან და მძიმე ქრონიკულ აქტიურ ჰეპატიტთან, ხშირად პროგრესირებად ციროზამდე. HDV რნმ-ის გამოვლენა PCR-ით საშუალებას იძლევა გამომწვევი აგენტის გამოვლენა ინფექციის შეყვანის პერიოდში სეროკონვერსიამდე, რაც ძალიან მნიშვნელოვანია ადრეული დიაგნოსტიკისთვის."
  },
  {
    title: "G ჰეპატიტის (HGV) PCR ნაკრები",
    description: "ჰეპატიტი G არის ღვიძლის ანთების ფორმა, რომელიც გამოწვეულია HGV-ით Flaviviridae-ს ოჯახიდან. ცნობილია, რომ HGV შემცველი სისხლის გადასხმა გამოიწვია ჰეპატიტის ზოგიერთი შემთხვევა. ამ მიზეზით, ჰემოფილიით და სხვა სისხლდენით დაავადებული პაციენტები, რომლებსაც ესაჭიროებათ დიდი რაოდენობით სისხლის პროდუქტები, იმყოფებიან G ჰეპატიტის რისკის ქვეშ. ასევე რისკის ქვეშ არიან თირკმელების დაავადების მქონე პაციენტები ჰემოდიალიზით სისხლის გაცვლით."
  },
  {
    title: "HCV/HBV/HIV მულტიპლექს PCR ნაკრები",
    description: "HCV/HBV/HIV Real-TM ნაკრები არის თვისებრივი ინ ვიტრო ტესტი ადამიანის იმუნოდეფიციტის ვირუსის (აივ) რნმ-ის, C ჰეპატიტის ვირუსის რნმ-ის და B ჰეპატიტის ვირუსის დნმ-ის რეალურ დროში ყოვლისმომცველი ერთჯერადი ანალიზისთვის ადამიანის პლაზმაში შიდა კონტროლის (IC) ერთდროული გამოვლენით. ეს ნაკრები განკუთვნილია გამოსაყენებლად, როგორც დონორის სკრინინგ ტესტი, რათა გამოავლინოს აივ რნმ, HCV რნმ და HBV დნმ პლაზმაში ცალკეული დონორებისგან, რომლებიც შეიძლება იყოს სკრინინგული როგორც ცალკეული ნიმუშები ან შეიძლება ტესტირება მოხდეს თანაბარი ნაწილებისგან შემდგარ აუზებში. "
  },
  {
    title: "HCV ასოცირებული PCR კომპლექტები",
    description: " ინტერლეუკინ-28 (IL28) არის ციტოკინი, რომელიც თამაშობს როლს ვირუსებისგან იმუნურ დაცვაში. IL28B მიეკუთვნება III ტიპის ციტოკინების ინტერფერონის ოჯახს. მისი კლასიფიკაცია, როგორც ინტერფერონი, განპირობებულია ანტივირუსული მდგომარეობის გამოწვევის უნარით. პოლიმორფიზმი IL28B გენის რეგიონში (rs12979860 და rs8099917) მნიშვნელოვანია ქრონიკული C ჰეპატიტის ვირუსის (HCV) ინფექციის თერაპიის შემდეგ შედეგის პროგნოზირებისთვის. კომბინირებული თერაპია INF პეგილირებული (PEG-IFN) და რიბავირინი (RBV) არის ამჟამინდელი სტანდარტული თერაპია HCV ინფექციის წინააღმდეგ და პოლიმორფიზმის დეტალური ცოდნა HCV-ით ინფიცირებულ პაციენტებში IL28B გენის რეგიონში შეიძლება იყოს მნიშვნელოვანი კომპონენტი PEG-IFN და RBV-ით მკურნალობის დაწყების გადაწყვეტილების მისაღებად."
  },
  {
    title: "B ჰეპატიტის ვირუსის გენოტიპის PCR ნაკრები",
    description: " B ჰეპატიტის ვირუსი (HBV) აინფიცირებს თითქმის ორ მილიარდ ადამიანს მთელ მსოფლიოში. B ჰეპატიტის ვირუსი (HBV) ამჟამად დაყოფილია რვა გენოტიპად (A-დან H). გენოტიპები აღმოჩნდა გეოგრაფიულად განაწილებული. მრავალრიცხოვანმა კვლევამ გამოიკვლია HBV გენოტიპების კლინიკური გავლენა დაავადების სიმძიმეზე, IFN-ზე პასუხზე, დაავადების ქრონიკულობაზე და ჰეპატოცელულურ კარცინომაზე (HCC)."
  }
]
const hivViruses = [
  {
    title: "აივ რნმ PCR ნაკრები",
    description: "აივ-ის პირდაპირი გამოვლენის ერთ-ერთი ყველაზე ეფექტური მეთოდია ნუკლეინის მჟავების სპეციფიკური გაძლიერება in vitro პოლიმერაზული ჯაჭვური რეაქციით (PCR). ამ მეთოდს ბევრი უპირატესობა აქვს:\n" +
        "- ვირუსის დნმ/რნმ-ის გამოვლენა საშუალებას იძლევა შემცირდეს სეროლოგიური ფანჯრის სიგრძე;\n" +
        "- PCR არის შეუცვლელი მიდგომა აივ ინფიცირებული დედებიდან დაბადებულ ბავშვებში აივ-დიაგნოსტიკისთვის:\n" +
        "- სისხლის პლაზმაში აივ რნმ-ის განსაზღვრა (ვირუსული დატვირთვა) სავალდებულო პროცედურაა თერაპიის ეფექტურობის მონიტორინგისთვის. "
  },
  {
    title: "აივ დნმ PCR ნაკრები",
    description: " აივ ინფიცირებული დედებისგან დაბადებულ ბავშვებში აივ-ინფექციის დიაგნოსტიკა რთულია იმის გამო, რომ დედის ანტისხეულები აივ-ის მიმართ ასეთ ბავშვებს სისხლში დიდი ხნის განმავლობაში ნარჩუნდება. მაგრამ ინფიცირებული დედისგან დაბადებული ყველა ბავშვი არ არის ინფიცირებული აივ-ით, მიუხედავად იმისა, რომ ბავშვები ექვემდებარებიან აივ ინფექციის მაღალი რისკის ინტრაუტერიულ პერიოდში, მშობიარობისა და ძუძუთი კვების დროს. თუ პრევენციული ზომები არ მიიღება, ბავშვებში დედიდან შვილზე აივ ინფექციის გადაცემის რისკი 20-45 პროცენტს შეადგენს. დღეს ეფექტურმა ზომებმა, რომლებიც გამიზნულია აივ-ის ვერტიკალური გადაცემის პრევენციისთვის, შეუძლია შეამციროს რისკი 1-2 პროცენტამდე.\n" +
        "ახალშობილებში აივ-ინფექციის ადრეული დიაგნოსტიკის პრობლემა რამდენიმე წლის წინ მოგვარდა მოლეკულურ-გენეტიკური მეთოდების შემუშავებით, რაც საშუალებას იძლევა პერიფერიულ სისხლში აივ-ის გენომის ფრაგმენტების გამოვლენა ინფექციის ადრეულ ეტაპზე. მოპოვებული იქნა მტკიცებულება, რომ აივ-პროვირუსის დნმ განისაზღვრება ბავშვების უმრავლესობაში ერთი თვის ასაკში და პრაქტიკულად ყველაში - 6 თვის ასაკში. ამ მონაცემების საფუძველზე რეკომენდებულია პოლიმერაზული ჯაჭვური რეაქციის (PCR) ჩატარება აივ პროვირუსის დნმ-ზე პირველად დაბადებიდან 48 საათის განმავლობაში და ბავშვის სიცოცხლის 6-8 კვირაში, პირველი გამოკვლევის შედეგის მიუხედავად. ბავშვში აივ ინფექციის არსებობის შესახებ საბოლოო გადაწყვეტილება მიიღება არაუგვიანეს 6 თვის ასაკისა. "
  },
  {
    title: "აივ ასოცირებული PCR კომპლექტები",
    description: " აბაკავირი არის ნუკლეოზიდური საპირისპირო ტრანსკრიპტაზას ინჰიბიტორი, აქტივობით ადამიანის იმუნოდეფიციტის ვირუსის (აივ) წინააღმდეგ, ხელმისაწვდომია დღეში ერთხელ გამოყენებისთვის სხვა ანტირეტროვირუსულ საშუალებებთან ერთად, რომელიც აჩვენა ეფექტურობა, რამდენიმე წამლის ურთიერთქმედება და ხელსაყრელი გრძელვადიანი ტოქსიკურობის პროფილი. აბაკავირის ყველაზე მნიშვნელოვანი გვერდითი ეფექტი, რომელიც ზღუდავს მის გამოყენებას თერაპიაში და მოითხოვს მაღალი ხარისხის კლინიკურ სიფხიზლეს, არის იმუნოლოგიურად შუამავალი ჰიპერმგრძნობელობის რეაქცია, რომელიც გავლენას ახდენს პაციენტების 5-დან 8%-მდე მკურნალობის პირველი 6 კვირის განმავლობაში. 2002 წელს, ასოციაცია აბაკავირზე ჰიპერმგრძნობელობის რეაქციის დიაგნოზსა და I კლასის ჰისტოშეთავსებადობის კომპლექსის ძირითადი ალელის HLA-B*5701 გადატანას შორის დამოუკიდებლად მოხსენებული იყო რამდენიმე დამოუკიდებელი კვლევის შედეგად.\n" +
        "აივ ინფექციის მქონე კოჰორტების კვლევებმა ასევე აჩვენა, რომ აბაკავირის თავიდან აცილება HLA-B*5701 დადებით პაციენტებში მნიშვნელოვნად ამცირებს საეჭვო ჰიპერმგრძნობელობის რეაქციის სიხშირეს 0,5%-მდე. ამ მიზეზით მრავალი კლინიკური კვლევა გვირჩევს, რომ ფარმაკოგენეტიკური მოლეკულური ტესტირება მოხდეს I კლასის ჰისტოშეთავსებადობის კომპლექსის ძირითადი ალელეს HLA-B*5701-ზე ყველა აივ დადებით პაციენტში, რომლებიც მკურნალობენ აბაკოვირით.\n" +
        "HLA-B*5701 Real-TM ტესტს შეუძლია წინასწარ განსაზღვროს, თუ ვის განუვითარდება მძიმე ალერგიული რეაქცია აივ-ის საწინააღმდეგო პრეპარატ აბაკავირზე, რადგან HLA-B*5701-ის არსებობა მნიშვნელოვნად ასოცირდება აბაკავირის ჰიპერმგრძნობელობასთან. "
  }
]
const hpvViruses = [
  {
    title: "PCR კომპლექტები მაღალი კანცეროგენული რისკის HPV გენოტიპების სკრინინგისთვის",
    description: " ნაკრები HPV High Risk Screen Real-TM Quant არის in vitro რეალურ დროში გამაძლიერებელი ტესტი HPV-ის 12 ტიპის რაოდენობრივი გამოვლენისთვის (16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59). ცნობილია, რომ ვირუსული დატვირთვის პარამეტრს აქვს პროგნოზული მნიშვნელობა და ვირუსული დატვირთვა 10*5 HPV გენომიურ ეკვივალენტზე ნაკლები ნაცხში ან 10*3 გენომის ეკვივალენტი 10*5 უჯრედისთვის, ითვლება უმნიშვნელოდ და მიუთითებს გარდამავალი ინფექციის არსებობაზე, თუმცა დატვირთვის ასეთი მონიტორინგი შეიძლება ჰქონდეს მხოლოდ მკურნალობის შემთხვევაში. 10*5-ზე მეტი გენომიური ეკვივალენტის ვირუსული დატვირთვა 10*5 უჯრედისთვის მიჩნეულია მაღალი მნიშვნელობით და მიუთითებს დისპლასტიკური ცვლილებების არსებობაზე ან მათი წარმოქმნის მაღალ რისკზე. "
  },
  {
    title: "PCR კომპლექტები მაღალი კანცეროგენული რისკის HPV გენოტიპებისთვის",
    description: " ნაკრები HPV High Risk Typing Real-TM არის ინ ვიტრო მულტიპლექსური რეალურ დროში გამაძლიერებელი ტესტი ადამიანის პაპილომავირუსის ხარისხობრივი გამოვლენისა და გენოტიპაციისთვის (16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59 და ბიოგენური . ნაკრები HPV High Risk Typing Real-TM ეფუძნება ორ ძირითად პროცესს: ნიმუშებიდან დნმ-ის იზოლაციას და 4 მილის მულტიპლექსურ რეალურ დროში გაძლიერებას თითოეული ნიმუშისთვის. თითოეული ტუბი შეიცავს პრაიმერებს, რომლებიც მიმართულია სამი HPV ტიპის რეგიონისა და ბეტა-გლობინის გენის წინააღმდეგ, რომელიც გამოიყენება როგორც შიდა კონტროლი. "
  },
  {
    title: "PCR კომპლექტები დაბალი კანცეროგენული რისკის HPV-სთვის",
    description: " დაბალი კანცეროგენული რისკის HPV-ს ჯგუფი წარმოდგენილია 12-ზე მეტი გენოტიპით და მათ უწოდებენ დაბალი რისკის ჯგუფს, რადგან მათ არ შეუძლიათ საშვილოსნოს ყელის კიბოს გამოწვევა. ზოგჯერ დაბალი რისკის HPV ტიპებმა შეიძლება გამოიწვიოს ხილული ცვლილებები გენიტალური არეში, რომელსაც გენიტალური მეჭეჭები ეწოდება. გენიტალური მეჭეჭები არის წარმონაქმნები ან მუწუკები ქალისა და მამაკაცის სასქესო ორგანოებში. ისინი ჩვეულებრივ უმტკივნეულოა. ისინი შეიძლება იყოს აწეული, ბრტყელი, პატარა ან დიდი და ერთჯერადი ან მრავალჯერადი. დაბალი რისკის HPV-დან მე-6 და მე-11 გენოტიპებს უდიდესი მნიშვნელობა აქვს, რადგან ისინი პასუხისმგებელნი არიან სასქესო ორგანოების დაბალი კანცეროგენული წვეტიანი კონდილომების დიდ რაოდენობაზე და ბავშვებში ხორხის კონდილომატოზის შემთხვევების 90 პროცენტზე მეტზე. "
  }
]
const stdViruses = [
  {
    title: "Chlamydia trachomatis PCR კომპლექტები",
    description: "C. trachomatis შეიძლება დიფერენცირებული იყოს 18 სეროვარად, მონოკლონურ ანტისხეულებზე დაფუძნებული ტიპური ანალიზის საფუძველზე. A, B, Ba და C სეროვარები ასოცირდება ტრაქომასთან (თვალის სერიოზული დაავადება, რომელიც შეიძლება გამოიწვიოს სიბრმავე), სეროვარები DK ასოცირდება გენიტალური ტრაქტის ინფექციებთან და L1-L3 ასოცირდება ვენერულ ლიმფოგრანულომასთან (LGV). Chlamydia trachomatis არის სავალდებულო უჯრედშიდა პათოგენი (ანუ ბაქტერია ცხოვრობს ადამიანის უჯრედებში) და შეიძლება გამოიწვიოს მრავალი დაავადების მდგომარეობა როგორც მამაკაცებში, ასევე ქალებში. ორივე სქესს შეუძლია აჩვენოს ურეთრიტი, პროქტიტი (რექტალური დაავადება და სისხლდენა), ტრაქომა და უნაყოფობა. ბაქტერიას შეუძლია გამოიწვიოს პროსტატიტი და ეპიდიდიმიტი მამაკაცებში და ცერვიციტი, მენჯის ღრუს ანთებითი დაავადება (PID), ექტოპიური ორსულობა ქალებში. C. trachomatis ასევე არის მნიშვნელოვანი ახალშობილთა პათოგენი,"
  },
  {
    title: "Neisseria gonorrhoeae",
    description: " გონორეა, რომელიც გამოწვეულია Neisseria gonorrhoeae-ით, არის საზოგადოებრივი ჯანმრთელობის მნიშვნელოვანი პრობლემა და არის ყველაზე გავრცელებული საანგარიშო ინფექციური დაავადება. შეერთებულ შტატებში ყოველწლიურად დაახლოებით 700 000 ახალი გონოკოკური ინფექცია ხდება. გონორეა ყველაზე ხშირად სქესობრივი კონტაქტის დროს ვრცელდება. თუმცა, ის ასევე შეიძლება გადაეცეს დედის სასქესო ტრაქტიდან ახალშობილს დაბადებისას, რამაც გამოიწვიოს ახალშობილთა ოფთალმია და სისტემური ნეონატალური ინფექცია. "
  },
  {
    title: "ურეაპლაზმის სახეობები და Mycoplasma PCR კომპლექტები",
    description: "ურეაპლაზმის სახეობები და მიკოპლაზმა არის არაქლამიდიური არაგონოკოკური ურეთრიტის მიზეზები. მიკოპლაზმის სახეობები არ იწვევენ ვაგინიტს, მაგრამ ისინი შეიძლება გამრავლდეს ბაქტერიული ვაგინოზის მქონე პაციენტებში და შეიძლება ხელი შეუწყონ ამ მდგომარეობას. სალპინგიტით დაავადებული ქალების დაახლოებით 10%-ის ენდომეტრიუმიდან და ფალოპის მილებიდან M hominis იზოლირებულია; M genitalium ასევე შეიძლება ჩართული იყოს მენჯის ანთებით დაავადებასა და ცერვიციტში. ურეაპლაზმის სახეობებს შეუძლიათ გამოიწვიონ პლაცენტის ანთება და შეიძლება ადრევე შეაღწიონ სანაყოფე პარკში, რამაც გამოიწვიოს მუდმივი ინფექცია და ორსულობის არასასურველი შედეგები, მათ შორის ნაადრევი მშობიარობა. Ureaplasma-ს ორი ბიოვარი, Ureaplasma urealyticum და Ureaplasma parvum, ახლა ცალკე სახეობად არის დასახელებული. ამ სახეობების განცალკევება შეუძლებელია გარდა მოლეკულური ტექნიკით, როგორიცაა პოლიმერაზული ჯაჭვური რეაქცია (PCR). "
  },
  {
    title: "ტრიქომონას ვაგინალური",
    description: " ტრიქომონიაზი არის ყველაზე გავრცელებული, განკურნებადი სქესობრივი გზით გადამდები დაავადება მსოფლიოში. ის ასევე არის სამი ყველაზე გავრცელებული ვაგინალური ინფექციიდან ქალებში. ჯანდაცვის მსოფლიო ორგანიზაციის წლიური შეფასებით, შეერთებულ შტატებში ყოველწლიურად ტრიქომონიაზის 7,4 მილიონი შემთხვევა ფიქსირდება, 180 მილიონზე მეტი შემთხვევა დაფიქსირდა მთელ მსოფლიოში. ტრიქომონიაზს იწვევს ერთუჯრედიანი პარაზიტი, Trichomonas vaginalis. ტრიქომონიაზი ავადდება როგორც ქალებში, ასევე მამაკაცებში. ქალებში ინფექციის ყველაზე გავრცელებული ლოკაცია საშოა, მამაკაცებში კი შარდსადენი. "
  },
  {
    title: "Candida albicans PCR კომპლექტები",
    description: " Candida albicans არის დიპლოიდური სოკო (საფუარის ფორმა) და ადამიანებში პირის ღრუს და სასქესო ორგანოების ოპორტუნისტული ინფექციების გამომწვევი აგენტი.\n" +
        "ნორმალურ პირობებში, C. albicans ცხოვრობს ადამიანის მოსახლეობის 80 პროცენტში მავნე ზემოქმედების გარეშე, თუმცა გადაჭარბებული ზრდა იწვევს კანდიდოზის განვითარებას. კანდიდოზი ხშირად შეინიშნება იმუნოკომპრომეტირებულ პირებში, როგორიცაა აივ-დადებითი პაციენტები, მაგრამ ასევე შეიძლება მოხდეს სისხლში და სასქესო ტრაქტში. "
  },
  {
    title: "Treponema pallidum PCR კომპლექტები",
    description: " Treponema pallidum არის სპიროქეეტის ბაქტერიის სახეობა ქვესახეობებით, რომლებიც იწვევენ დაავადებას, როგორიცაა სიფილისი. სიფილისი არის სქესობრივი გზით გადამდები დაავადება, რომლის გადაცემის გზა თითქმის ყოველთვის არის სქესობრივი კონტაქტით, თუმცა არსებობს თანდაყოლილი სიფილისის მაგალითები დედიდან შვილზე საშვილოსნოში ან დაბადებისას გადაცემის გზით. T. pallidum გადაეცემა სპიროქეტების შეღწევის გზით ლორწოვანი გარსებით და ეპითელიუმის ზედაპირებზე აბრაზიებით. "
  },
  {
    title: "ბაქტერიული ვაგინოზის PCR ნაკრები",
    description: " ბაქტერიული ვაგინოზი (BV) ითვლება ვაგინალური ანთების ყველაზე გავრცელებულ მიზეზად როგორც ორსულ, ისე არაორსულ ქალებში და პრევალენტობა 4.9%-დან 36.0%-მდე დაფიქსირდა ევროპულ და ამერიკულ კვლევებში. ადრე მას ეძახდნენ არასპეციფიკურ ვაგინიტს ან გარდნერელასთან ასოცირებულ ვაგინიტს.\n" +
        "ზრდასრული ადამიანის საშო არის რთული ეკოსისტემა, რომელიც შეიცავს უამრავ მიკროორგანიზმებს. მშობიარობის ასაკის ქალებში ამ სისტემაში დომინირებს Lactobacillus spp., გრამდადებითი, არამოძრავი ღეროს მსგავსი ბაქტერიების გვარი, რომლის განმსაზღვრელი მახასიათებელია მჟავე გარემოში ზრდისა და მჟავე პირობების ტოლერანტობის უნარი (pH <4,5); ლაქტობაცილი ასევე დუღს ნახშირწყლებს, რათა გამოიმუშაოს რძემჟავა და წარმოქმნას H2O2, რომელიც უზრუნველყოფს ბუნებრივ დაცვას Gardnerella vaginalis-ისგან. ბაქტერიული ვაგინოზის (BV) დროს ფლორის ბალანსი იცვლება ლაქტობაცილების შემცირებული რაოდენობით (ნორმალური კონცენტრაცია 10^6-10^10 CFU/მლ) და სხვა ფაკულტატური და ანაერობული სახეობების რაოდენობის ზრდა, როგორიცაა ანაერობული კოკები Prevotella spp., Gardnerella spp. და Mobil. (ნორმალური კონცენტრაცია < 10^3-10^5 CFU/მლ). გ.\n" +
        "ვაგინალური ფლორის შესწავლის კლინიკური მნიშვნელობა იმაში მდგომარეობს, რომ ის ეხმარება განსაზღვროს მიკროორგანიზმების რაოდენობა და შეაფასოს თანაფარდობა პირობით პათოგენური მიკროორგანიზმების სხვადასხვა ჯგუფებსა და ნორმალურ ფლორას შორის.\n" +
        "ბაქტერიების მთლიანი რაოდენობა ემსახურება ინფექციის დონის ინდიკატორს საშოს გარემოში: ნორმალურ პირობებში ის შეიძლება განსხვავდებოდეს 10^6-დან 10^9-მდე (6-9 Log). ლაქტობაცილებისა და ბაქტერიების მთლიან რაოდენობას შორის თანაფარდობა შეიძლება გამოყენებულ იქნას ნორმალურ და პირობითად პათოგენურ ფლორას შორის ბალანსის ინდიკატორად: ლაქტობაცილების ნორმალური პროპორცია უნდა იყოს ბაქტერიების მთლიანი რაოდენობის 95-დან 100%-მდე.\n" +
        "ბაქტერიული ვაგინოზის Real-TM Quant ნაკრები არის Gardnerella vaginalis, Atopobium vaginae, Lactobacillus spp რაოდენობრივი გამოვლენისთვის. და ბაქტერიების მთლიანი რაოდენობა ვაგინალურ ბიოტოპში. ლოგარითმული თანაფარდობა Lactobacillus spp-ს შორის. და ბაქტერიების მთლიანი რაოდენობა და ასევე Lactobacillus spp-ს შორის. და ფაკულტატური პათოგენური მიკროორგანიზმები (Gardnerella vaginalis და Atopobium vaginae) საშუალებას იძლევა მაღალი სიზუსტით გამოავლინოს ბაქტერიული ვაგინოზის დაავადება, რომელიც დაკავშირებულია ნორმალური ვაგინალური მიკროფლორის დათრგუნვით (Lactobacillus spp.) და ჩანაცვლებით ფაკულტატური გამომწვევი მიკროორგანიზმებით (Gardnerella vaginalis და Atopobium). ბაქტერიული ვაგინოზის Real-TM Quant ნაკრების გამოყენება საშუალებას იძლევა ვაგინალური გარემოს მდგომარეობის მონიტორინგი და თერაპიის ეფექტურობის შემოწმება. "
  },
  {
    title: "მამაკაცის ჯანმრთელობის PCR კომპლექტები",
    description: " ქრონიკული ბაქტერიული პროსტატიტი (CBP) წარმოადგენს პროსტატის ჯირკვლის ბაქტერიულ ინფექციას. CBP იწვევს ასოცირებულ სიმპტომურ კომპლექსს, რომლის დამახასიათებელი ნიშანია საშარდე გზების მორეციდივე ინფექციების გაჩენა. ყველა მამაკაცის დაახლოებით ნახევარს საბოლოოდ უვითარდება პროსტატიტის შესაბამისი სიმპტომები. ეს სიმპტომების კომპლექსი შეადგენს მამაკაცებში უროლოგიური შეფასებების დაახლოებით 25%-ს. "
  }
]
const herpesViruses = [
  {
    title: "ციტომეგალოვირუსი (CMV)",
    description: " ციტომეგალოვირუსი (CMV) არის ორჯაჭვიანი დნმ ვირუსი და წარმოადგენს Herpesviridae ოჯახის წარმომადგენელს. CMV იზიარებს ბევრ ატრიბუტს სხვა ჰერპეს ვირუსებთან, მათ შორის გენომი, ვირიონის სტრუქტურა და ლატენტური და მდგრადი ინფექციების გამოწვევის უნარი. ადამიანის CMV იზრდება მხოლოდ ადამიანის უჯრედებში და საუკეთესოდ მეორდება ადამიანის ფიბრობლასტებში. 6 წელზე უფროსი ასაკის პირთა დაახლოებით 58.9% ინფიცირებულია CMV-ით, ხოლო 80 წელზე უფროსი ასაკის პირთა 90.8% დადებითია CMV ანტისხეულებზე. იმუნოდეფიციტის მქონე ადამიანებში სიმპტომატურმა CMV დაავადებამ შეიძლება გავლენა მოახდინოს სხეულის თითქმის ყველა ორგანოზე, რამაც გამოიწვია უცნობი წარმოშობის ცხელება, პნევმონია, ჰეპატიტი, ენცეფალიტი, მიელიტი, კოლიტი, უვეიტი, რეტინიტი და ნეიროპათია. აივ ინფექციით ინფიცირებულ პაციენტებში CMV ინფექცია იწვევს შიდსის პროგრესირებას და საბოლოოდ სიკვდილს. "
  },
  {
    title: "ეპშტეინ-ბარის ვირუსი (EBV)",
    description: " ეპშტეინ-ბარის ვირუსი (EBV), ან ადამიანის ჰერპესვირუსი 4, არის გამაჰერპესვირუსი, რომელიც აინფიცირებს მოსახლეობის 95%-ზე მეტს. ამ ორგანიზმით პირველადი ინფექციის ყველაზე გავრცელებული გამოვლინებაა მწვავე ინფექციური მონონუკლეოზი, თვითშეზღუდული კლინიკური სინდრომი, რომელიც ყველაზე ხშირად აზიანებს მოზარდებსა და ახალგაზრდებს. კლასიკური სიმპტომებია ყელის ტკივილი, ცხელება და ლიმფადენოპათია. თუმცა, ეპშტეინ-ბარის ვირუსი ასევე არის ადამიანის სიმსივნური ვირუსი, პირველი ვირუსი, რომელიც ასოცირდება ადამიანის ავთვისებიან სიმსივნესთან. ეპშტეინ-ბარის ვირუსით ინფექცია ასოცირდება ლიმფოპროლიფერაციულ დარღვევებთან, განსაკუთრებით იმუნოკომპრომეტირებულ მასპინძლებში და ასოცირდება სხვადასხვა სიმსივნეებთან, მათ შორის ცხვირ-ხახის კარცინომასთან და ბურკიტის ლიმფომასთან. "
  },
  {
    title: "ადამიანის ჰერპესვირუსი 6 და 7 (HHV-6 და HHV-7)",
    description: "Herpesviridae არის დნმ-ის ვირუსების დიდი ოჯახი, რომლებიც იწვევენ დაავადებებს ადამიანებში. ამ ოჯახის წევრები ასევე ცნობილია როგორც ჰერპესვირუსები. ცნობილია ჰერპესვირუსის 9 ტიპი, რომელიც აინფიცირებს ადამიანებს: ჰერპეს სიმპლექსის ვირუსები 1 და 2, HSV-1 და HSV-2, (HHV1 და HHV2), ვარიცელა-ზოსტერის ვირუსი (VZV ან HHV-3), ეპშტეინ-ბარის ვირუსი (EBV ან HHV-4), ადამიანის ციტომეგალოვირუსი (HCV-5HVHV-4), ადამიანის ციტომეგალოვირუსი (HCV-5HHV-4). HV-6A და HHV-6B), ადამიანის ჰერპესვირუსი 7 (HHV-7) და კაპოშის სარკომასთან ასოცირებული ჰერპესვირუსი (KSHV ან HHV-8).\n" +
        "\n" +
        "ადამიანის ჰერპესვირუსები 6 (HHV-6) A და B არის ორი განსხვავებული ლიმფოტროპული β-ჰერპესვირუსი, რომელიც აინფიცირებს ადამიანების უმრავლესობას. 5 წლისთვის ადამიანთა უმრავლესობამ შეიძინა HHV-6 ინფექცია, როგორც ეს მიუთითებს სეროპოზიტიურობით. პირველადი HHV-6 ინფექციის კლასიკური პრეზენტაცია არის Roseola Infantum. იმუნოკომპეტენტურ პირებში პირველადი HHV-6 ინფექცია ხშირად ასიმპტომურია ან კლინიკურად შეიძლება გამოვლინდეს როგორც ფებრილური დაავადება, რომელიც დაკავშირებულია ეგზანთემასთან, დიარეასთან, რესპირატორულ სიმპტომებთან, კრუნჩხვით ან ენცეფალიტთან.\n" +
        "\n" +
        "ადამიანის ჰერპესვირუსი (HHV-7) ასევე არის ლიმფოტროპული β-ჰერპესვირუსი, რომელიც აინფიცირებს ადამიანებს სიცოცხლის პირველი 5 წლის განმავლობაში. HHV-6-ის მსგავსად, ის შეიძლება იყოს ასიმპტომური ან კლინიკურად გამოვლინდეს როგორც ცხელება, ზედა სასუნთქი გზების სიმპტომები, ღებინება, დიარეა, კრუნჩხვები, ენცეფალიტი და როზეოლას მსგავსი დაავადება. მიუხედავად იმისა, რომ ყველაზე გავრცელებული კლინიკური გამოვლინებები HHV-7 ვირემიულ ბავშვებში არის კრუნჩხვები და ცხელება."
  },
  {
    title: "Varicella Zoster virus (VZV)",
    description: "Varicella-zoster virus (VZV) არის ალფა ჰერპეს ვირუსი, რომელიც იწვევს ჩუტყვავილას და ჰერპეს ზოსტერს (ზოსტერი). [ 1 ]  ვარიკოზს ახასიათებს მაკულოპაპულური, ბუშტუკოვანი გამონაყარი, რომელიც შეიძლება იყოს ქავილი და 3-დან 7-დღიან პერიოდში გადაიზარდოს გამომშრალ ქერქებად (ქაფები). მიძინებული ვირუსის ხელახალი გააქტიურება იწვევს ჰერპეს ზოსტერის დამახასიათებელ მტკივნეულ დერმატომულ გამონაყარს, რასაც ხშირად მოჰყვება ტკივილი გამონაყარის განაწილებაში (პოსტერპეტური ნევრალგია). \n" +
        "\n" +
        "ჩუტყვავილა ითვლება გადამდები, რომელიც იწყება გამონაყარის დაწყებამდე 1-2 დღით ადრე, სანამ ყველა დაზიანებები არ გახდება ქერქი.  "
  },
  {
    title: "მარტივი ჰერპესი",
    description: " ჰერპეს სიმპლექსი არის ვირუსული დაავადება, რომელიც გამოწვეულია როგორც ჰერპეს სიმპლექსის ვირუსის ტიპი 1 (HSV-1) და ტიპი 2 (HSV-2). ჰერპესის ვირუსით ინფექცია იყოფა რამდენიმე განსხვავებულ აშლილობად, ინფექციის ადგილიდან გამომდინარე. პირის ღრუს ჰერპესი, რომლის თვალსაჩინო სიმპტომებს სასაუბროდ უწოდებენ სიცივეს ან ციებ-ცხელების ბუშტუკებს, აზიანებს სახესა და პირს. პირის ღრუს ჰერპესი ინფექციის ყველაზე გავრცელებული ფორმაა. გენიტალური ჰერპესი, რომელიც ცნობილია უბრალოდ ჰერპესის სახელით, ჰერპესის მეორე ყველაზე გავრცელებული ფორმაა. სხვა აშლილობები, როგორიცაა ჰერპესული თეთრი, ჰერპეს გლადიატორუმი, თვალის ჰერპესი (კერატიტი), ცერებრალური ჰერპესული ინფექციის ენცეფალიტი, მოლარეტის მენინგიტი, ახალშობილთა ჰერპესი, ყველა გამოწვეულია ჰერპეს სიმპლექსის ვირუსებით. "
  }
]
const torchViruses = [
  {
    title: "ტოქსოპლაზმოზი",
    description: " ტოქსოპლაზმოზი გამოწვეულია Toxoplasma gondii-ით, სავალდებულო უჯრედშიდა პარაზიტით. ინფექცია იწვევს კლინიკურ სინდრომების ფართო სპექტრს ადამიანებში, ხმელეთის და ზღვის ძუძუმწოვრებში და სხვადასხვა ფრინველის სახეობებში. იმუნოკომპეტენტური პირების უმეტესობაში პირველადი ან ქრონიკული (ლატენტური) T gondii ინფექცია ასიმპტომურია. ამ პაციენტების მცირე პროცენტს საბოლოოდ უვითარდება ქორიორეტინიტი, ლიმფადენიტი, ან იშვიათად მიოკარდიტი და პოლიმიოზიტი. თუმცა, ზოგიერთ ადამიანს აქვს მძიმე ან სიცოცხლისათვის საშიში ტოქსოპლაზმოზის მაღალი რისკი. ტოქსოპლაზმოზის რისკის ქვეშ მყოფი პირები მოიცავს ნაყოფს, ახალშობილს და იმუნოლოგიურად დაქვეითებულ პაციენტებს. თანდაყოლილი ტოქსოპლაზმოზი ჩვეულებრივ სუბკლინიკური ინფექციაა. იმუნოდეფიციტურ პირებს შორის ტოქსოპლაზმოზი ყველაზე ხშირად გვხვდება T-უჯრედოვანი იმუნიტეტის დეფექტებით."
  },
  {
    title: "პარვოვირუსი B19 (B19V)",
    description: " პარვოვირუსი B19 (B19V) არის ერთჯაჭვიანი დნმ-ის ვირუსი Parvoviridae-სა და ერითროვირუსების გვარიდან. ნაჩვენებია, რომ ადამიანის პარვოვირუსი B19 იყო ინფექციური ერითემის ეტიოლოგიური აგენტი ჰემატოლოგიურად ნორმალურ ადამიანებში. ინფექციურ ერითემას თავდაპირველად მეხუთე დაავადება ეწოდა, რადგან ეს იყო მეხუთე ბავშვობის 6 კლასიკური ეგზანთემატოზური დაავადების აღწერილობა. მოგვიანებით დაფიქსირდა არაიმუნური ჰიდროპსის ფეტალისის შემთხვევები, როდესაც ქალში ინფექცია მოხდა ორსულობის დროს. იმუნოდეფიციტის მქონე პაციენტებს (მაგ., იღებენ ქიმიოთერაპიას ან იმუნოსუპრესიულ პრეპარატებს ან აქვთ იმუნური დეფექტები [თანდაყოლილი და შეძენილი]) შეიძლება განუვითარდეთ ქრონიკული პარვოვირუსის B19 ინფექცია, რომელიც იწვევს ქრონიკულ ანემიას. წმინდა წითელი უჯრედების აპლაზია (PRAC) გრძელდება ვირუსის გაწმენდამდე და უნდა გამოირჩეოდეს ზემოთ აღწერილი გარდამავალი ანემიისგან."
  },
  {
    title: "წითურა",
    description: " სახელწოდება რუბელა მომდინარეობს ლათინური ტერმინიდან, რაც ნიშნავს პატარა წითელს. რუბელა ზოგადად კეთილთვისებიანი გადამდები ეგზანთემატოზური დაავადებაა და ის გამოწვეულია რუბელა ვირუსით, რომელიც არის რუბივირუსების გვარის წარმომადგენელი Togaviridae-ს ოჯახისა. ამ ვირუსით ინფიცირებულთა თითქმის ნახევარი უსიმპტომოა. მცირეწლოვან ბავშვებში ინფექციას ახასიათებს მსუბუქი კონსტიტუციური სიმპტომები, გამონაყარი და სუბკოციპიტალური ადენოპათია; პირიქით, უფროს ბავშვებში, მოზარდებში და მოზრდილებში წითურა შეიძლება გართულდეს ართრალგიით, ართრიტით და თრომბოციტოპენიური პურპურით. ასევე აღწერილია წითურას ენცეფალიტის იშვიათი შემთხვევები ბავშვებში. წითურას მთავარი გართულება არის მისი ტერატოგენული ეფექტი, როდესაც ორსული ქალები ავადდებიან ამ დაავადებით, განსაკუთრებით ორსულობის პირველ კვირებში. "
  }
]
const respiratoryInfection = [
  {
    title: "გრიპი",
    description: " გრიპის ვირუსის ინფექცია, ერთ-ერთი ყველაზე გავრცელებული ინფექციური დაავადება, არის უაღრესად გადამდები დაავადება, რომელიც იწვევს მწვავე ფებრილურ დაავადებას და იწვევს სისტემური სიმპტომების ცვალებად ხარისხს, დაწყებული მსუბუქი დაღლილობით სუნთქვის უკმარისობით და სიკვდილამდე. ეს სიმპტომები ხელს უწყობს სამუშაო დღეების მნიშვნელოვან დაკარგვას, ადამიანის ტანჯვას, სიკვდილიანობას და მნიშვნელოვან ავადობას. გრიპი გამოწვეულია გრიპის ვირუსის 3 ძირითადი ტიპის 1-დან ინფექციის შედეგად: A, B ან C, რომლებიც კლასიფიცირებულია Orthomyxoviridae-ს ოჯახში. ეს ერთჯაჭვიანი რნმ ვირუსები სტრუქტურულად და ბიოლოგიურად მსგავსია, მაგრამ განსხვავდება ანტიგენურად. A გრიპის ყველაზე გავრცელებული ქვეტიპები, რომლებიც აინფიცირებს ადამიანებს, არის H1N1, H5N1 და H3N2."
  },
  {
    title: "ქლამიდია და მიკოპლაზმური პნევმონია",
    description: " Chlamydophila (ყოფილი Chlamydia) pneumoniae იწვევს მსუბუქ პნევმონიას ან ბრონქიტს მოზარდებში და ახალგაზრდებში. ხანდაზმულებს შეიძლება განიცდიან უფრო მძიმე დაავადება და განმეორებითი ინფექციები. ახალგაზრდების დაახლოებით 50%-ს და ხანდაზმულთა 75%-ს აქვს წინა ინფექციის სეროლოგიური მტკიცებულება. შეფასებულია, რომ პათოგენი იწვევს მოზრდილებში საზოგადოების მიერ შეძენილი პნევმონიის შემთხვევების 10-20%-ს. C pneumoniae პნევმონიის შემთხვევების სავარაუდო რაოდენობა წელიწადში 300000 შემთხვევაა."
  },
  {
    title: "Pseudomonas aeruginosa",
    description: " Pseudomonas არის გრამუარყოფითი ღერო, რომელიც ეკუთვნის Pseudomonadaceae-ს ოჯახს. Pseudomonas aeruginosa გახდა ინფექციის მნიშვნელოვანი მიზეზი, განსაკუთრებით პაციენტებში მასპინძლის დამცავი მექანიზმების დარღვევით. ფსევდომონალური ბაქტერიემია გვხვდება ავთვისებიან სიმსივნესთან, ქიმიოთერაპიასთან, შიდსთან, დამწვრობის ჭრილობის სეფსისთან და დიაბეტთან ერთად. წინასწარგანწყობილი პირობები მოიცავს ინტრავენური ხაზების განთავსებას, მძიმე დამწვრობას, საშარდე გზების კათეტერიზაციას, ოპერაციას, ტრავმას და ნაადრევ მშობიარობას. ეს არის ყველაზე გავრცელებული პათოგენი, რომელიც იზოლირებულია პაციენტებისგან, რომლებიც ჰოსპიტალიზირებულია 1 კვირაზე მეტხანს. ეს არის ნოზოკომიური ინფექციების ხშირი მიზეზი, როგორიცაა პნევმონია, ენდოკარდიტი, მენინგიტი, საშარდე გზების ინფექციები (UTIs) და ბაქტერიემია."
  },
  {
    title: "ლეგიონელა პნევმოფილა",
    description: " Legionella pneumophila არის წვრილი, პლეომორფული, დროშისებრი გრამუარყოფითი ბაქტერია ლეგიონელას გვარისა. Legionella pneumophila არის ყველგან გავრცელებული წყლის გარემოში მთელს მსოფლიოში და ბინადრობს, როგორც ამეების და პროტოზოების უჯრედშიდა პარაზიტი, რომელიც უზრუნველყოფს კავშირს ბუნებრივ გარემოსა და ადამიანის დაავადებას შორის. ამრიგად, გარემოსდაცვითი მონიტორინგი, განსაკუთრებით სასმელი წყლის, გამაგრილებელი კოშკების და მასთან დაკავშირებული წყაროების, ძირითადი აქცენტია ამ დაავადების გავრცელების კონტროლის მცდელობებში. ლეგიონერების დაავადება ჰოსპიტალში მყოფ პაციენტებში ატიპიური პნევმონიის ყველაზე გავრცელებული მიზეზია. ეს არის საზოგადოების მიერ შეძენილი ბაქტერიული პნევმონიის მეორე ყველაზე გავრცელებული მიზეზი 25% სიკვდილიანობით."
  },
  {
    title: "ადამიანის რესპირატორული სინციციალური ვირუსი (hRSV)",
    description: " ადამიანის რესპირატორული სინციციალური ვირუსი (hRSV) არის Paramyxoviridae ოჯახის უარყოფითი გრძნობის მქონე, ერთჯაჭვიანი რნმ ვირუსი, ქვედა სასუნთქი გზების მძიმე დაავადების ყველაზე გავრცელებული მიზეზი ახალშობილებსა და მცირეწლოვან ბავშვებს შორის, ჩვეულებრივ აინფიცირებს ადამიანებს 2 წლამდე და შეიძლება გამოიწვიოს შემდგომი ინფექციები მთელი ცხოვრების განმავლობაში. RSV ინფექცია ძირითადად ვლინდება როგორც ბრონქიოლიტი ან პნევმონია და იწვევს ყოველწლიურად დაახლოებით 75,000-დან 125,000 ჰოსპიტალიზაციას შეერთებულ შტატებში. მძიმე დაავადების ან სიკვდილის რისკის მქონე პირებს მიეკუთვნება ნაადრევი ჩვილები, ხანდაზმული მოზარდები და ნებისმიერი ასაკის პირები დაქვეითებული რესპირატორული, გულის ან იმუნური სისტემებით."
  },
  {
    title: "მწვავე რესპირატორული ვირუსული ინფექციები",
    description: " მწვავე რესპირატორული ვირუსული ინფექციები (ARVI) ყველაზე ხშირი დაავადებაა, რომელსაც ადამიანების უმეტესობა განიცდის მსოფლიოში. მცირეწლოვან ბავშვებს აქვთ ამ დაავადებებს შორის ხუთიდან შვიდი წელიწადში, ასაკთან ერთად სიხშირე მცირდება. მოზრდილებს წელიწადში დაახლოებით ორი ასეთი დაავადება ექნებათ.\n" +
        "მრავალფეროვანი ვირუსები, რომლებიც შეიცავს როგორც რნმ-ს, ასევე დნმ-ს, იწვევს მწვავე რესპირატორულ ინფექციებს. ყველაზე მნიშვნელოვანი ვირუსებია რინოვირუსები, კოროვირუსები, პარაგრიპის ვირუსები, რესპირატორული სინციციალური ვირუსები, ადენოვირუსები, მეტაპნევმოვირუსები."
  },
  {
    title: "ბორდეტელა",
    description: " Bordetella pertussis არის ადამიანის სავალდებულო პათოგენი და არის ყივანახველას გამომწვევი აგენტი. Bordetella parapertussis იწვევს დაავადების უფრო მსუბუქ ფორმას ადამიანებში და ასევე იწვევს რესპირატორულ ინფექციებს ცხვრებში. Bordetella bronchiseptica იწვევს დაავადებას ძუძუმწოვართა ბევრ სახეობაში, მაგრამ ადამიანები იშვიათად ინფიცირდებიან ამ ორგანიზმით და, როგორც წესი, მოიცავს იმუნოკომპრომეტირებულ პაციენტებს."
  },
  {
    title: "კორონავირუსი MERS SARS",
    description: "რაც შეეხება SARS-ს, ოჯახის საერთო ნიშნების გარდა, წყლიანი დიარეა გამოვლინდა პაციენტების 73%-ში 1 კვირის შემდეგ, რაც დაკავშირებულია კანალიზაციის გაუმართავ სისტემასთან, რაც შესაძლოა მიეკუთვნებოდეს კუჭ-ნაწლავის ტრაქტის ინფექციას ფეკალურ-ორალური გზით. SARS-ის ხანდაზმულ პაციენტებს ასევე შეუძლიათ გამოავლინონ ანორექსია ან მოტეხილობით გართულებული დაცემა. ასევე შესაძლებელია დელირიუმი.[ 46 , 47 ] მოზარდებში SARS-ის ნიშნები ახლოსაა მოზრდილებში აღმოჩენილებთან.[ 48 ] ფილტვების აუსკულტაციისას პაციენტების უმრავლესობაში რამდენიმე კვლევაში გამოვლინდა რალები ან რონქები. საქმეების სერიაში, რომელიც შესრულებულია ჰონგ კონგში JSM Peiris et al.პაციენტთა უმრავლესობას აღენიშნებოდა მორეციდივე სიმპტომები. კვლევამ გამოიკვეთა 3-კვირიანი კურსი, რომელიც დაიწყო ცხელებით და მიალგიით 1 კვირაში და პროგრესირებდა პერიოდულ ცხელებამდე, ჰიპოქსემიით, დიარეით და გულმკერდის ხანმოკლე ინფილტრატებამდე მე-2 კვირაში. ARDS განვითარდა პაციენტების 20%-ში მათი დაავადების მესამე კვირაში. " +
        "MERS-ის ინფექციით დაავადებულ პაციენტებს ხშირად აღენიშნებოდათ თავის ტკივილი, მიალგია და დიარეა.[ 50 ] MERS-ით დაავადებული 70 პაციენტისგან შემდგარი შემთხვევების სერიაში 30 (42.9%) პაციენტს განუვითარდა თირკმლის მწვავე უკმარისობა.[ 27 ] ეს მაჩვენებლები გაცილებით მაღალია ქრონიკული დაავადებული MERS პაციენტებისთვის. ერთ მოხსენებაში 58%-ს (7/12 პაციენტს) ესაჭიროებოდა თირკმლის ჩანაცვლებითი თერაპია. გარდა ამისა, ვინაიდან MERS-ის ამოღება შესაძლებელია ინფიცირებული პაციენტების შარდიდან, მკვლევარებმა გამოთქვეს ვარაუდი ვირუსული ინფექციის მიერ თირკმლის შესაძლო ჩარევის რისკზე.[51 ] ამის საპირისპიროდ, Chu KH et al.- ის მიერ ჩატარებული კვლევა . SARS-ის მქონე პაციენტებში პაციენტთა 6.3%-ს აღენიშნებოდა თირკმლის მწვავე უკმარისობა და 91.7% თირკმლის უკმარისობით გარდაიცვალა."
  },
  {
    title: "COVID-19 (SARS-Cov-2)",
    description: " ახალი კორონავირუსი (SARS-CoV-2) არის ახალი შტამი, რომელიც ადრე არ იყო გამოვლენილი ადამიანებში. მძიმე მწვავე რესპირატორული სინდრომი კორონავირუსი 2 (SARS-CoV-2), რომელიც ასევე ცნობილია როგორც 2019 წლის ახალი კორონავირუსი (2019-nCoV), არის დადებითი გრძნობის ერთჯაჭვიანი რნმ ვირუსი. ის გადამდებია ადამიანებში და არის 2019 წლის კოროვირუსული დაავადების (COVID-19) მიმდინარე პანდემიის მიზეზი, რომელიც ჯანდაცვის მსოფლიო ორგანიზაციის (WHO) მიერ არის გამოცხადებული საზოგადოებრივი ჯანმრთელობის საერთაშორისო შეშფოთების საგანგებო სიტუაციად.\n" +
        "ამჟამად ცნობილი ინფექციის ყველაზე ადრეული შემთხვევა, სავარაუდოდ, აღმოჩენილია 2019 წლის ნოემბერში. ვირუსი შემდგომში გავრცელდა ჩინეთის ყველა პროვინციაში და ასზე მეტ ქვეყანაში აზიაში, ევროპაში, ჩრდილოეთ ამერიკაში, სამხრეთ ამერიკაში, აფრიკასა და ოკეანიაში. 11 მარტს ჯანმო-მ ის ოფიციალურად გამოაცხადა პანდემიად. "
  }
]
const molecularGenetics = [
  {
    title: "მოლეკულური გენეტიკა",
    description: "მოლეკულური გენეტიკა (MG) არის ორგანიზმის გენომის მანიპულირება. ფერმის კარიბჭის გარეთ, MG გამოიყენებოდა მორგებული ბაქტერიული კულტურების შესაქმნელად. MG რძის ცხოველებში იწვევს ტრანსგენურ ცხოველებს ახალი თვისებებით, რომლებიც ვერ მიიღწევა სტანდარტული მეცხოველეობის სტრატეგიებით. ფერმის კარიბჭის შიგნით, MG-ს აქვს როლი ცხოველთა მოშენებაში . MG გამოიყენება გამომწვევი მუტაციების ან დაკავშირებული გენეტიკური მარკერების იდენტიფიცირებისთვის, რომლებიც განაპირობებენ განსხვავებებს ფენოტიპებში (ანუ ცხოველის მოქმედება). ამ მიდგომის საბოლოო მიზანია კომერციულ პოპულაციაში უმაღლესი გენეტიკა ეფექტურად და ეფექტურად გავრცელდეს."
  }
]
const virusData  = store.state.virusData
const { title, description} = virusData
onMounted(()=>{
  console.log(virusData,`title:${title}`)
})

</script>

<template>
  <Header/>
  <main>
    <div class="virus_header">
      <h1>{{title}}</h1>
    </div>
    <div class="virus_description">
      <h1>{{title}}</h1>
      <p>{{description}}</p>
    </div>
    <div class="virus_wrapper">
      <div  v-if="title == 'ჰეპატიტის ვირუსები'">
        <template v-for="(hepatitis) in hepatitisViruses">
          <div class="virus_type">
            <h1>{{hepatitis.title}}</h1>
            <p>{{hepatitis.description}}</p>
          </div>
        </template>
      </div>
      <div v-if="title == 'ადამიანის იმუნოდეფიციტის ვირუსი'">
        <template v-for="hiv in hivViruses">
          <div class="virus_type">
            <h1>{{hiv.title}}</h1>
            <p>{{hiv.description}}</p>
          </div>
        </template>
      </div>
      <div v-if="title == 'ადამიანის პაპილომა ვირუსები'">
        <template v-for="hpv in hpvViruses">
          <div class="virus_type">
            <h1>{{hpv.title}}</h1>
            <p>{{hpv.description}}</p>
          </div>
        </template>
      </div>
      <div v-if="title == 'სქესობრივი გზით გადამდები დაავადებები'">
        <template v-for="std in stdViruses">
          <div class="virus_type">
            <h1>{{std.title}}</h1>
            <p>{{std.description}}</p>
          </div>
        </template>
      </div>
      <div v-if="title == 'ჰერპეს ვირუსებით გამოწვეული ინფექციები'">
        <template v-for="herpes in herpesViruses">
          <div class="virus_type">
            <h1>{{herpes.title}}</h1>
            <p>{{herpes.description}}</p>
          </div>
        </template>
      </div>
      <div v-if="title == '„TORCH ინფექციები“'">
        <template v-for="torch in torchViruses">
          <div class="virus_type">
            <h1>{{torch.title}}</h1>
            <p>{{torch.description}}</p>
          </div>
        </template>
      </div>
      <div v-if="title == 'სასუნთქი გზების ინფექციები'">
        <template v-for="respiratory in respiratoryInfection">
          <div class="virus_type">
            <h1>{{respiratory.title}}</h1>
            <p>{{respiratory.description}}</p>
          </div>
        </template>
      </div>

    </div>
  </main>
  <Footer/>
</template>

<style scoped>
@import url("https://fonts.cdnfonts.com/css/helvetica-neue-5");
*{
  font-family: 'Helvetica Neue', sans-serif;
}
.virus_header{
  background: url("src/components/pictures/homebcg.png") no-repeat center;
  width: 100%;
  height: 30vh;
  -webkit-background-size: cover;
  background-size: cover;
  margin-top: 100px;
  display: flex;
  justify-content: center;
  align-items: center;
}
.virus_header h1{
  color: #9732ED;
}
.virus_description::after{
  content: "";
  position: absolute;
  bottom: 0; /* Position the middle line 10px above the bottom of the div */
  left: 0;
  width: 100%;
  height: 1px; /* Set the height of the middle line */
  background-color: #000; /* Choose the color of the middle line */
}
main{
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
}
.virus_description{
  margin: 100px 0;
  width: 800px;
  position: relative;
  padding-bottom: 50px;
}
.virus_description p{
  display: block;
  line-height: 35px;
  cursor: pointer;
}
.virus_description h1{
  text-align: center;
  margin-bottom: 25px;
}
.virus_type{
  margin: 150px 0;
  width: 800px;
  position: relative;
  padding-bottom: 50px;
  text-align: left;
}


.virus_type p{
  display: block;
  line-height: 35px;
}
.virus_type h1{
  text-align: center;
  margin-bottom: 25px;
}
.virus_type::after {
  content: "";
  position: absolute;
  bottom: 10px; /* Position the middle line 10px above the bottom of the div */
  left: 0;
  width: 100%;
  height: 1px; /* Set the height of the middle line */
  background-color: #000; /* Choose the color of the middle line */
}

</style>